
List highschool_kanji_list=
["静清高等学校", "愛国学園大学附属四街道高等学校", "愛国学園大学附属龍ヶ崎高等学校", "愛知高等学校", "愛知教育大学附属高等学校", "愛知啓成高等学校", "愛知商業高等学校", "阿久比高等学校", "旭丘高等学校", "旭野高等学校", "足助高等学校", "熱田高等学校", "渥美農業高等学校", "安城高等学校", "安城農林高等学校", "安城東高等学校", "安城南高等学校", "惟信高等学校", "一宮高等学校", "一宮北高等学校", "一宮工科高等学校", "一宮興道高等学校", "一宮商業高等学校", "一宮西高等学校", "一宮南高等学校", "一色高等学校", "稲沢高等学校", "稲沢東高等学校", "犬山高等学校", "犬山南高等学校", "岩倉総合高等学校", "岩津高等学校", "内海高等学校", "海翔高等学校", "大府高等学校", "大府東高等学校", "岡崎高等学校", "岡崎北高等学校", "岡崎工科高等学校", "岡崎商業高等学校", "岡崎西高等学校", "岡崎東高等学校", "鶴城丘高等学校", "春日井高等学校", "春日井工科高等学校", "春日井商業高等学校", "春日井西高等学校", "春日井東高等学校", "春日井南高等学校", "蒲郡高等学校", "蒲郡東高等学校", "加茂丘高等学校", "刈谷高等学校", "刈谷北高等学校", "刈谷工科高等学校", "刈谷東高等学校", "一宮起工科高等学校", "木曽川高等学校", "杏和高等学校", "旭陵高等学校", "吉良高等学校", "高蔵寺高等学校", "幸田高等学校", "江南高等学校", "国府高等学校", "小坂井高等学校", "五条高等学校", "古知野高等学校", "小牧高等学校", "小牧工業高等学校", "小牧南高等学校", "衣台高等学校", "愛西工科高等学校", "猿投農林高等学校", "佐屋高等学校", "時習館高等学校", "昭和高等学校", "新川高等学校", "新城有教館高等学校", "瑞陵高等学校", "瀬戸高等学校", "瀬戸北総合高等学校", "瀬戸西高等学校", "瀬戸工科高等学校", "高浜高等学校", "田口高等学校", "武豊高等学校", "千種高等学校", "知多翔洋高等学校", "知立高等学校", "知立東高等学校", "津島高等学校", "津島北高等学校", "津島東高等学校", "天白高等学校", "東海樟風高等学校", "東海南高等学校", "東郷高等学校", "桃陵高等学校", "常滑高等学校", "豊明高等学校", "豊丘高等学校", "豊川工科高等学校", "豊田高等学校", "豊田北高等学校", "豊田工科高等学校", "豊田西高等学校", "豊田東高等学校", "豊田南高等学校", "豊野高等学校", "豊橋工科高等学校", "豊橋商業高等学校", "豊橋西高等学校", "豊橋東高等学校", "豊橋南高等学校", "中川商業高等学校", "長久手高等学校", "中村高等学校", "名古屋西高等学校", "名古屋南高等学校", "成章高等学校", "鳴海高等学校", "南陽高等学校", "西尾高等学校", "西尾東高等学校", "西春高等学校", "日進高等学校", "日進西高等学校", "丹羽高等学校", "半田高等学校", "半田工科高等学校", "半田商業高等学校", "半田農業高等学校", "半田東高等学校", "東浦高等学校", "尾西高等学校", "尾北高等学校", "福江高等学校", "碧南高等学校", "碧南工科高等学校", "松蔭高等学校", "松平高等学校", "三谷水産高等学校", "御津高等学校", "緑丘高等学校", "三好高等学校", "美和高等学校", "名古屋工科高等学校", "明和高等学校", "守山高等学校", "横須賀高等学校", "愛知工業大学名電高等学校", "愛知産業大学工業高等学校", "愛知産業大学三河高等学校", "愛知淑徳高等学校", "愛知みずほ大学瑞穂高等学校", "会津若松ザベリオ学園高等学校", "愛徳学園高等学校", "青森明の星高等学校", "青森高等学校", "青森北高等学校", "青森工業高等学校", "青森商業高等学校", "青森中央高等学校", "青森西高等学校", "青森東高等学校", "青森南高等学校", "鰺ヶ沢高等学校", "尾上総合高等学校", "柏木農業高等学校", "黒石高等学校", "五所川原高等学校", "五所川原工業高等学校", "五所川原農林高等学校", "三本木高等学校", "三本木農業高等学校", "大湊高等学校", "田名部高等学校", "十和田工業高等学校", "七戸高等学校", "八戸高等学校", "八戸北高等学校", "八戸工業高等学校", "八戸商業高等学校", "八戸水産高等学校", "八戸中央高等学校", "八戸西高等学校", "八戸東高等学校", "弘前高等学校", "弘前工業高等学校", "弘前実業高等学校", "弘前中央高等学校", "弘前南高等学校", "北斗高等学校", "三沢高等学校", "三沢商業高等学校", "木造高等学校", "百石高等学校", "青森山田高等学校", "明石市立明石商業高等学校", "暁高等学校", "秋草学園高等学校", "秋田高等学校", "秋田北高等学校", "秋田工業高等学校", "秋田中央高等学校", "秋田西高等学校", "秋田南高等学校", "秋田明徳館高等学校", "新屋高等学校", "羽後高等学校", "大館国際情報学院高等学校", "大館鳳鳴高等学校", "大曲高等学校", "大曲工業高等学校", "大曲農業高等学校", "男鹿海洋高等学校", "角館高等学校", "金足農業高等学校", "小坂高等学校", "秋田北鷹高等学校", "仁賀保高等学校", "西仙北高等学校", "西目高等学校", "能代高等学校", "能代工業高等学校", "花輪高等学校", "本荘高等学校", "増田高等学校", "湯沢高等学校", "湯沢翔北高等学校", "由利高等学校", "横手高等学校", "横手清陵学院高等学校", "横手城南高等学校", "六郷高等学校", "秋田市立秋田商業高等学校", "秋田市立御所野学院高等学校", "秋田令和高等学校", "仙台大学附属明成高等学校", "明秀学園日立高等学校", "浜松修学舎高等学校", "浅野高等学校", "旭丘高等学校", "朝日塾中等教育学校 後期課程", "麻布大学附属高等学校", "足利大学附属高等学校", "足利短期大学附属高等学校", "芦屋学園高等学校", "飛鳥未来高等学校", "あずさ第一高等学校", "厚木中央高等学校", "我孫子二階堂高等学校", "尼崎市立尼崎高等学校", "綾羽高等学校", "荒井学園新川高等学校", "有明高等学校", "アレセイア湘南高等学校", "安城学園高等学校", "安城学園岡崎城西高等学校", "飯田女子高等学校", "飯塚高等学校", "育英高等学校", "育英西高等学校", "池田高等学校", "穴水高等学校", "飯田高等学校", "内灘高等学校", "金沢泉丘高等学校", "金沢向陽高等学校", "金沢桜丘高等学校", "金沢商業高等学校", "金沢辰巳丘高等学校", "金沢西高等学校", "金沢錦丘高等学校", "金沢二水高等学校", "金沢伏見高等学校", "金沢北陵高等学校", "石川県立工業高等学校", "小松高等学校", "小松工業高等学校", "小松商業高等学校", "小松明峰高等学校", "翠星高等学校", "大聖寺高等学校", "大聖寺実業高等学校", "田鶴浜高等学校", "鶴来高等学校", "寺井高等学校", "七尾高等学校", "七尾東雲高等学校", "野々市明倫高等学校", "羽咋高等学校", "羽咋工業高等学校", "宝達高等学校", "松任高等学校", "鹿西高等学校", "輪島高等学校", "桜坂高等学校", "出水市立出水商業高等学校", "出水中央高等学校", "伊勢学園高等学校", "伊丹市立伊丹高等学校", "市川高等学校", "一関学院高等学校", "一関修紅高等学校", "市原中央高等学校", "伊那西高等学校", "茨城高等学校", "茨城キリスト教学園高等学校", "麻生高等学校", "石岡商業高等学校", "石岡第一高等学校", "石岡第二高等学校", "石下紫峰高等学校", "伊奈高等学校", "茨城東高等学校", "岩瀬高等学校", "牛久高等学校", "牛久栄進高等学校", "江戸崎総合高等学校", "太田第一高等学校", "太田西山高等学校", "小瀬高等学校", "笠間高等学校", "鹿島高等学校", "勝田高等学校", "勝田工業高等学校", "神栖高等学校", "鬼怒商業高等学校", "古河第一高等学校", "古河第三高等学校", "古河第二高等学校", "境高等学校", "佐和高等学校", "下館工業高等学校", "下館第一高等学校", "下館第二高等学校", "下妻第一高等学校", "下妻第二高等学校", "総和工業高等学校", "大子清流高等学校", "多賀高等学校", "高萩高等学校", "高萩清松高等学校", "竹園高等学校", "中央高等学校", "つくば工科高等学校", "土浦工業高等学校", "土浦湖北高等学校", "土浦第一高等学校", "土浦第三高等学校", "土浦第二高等学校", "東海高等学校", "友部高等学校", "取手松陽高等学校", "取手第一高等学校", "取手第二高等学校", "那珂高等学校", "那珂湊高等学校", "並木中等教育学校 後期課程", "波崎高等学校", "波崎柳川高等学校", "日立北高等学校", "日立工業高等学校", "日立商業高等学校", "日立第一高等学校", "日立第二高等学校", "藤代高等学校", "藤代紫水高等学校", "鉾田第一高等学校", "鉾田第二高等学校", "真壁高等学校", "水海道第一高等学校", "水海道第二高等学校", "水戸工業高等学校", "水戸桜ノ牧高等学校", "水戸商業高等学校", "水戸第一高等学校", "水戸第三高等学校", "水戸第二高等学校", "水戸農業高等学校", "水戸南高等学校", "緑岡高等学校", "守谷高等学校", "八千代高等学校", "結城第一高等学校", "竜ヶ崎第一高等学校", "竜ヶ崎第二高等学校", "竜ヶ崎南高等学校", "指宿市立指宿商業高等学校", "今治明徳高等学校", "いわき秀英高等学校", "磐城緑蔭高等学校", "岩瀬日本大学高等学校", "岩田高等学校", "磐田東高等学校", "岩手高等学校", "花北青雲高等学校", "一関工業高等学校", "一関第一高等学校", "一関第二高等学校", "一戸高等学校", "岩泉高等学校", "岩谷堂高等学校", "大船渡高等学校", "金ケ崎高等学校", "釜石高等学校", "北上翔南高等学校", "久慈高等学校", "久慈東高等学校", "黒沢尻北高等学校", "黒沢尻工業高等学校", "不来方高等学校", "紫波総合高等学校", "大東高等学校", "平舘高等学校", "高田高等学校", "遠野高等学校", "花巻北高等学校", "花巻農業高等学校", "花巻南高等学校", "福岡高等学校", "水沢高等学校", "水沢工業高等学校", "水沢商業高等学校", "宮古高等学校", "盛岡北高等学校", "盛岡工業高等学校", "盛岡商業高等学校", "盛岡第一高等学校", "盛岡第三高等学校", "盛岡第二高等学校", "盛岡第四高等学校", "盛岡農業高等学校", "盛岡南高等学校", "岩手女子高等学校", "仁川学院高等学校", "植草学園大学附属高等学校", "上田西高等学校", "鶯谷高等学校", "宇都宮短期大学附属高等学校", "宇都宮海星女子学院高等学校", "宇都宮文星女子高等学校", "宇部鴻城高等学校", "宇部フロンティア大学付属香川高等学校", "梅光学院高等学校", "浦和明の星女子高等学校", "浦和学院高等学校", "浦和実業学園高等学校", "浦和ルーテル学院高等学校", "栄光学園高等学校", "盈進高等学校", "英数学館高等学校", "栄徳高等学校", "AICJ高等学校", "エクセラン高等学校", "江戸川学園取手高等学校", "今治北高等学校", "今治工業高等学校", "今治西高等学校", "今治南高等学校", "伊予高等学校", "伊予農業高等学校", "宇和高等学校", "宇和島東高等学校", "大洲高等学校", "大洲農業高等学校", "上浮穴高等学校", "川之石高等学校", "川之江高等学校", "北宇和高等学校", "小松高等学校", "西条高等学校", "丹原高等学校", "土居高等学校", "東温高等学校", "長浜高等学校", "新居浜工業高等学校", "新居浜商業高等学校", "新居浜西高等学校", "新居浜東高等学校", "新居浜南高等学校", "野村高等学校", "北条高等学校", "松山北高等学校", "松山工業高等学校", "松山商業高等学校", "松山中央高等学校", "松山東高等学校", "松山南高等学校", "三島高等学校", "八幡浜高等学校", "吉田高等学校", "愛媛大学附属高等学校", "オイスカ浜松国際高等学校", "桜花学園高等学校", "近江高等学校", "近江兄弟社高等学校", "大分高等学校", "宇佐高等学校", "臼杵高等学校", "大分上野丘高等学校", "大分雄城台高等学校", "大分工業高等学校", "大分商業高等学校", "大分鶴崎高等学校", "大分西高等学校", "大分東高等学校", "大分豊府高等学校", "大分舞鶴高等学校", "大分南高等学校", "杵築高等学校", "玖珠美山高等学校", "国東高等学校", "芸術緑丘高等学校", "佐伯鶴城高等学校", "佐伯豊南高等学校", "情報科学高等学校", "高田高等学校", "竹田高等学校", "津久見高等学校", "鶴崎工業高等学校", "中津北高等学校", "中津東高等学校", "中津南高等学校", "日田高等学校", "日田三隈高等学校", "日田林工高等学校", "別府翔青高等学校", "別府鶴見丘高等学校", "由布高等学校", "大分国際情報高等学校", "大分東明高等学校", "大垣日本大学高等学校", "太田市立太田高等学校", "大多和学園 開星高等学校", "大妻嵐山高等学校", "鵬学園高等学校", "大西学園高等学校", "大宮開成高等学校", "大牟田高等学校", "岡山高等学校", "岡山学芸館高等学校", "作陽学園高等学校", "岡山県高梁日新高等学校", "岡山県美作高等学校", "井原高等学校 北校地", "烏城高等学校", "岡山一宮高等学校", "岡山工業高等学校", "岡山城東高等学校", "岡山操山高等学校", "岡山大安寺中等教育学校 後期課程", "岡山東商業高等学校", "岡山芳泉高等学校", "岡山御津高等学校", "岡山南高等学校", "邑久高等学校", "真庭高等学校落合校地", "笠岡高等学校", "笠岡工業高等学校", "笠岡商業高等学校", "勝間田高等学校", "勝山高等学校 勝山校地", "鴨方高等学校", "倉敷天城高等学校", "倉敷工業高等学校", "倉敷古城池高等学校", "倉敷商業高等学校", "倉敷青陵高等学校", "倉敷中央高等学校", "倉敷南高等学校", "倉敷鷲羽高等学校", "興陽高等学校", "西大寺高等学校", "瀬戸高等学校", "瀬戸南高等学校", "総社高等学校", "総社南高等学校", "高梁高等学校", "高梁城南高等学校", "高松農業高等学校", "玉島高等学校", "玉島商業高等学校", "玉野高等学校", "玉野光南高等学校", "津山高等学校", "津山工業高等学校", "津山商業高等学校", "津山東高等学校", "新見高等学校南校地", "東岡山工業高等学校", "備前緑陽高等学校", "水島工業高等学校", "矢掛高等学校", "林野高等学校", "和気閑谷高等学校", "おかやま山陽高等学校", "岡山商科大学附属高等学校", "岡山市立岡山後楽館高等学校", "岡山白陵高等学校", "岡山理科大学附属高等学校", "岡山龍谷高等学校", "沖学園高等学校", "沖縄カトリック高等学校", "石川高等学校", "糸満高等学校", "浦添高等学校", "浦添工業高等学校", "浦添商業高等学校", "沖縄工業高等学校", "開邦高等学校", "嘉手納高等学校", "北谷高等学校", "北中城高等学校", "北山高等学校", "宜野湾高等学校", "球陽高等学校", "具志川高等学校", "具志川商業高等学校", "向陽高等学校", "コザ高等学校", "首里高等学校", "首里東高等学校", "小禄高等学校", "知念高等学校", "中部商業高等学校", "中部農林高等学校", "泊高等学校", "豊見城高等学校", "豊見城南高等学校", "名護高等学校", "名護商工高等学校", "那覇高等学校", "那覇工業高等学校", "那覇国際高等学校", "那覇商業高等学校", "那覇西高等学校", "南部商業高等学校", "南部農林高等学校", "西原高等学校", "南風原高等学校", "普天間高等学校", "本部高等学校", "前原高等学校", "真和志高等学校", "美里高等学校", "美里工業高等学校", "宮古高等学校", "宮古総合実業高等学校", "美来工科高等学校", "八重山高等学校", "陽明高等学校", "与勝高等学校", "読谷高等学校", "沖縄尚学高等学校", "尾道高等学校", "金沢龍谷高等学校", "折尾愛真高等学校", "開志学園高等学校", "開新高等学校", "開智高等学校", "大手前丸亀高等学校", "大手前高松高等学校", "飯山高等学校", "石田高等学校", "香川中央高等学校", "笠田高等学校", "観音寺第一高等学校", "観音寺総合高等学校", "琴平高等学校", "坂出高等学校", "坂出工業高等学校", "坂出商業高等学校", "三本松高等学校", "志度高等学校", "善通寺第一高等学校", "高瀬高等学校", "高松高等学校", "高松北高等学校", "高松工芸高等学校", "高松桜井高等学校", "高松商業高等学校", "高松西高等学校", "高松東高等学校", "高松南高等学校", "多度津高等学校", "津田高等学校", "農業経営高等学校", "丸亀高等学校", "丸亀城西高等学校", "三木高等学校", "香川誠陵高等学校", "四国学院大学香川西高等学校", "杜若高等学校", "津田学園高等学校", "鹿児島高等学校", "鹿児島育英館高等学校", "奄美高等学校", "伊佐農林高等学校", "伊集院高等学校", "出水高等学校", "市来農芸高等学校", "指宿高等学校", "大口高等学校", "大島高等学校", "開陽高等学校（通信制）", "鶴翔高等学校", "鹿児島工業高等学校", "鹿児島中央高等学校", "鹿児島東高等学校", "鹿児島南高等学校", "加治木高等学校", "加治木工業高等学校", "加世田高等学校", "鹿屋高等学校", "鹿屋工業高等学校", "鹿屋農業高等学校", "蒲生高等学校", "川内高等学校", "川辺高等学校", "霧島高等学校", "錦江湾高等学校", "串木野高等学校", "串良商業高等学校", "甲南高等学校", "国分高等学校", "薩南工業高等学校", "薩摩中央高等学校", "志布志高等学校", "松陽高等学校", "川薩清修館高等学校", "川内商工高等学校", "武岡台高等学校", "種子島高等学校", "鶴丸高等学校", "野田女子高等学校", "隼人工業高等学校", "吹上高等学校", "福山高等学校", "枕崎高等学校", "明桜館高等学校", "屋久島高等学校", "鹿児島実業高等学校", "鹿児島純心女子高等学校", "鹿児島城西高等学校", "鹿児島情報高等学校", "鹿児島市立鹿児島玉龍高等学校", "鹿児島市立鹿児島商業高等学校", "鹿児島市立鹿児島女子高等学校", "鹿児島第一高等学校", "龍桜高等学校", "橿原学院高等学校", "鹿島学園高等学校", "柏木学園高等学校", "柏市立柏高等学校", "日本体育大学柏高等学校", "中部大学春日丘高等学校", "春日部共栄高等学校", "霞ヶ浦高等学校", "片山学園高等学校", "学校法人石川高等学校", "活水高等学校", "加藤学園高等学校", "加藤学園暁秀高等学校", "神奈川学園高等学校", "愛川高等学校", "相原高等学校", "旭高等学校", "麻溝台高等学校", "足柄高等学校", "麻生高等学校", "麻生総合高等学校", "厚木高等学校", "厚木北高等学校", "厚木商業高等学校", "厚木清南高等学校", "厚木西高等学校", "厚木東高等学校", "綾瀬高等学校", "綾瀬西高等学校", "有馬高等学校", "生田高等学校", "生田東高等学校", "伊志田高等学校", "伊勢原高等学校", "磯子工業高等学校", "市ヶ尾高等学校", "荏田高等学校", "海老名高等学校", "大井高等学校", "大磯高等学校", "小田原高等学校", "小田原城北工業高等学校", "小田原東高等学校", "追浜高等学校", "海洋科学高等学校", "金井高等学校", "神奈川工業高等学校", "神奈川総合高等学校", "神奈川総合産業高等学校", "金沢総合高等学校", "鎌倉高等学校", "釜利谷高等学校", "上鶴間高等学校", "上溝高等学校", "上溝南高等学校", "上矢部高等学校", "川崎高等学校", "川崎北高等学校", "川崎工科高等学校", "川和高等学校", "岸根高等学校", "希望ケ丘高等学校", "霧が丘高等学校", "港北高等学校", "光陵高等学校", "相模原中等教育学校 後期課程", "相模向陽館高等学校", "相模田名高等学校", "相模原高等学校", "相模原青陵高等学校", "相模原総合高等学校", "座間高等学校", "座間総合高等学校", "七里ガ浜高等学校", "商工高等学校", "湘南高等学校", "湘南台高等学校", "松陽高等学校", "城郷高等学校", "相模原城山高等学校", "新栄高等学校", "新城高等学校", "菅高等学校", "逗子高等学校", "住吉高等学校", "逗葉高等学校", "西湘高等学校", "瀬谷高等学校", "瀬谷西高等学校", "寒川高等学校", "大師高等学校", "大船高等学校", "大和西高等学校", "高浜高等学校", "田奈高等学校", "多摩高等学校", "茅ヶ崎高等学校", "茅ヶ崎西浜高等学校", "茅ケ崎北陵高等学校", "中央農業高等学校", "津久井高等学校", "津久井浜高等学校", "鶴見高等学校", "鶴見総合高等学校", "鶴嶺高等学校", "永谷高等学校", "新羽高等学校", "二宮高等学校", "白山高等学校", "柏陽高等学校", "橋本高等学校", "秦野高等学校", "秦野総合高等学校", "秦野曽屋高等学校", "横浜氷取沢高等学校", "平塚工科高等学校", "平塚江南高等学校", "平塚商業高等学校", "平塚湘風高等学校", "平塚農業高等学校", "深沢高等学校", "藤沢工科高等学校", "藤沢清流高等学校", "藤沢総合高等学校", "藤沢西高等学校", "二俣川看護福祉高等学校", "保土ヶ谷高等学校", "舞岡高等学校", "三浦初声高等学校 入江キャンパス", "向の岡工業高等学校", "元石川高等学校", "弥栄高等学校", "山北高等学校", "大和高等学校", "大和東高等学校", "大和南高等学校", "百合丘高等学校", "横須賀高等学校", "横須賀大津高等学校", "横須賀工業高等学校", "横須賀明光高等学校", "横浜桜陽高等学校", "横浜旭陵高等学校", "横浜国際高等学校", "横浜栄高等学校", "横浜修悠館高等学校", "横浜翠嵐高等学校", "横浜清陵高等学校", "横浜立野高等学校", "横浜南陵高等学校", "横浜平沼高等学校", "横浜緑園高等学校", "横浜緑ケ丘高等学校", "吉田島高等学校", "神奈川大学附属高等学校", "金沢高等学校", "金沢学院高等学校", "金沢市立工業高等学校", "金沢大学附属高等学校", "鹿屋市立鹿屋女子高等学校", "鹿屋中央高等学校", "鎌倉学園高等学校", "鎌倉女学院高等学校", "鎌倉女子大学高等部", "神村学園高等部", "加茂暁星高等学校", "カリタス女子高等学校", "川越市立川越高等学校", "川越東高等学校", "川崎市立川崎高等学校", "川崎市立川崎総合科学高等学校", "川崎市立幸高等学校", "川崎市立高津高等学校", "川崎市立橘高等学校", "関西高等学校", "関西中央高等学校", "関西学院高等部", "関東学院高等学校", "関東学院六浦高等学校", "関東学園大学附属高等学校", "函嶺白百合学園高等学校", "菊華高等学校", "菊池女子高等学校", "木更津総合高等学校", "北鎌倉女子学園高等学校", "北九州市立高等学校", "吉備高原学園高等学校", "池田高等学校", "揖斐高等学校", "恵那高等学校", "恵那農業高等学校", "恵那南高等学校", "大垣北高等学校", "大垣工業高等学校", "大垣桜高等学校", "大垣商業高等学校", "大垣西高等学校", "大垣東高等学校", "大垣南高等学校", "大垣養老高等学校", "海津明誠高等学校", "各務原高等学校", "各務原西高等学校", "可児高等学校", "可児工業高等学校", "加納高等学校", "加茂高等学校", "加茂農林高等学校", "華陽フロンティア高等学校", "岐山高等学校", "岐南工業高等学校", "岐阜高等学校", "岐阜各務野高等学校", "岐阜北高等学校", "岐阜工業高等学校", "岐阜商業高等学校", "岐阜城北高等学校", "岐阜総合学園高等学校", "岐阜農林高等学校", "郡上高等学校", "郡上北高等学校", "関高等学校", "関有知高等学校", "武義高等学校", "多治見高等学校", "多治見北高等学校", "多治見工業高等学校", "土岐紅陵高等学校", "土岐商業高等学校", "東濃実業高等学校", "東濃フロンティア高等学校", "中津高等学校", "中津川工業高等学校", "中津商業高等学校", "長良高等学校", "羽島高等学校", "羽島北高等学校", "斐太高等学校", "飛騨高山高等学校", "不破高等学校", "益田清風高等学校", "瑞浪高等学校", "本巣松陽高等学校", "八百津高等学校", "吉城高等学校", "岐阜女子高等学校", "岐阜市立岐阜商業高等学校", "岐阜聖徳学園高等学校", "岐阜第一高等学校", "岐阜東高等学校", "希望が丘高等学校", "九州学院高等学校", "九州国際大学付属高等学校", "九州産業大学付属九州高等学校", "九州産業大学付属九州産業高等学校", "九州文化学園高等学校", "共愛学園高等学校", "享栄高等学校", "暁星国際高等学校", "協和学院水沢第一高等学校", "霧島市立国分中央高等学校", "基督教独立学園高等学校", "桐生市立商業高等学校", "桐生第一高等学校", "銀河学院高等学校", "近畿大学附属新宮高等学校", "近畿大学附属豊岡高等学校", "近畿大学附属広島高等学校 東広島校", "近畿大学附属福岡高等学校", "近畿大学附属広島高等学校 福山校", "近畿大学附属和歌山高等学校", "金城学院高等学校", "鵠沼高等学校", "九里学園高等学校", "熊本学園大学付属高等学校", "芦北高等学校", "阿蘇中央高等学校 阿蘇校舎", "天草高等学校", "岱志高等学校", "宇土高等学校", "大津高等学校", "小川工業高等学校", "鹿本高等学校", "鹿本商工高等学校", "鹿本農業高等学校", "菊池高等学校", "菊池農業高等学校", "球磨工業高等学校", "熊本高等学校", "熊本北高等学校", "熊本工業高等学校", "熊本商業高等学校", "熊本西高等学校", "熊本農業高等学校", "翔陽高等学校", "済々黌高等学校", "第一高等学校", "第二高等学校", "玉名高等学校", "玉名工業高等学校", "東稜高等学校", "人吉高等学校", "北稜高等学校", "松橋高等学校", "水俣高等学校", "御船高等学校", "八代高等学校", "八代工業高等学校", "八代東高等学校", "八代清流高等学校", "天草拓心高等学校本渡校舎", "熊本国府高等学校", "熊本市立千原台高等学校", "熊本市立必由館高等学校", "熊本中央高等学校", "熊本信愛女学院高等学校", "熊本マリスト学園高等学校", "公文国際学園高等部", "倉敷高等学校", "倉敷市立倉敷翔南高等学校", "倉敷市立真備陵南高等学校", "倉敷翠松高等学校", "久留米学園高等学校", "久留米市立久留米商業高等学校", "久留米市立南筑高等学校", "久留米信愛高等学校", "久留米大学附設高等学校", "呉青山高等学校", "呉市立呉高等学校", "呉港高等学校", "安中総合学園高等学校", "伊勢崎高等学校", "伊勢崎工業高等学校", "伊勢崎興陽高等学校", "伊勢崎商業高等学校", "伊勢崎清明高等学校", "板倉高等学校", "大泉高等学校", "太田高等学校", "太田工業高等学校", "太田女子高等学校", "太田東高等学校", "太田フレックス高等学校", "大間々高等学校", "尾瀬高等学校", "桐生高等学校", "桐生工業高等学校", "渋川高等学校", "渋川工業高等学校", "渋川女子高等学校", "渋川青翠高等学校", "勢多農林高等学校", "高崎高等学校", "高崎北高等学校", "高崎工業高等学校", "高崎商業高等学校", "高崎女子高等学校", "高崎東高等学校", "館林高等学校", "館林商工高等学校", "館林女子高等学校", "富岡高等学校", "西邑楽高等学校", "新田暁高等学校", "沼田高等学校", "沼田女子高等学校", "榛名高等学校", "藤岡北高等学校", "藤岡中央高等学校", "前橋高等学校", "前橋工業高等学校", "前橋商業高等学校", "前橋女子高等学校", "前橋清陵高等学校", "前橋西高等学校", "前橋東高等学校", "前橋南高等学校", "万場高等学校", "吉井高等学校", "利根実業高等学校", "敬愛高等学校", "敬愛学園高等学校", "敬愛大学八日市場高等学校", "慶應義塾高等学校", "慶應義塾志木高等学校", "慶應義塾湘南藤沢高等部", "啓新高等学校", "慶進高等学校", "慶成高等学校", "慶誠高等学校", "瓊浦高等学校", "啓明学院高等学校", "啓明学館高等学校", "敬和学園高等学校", "賢明女子学院高等学校", "皇學館高等学校", "甲子園学院高等学校", "向上高等学校", "興譲館高等学校", "浜松学院高等学校", "八戸学院光星高等学校", "光泉カトリック高等学校", "高知高等学校", "高知学芸高等学校", "安芸高等学校", "伊野商業高等学校", "岡豊高等学校", "窪川高等学校", "高知小津高等学校", "高知追手前高等学校", "高知工業高等学校", "高知国際高等学校", "高知農業高等学校", "高知東高等学校", "高知丸の内高等学校", "高知南高等学校", "清水高等学校", "宿毛工業高等学校", "中村高等学校", "春野高等学校", "山田高等学校", "高知市立高知商業高等学校", "高知中央高等学校", "高朋高等学校", "興南高等学校", "甲南高等学校", "江南義塾盛岡高等学校", "甲南女子高等学校", "江の川学園 石見智翠館高等学校", "国府台女子学院高等部", "幸福の科学学園高等学校", "甲府市立甲府商業高等学校", "甲斐清和高等学校", "神戸海星女子学院高等学校", "神戸学院大学附属高等学校", "神戸弘陵学園高等学校", "神戸国際大学附属高等学校", "神戸女学院高等学部", "神戸市立科学技術高等学校", "神戸市立葺合高等学校", "神戸市立摩耶兵庫高等学校", "神戸市立六甲アイランド高等学校", "神戸星城高等学校", "神戸第一高等学校", "神戸常盤女子高等学校", "神戸野田高等学校", "彩星工科高等学校", "神戸山手女子高等学校", "神戸龍谷高等学校", "英理女子学院高等学校", "光明学園相模原高等学校", "高野山高等学校", "向陽高等学校", "甲陽学院高等学校", "広陵高等学校", "高稜高等学校", "郡山女子大学附属高等学校", "國學院大學栃木高等学校", "国際学院高等学校", "五所川原商業高等学校", "五所川原第一高等学校", "御殿場西高等学校", "小林聖心女子学院高等学校", "小松大谷高等学校", "小松市立高等学校", "叡明高等学校", "浦和麗明高等学校", "金光学園高等学校", "西海学園高等学校", "川口北高等学校", "上尾高等学校", "上尾鷹の台高等学校", "上尾橘高等学校", "上尾南高等学校", "朝霞高等学校", "朝霞西高等学校", "いずみ高等学校", "伊奈学園総合高等学校", "入間向陽高等学校", "岩槻高等学校", "岩槻商業高等学校", "岩槻北陵高等学校", "浦和高等学校", "浦和北高等学校", "浦和工業高等学校", "浦和商業高等学校", "浦和第一女子高等学校", "浦和西高等学校", "浦和東高等学校", "ふじみ野高等学校", "大宮高等学校", "大宮工業高等学校", "大宮光陵高等学校", "大宮商業高等学校", "大宮中央高等学校（通信制）", "大宮東高等学校", "大宮南高等学校", "大宮武蔵野高等学校", "小鹿野高等学校", "小川高等学校", "桶川高等学校", "桶川西高等学校", "越生高等学校", "春日部高等学校", "春日部工業高等学校", "春日部女子高等学校", "春日部東高等学校", "川口高等学校", "川口工業高等学校", "川口青陵高等学校", "川口東高等学校", "川越高等学校", "川越工業高等学校", "川越女子高等学校", "川越総合高等学校", "川越西高等学校", "川越初雁高等学校", "川越南高等学校", "北本高等学校", "久喜高等学校", "久喜工業高等学校", "久喜北陽高等学校", "熊谷高等学校", "熊谷工業高等学校", "熊谷商業高等学校", "熊谷女子高等学校", "熊谷西高等学校", "熊谷農業高等学校", "栗橋北彩高等学校", "芸術総合高等学校", "鴻巣高等学校", "鴻巣女子高等学校", "越ヶ谷高等学校", "越谷北高等学校", "越谷総合技術高等学校", "越谷西高等学校", "越谷東高等学校", "越谷南高等学校", "児玉高等学校", "児玉白楊高等学校", "坂戸高等学校", "坂戸西高等学校", "幸手桜高等学校", "狭山経済高等学校", "狭山工業高等学校", "狭山清陵高等学校", "狭山緑陽高等学校", "志木高等学校", "庄和高等学校", "白岡高等学校", "進修館高等学校", "杉戸高等学校", "杉戸農業高等学校", "誠和福祉高等学校", "草加高等学校", "草加西高等学校", "草加東高等学校", "草加南高等学校", "秩父高等学校", "秩父農工科学高等学校", "鶴ヶ島清風高等学校", "常盤高等学校", "所沢高等学校", "所沢北高等学校", "所沢商業高等学校", "所沢中央高等学校", "所沢西高等学校", "戸田翔陽高等学校", "豊岡高等学校", "滑川総合高等学校", "南稜高等学校", "新座高等学校", "新座総合技術高等学校", "新座柳瀬高等学校", "蓮田松韻高等学校", "鳩ヶ谷高等学校", "鳩山高等学校", "羽生高等学校", "羽生実業高等学校", "羽生第一高等学校", "飯能高等学校", "日高高等学校", "深谷高等学校", "深谷商業高等学校", "深谷第一高等学校", "吹上秋桜高等学校", "富士見高等学校", "不動岡高等学校", "本庄高等学校", "松伏高等学校", "松山高等学校", "松山女子高等学校", "三郷高等学校", "三郷北高等学校", "三郷工業技術高等学校", "皆野高等学校", "宮代高等学校", "妻沼高等学校", "八潮高等学校", "八潮南高等学校", "吉川美南高等学校", "与野高等学校", "寄居城北高等学校", "和光高等学校", "和光国際高等学校", "鷲宮高等学校", "蕨高等学校", "埼玉栄高等学校", "さいたま市立浦和高等学校", "さいたま市立浦和南高等学校", "さいたま市立大宮北高等学校", "埼玉平成高等学校", "済美高等学校", "山形明正高等学校", "坂出第一高等学校", "栄北高等学校", "栄東高等学校", "佐賀学園高等学校", "有田工業高等学校", "伊万里高等学校", "伊万里実業高等学校商業キャンパス", "牛津高等学校", "嬉野高等学校 嬉野校舎（総合学科キャンパス）", "鹿島高等学校 赤門学舎", "鹿島高等学校 大手門学舎", "唐津工業高等学校", "唐津商業高等学校", "唐津西高等学校", "唐津東高等学校", "唐津南高等学校", "神埼高等学校", "神埼清明高等学校", "厳木高等学校", "高志館高等学校", "小城高等学校", "佐賀北高等学校", "佐賀工業高等学校", "佐賀商業高等学校", "佐賀西高等学校", "佐賀農業高等学校", "佐賀東高等学校", "多久高等学校", "武雄高等学校", "致遠館高等学校", "鳥栖高等学校", "鳥栖工業高等学校", "鳥栖商業高等学校", "三養基高等学校", "佐賀女子短期大学付属佐賀女子高等学校", "佐賀清和高等学校", "酒田南高等学校", "相模女子大学高等部", "龍谷高等学校", "作新学院高等学校", "佐久長聖高等学校", "さくら国際高等学校", "桜の聖母学院高等学校", "桜林高等学校", "佐野清澄高等学校", "佐野日本大学高等学校", "サビエル高等学校", "狭山ヶ丘高等学校", "サレジオ学院高等学校", "山村学園高等学校", "山村国際高等学校", "山陽女学園高等部", "山陽学園高等学校", "滋賀学園高等学校", "志学館高等部", "志學館高等部", "石山高等学校", "愛知高等学校", "安曇川高等学校", "伊香高等学校", "石部高等学校", "伊吹高等学校", "大津高等学校", "大津商業高等学校", "大津清陵高等学校", "堅田高等学校", "北大津高等学校", "草津高等学校", "草津東高等学校", "甲西高等学校", "甲南高等学校", "国際情報高等学校", "湖南農業高等学校", "河瀬高等学校", "信楽高等学校", "膳所高等学校", "瀬田工業高等学校", "高島高等学校", "玉川高等学校", "虎姫高等学校", "長浜北高等学校", "長浜農業高等学校", "長浜北星高等学校", "能登川高等学校", "東大津高等学校", "彦根工業高等学校", "彦根翔西館高等学校", "彦根東高等学校", "日野高等学校", "米原高等学校", "水口高等学校", "水口東高等学校", "守山高等学校", "守山北高等学校", "八幡高等学校", "八幡工業高等学校", "八幡商業高等学校", "八日市高等学校", "八日市南高等学校", "栗東高等学校", "滋賀短期大学附属高等学校", "至学館高等学校", "静岡英和女学院高等学校", "静岡学園高等学校", "静岡北高等学校", "静岡県富士見高等学校", "熱海高等学校", "新居高等学校", "池新田高等学校", "伊豆総合高等学校", "伊豆中央高等学校", "磐田北高等学校", "磐田西高等学校", "磐田農業高等学校", "磐田南高等学校", "清流館高等学校", "小笠高等学校", "科学技術高等学校", "掛川工業高等学校", "掛川西高等学校", "掛川東高等学校", "金谷高等学校", "川根高等学校", "湖西高等学校", "御殿場高等学校", "御殿場南高等学校", "小山高等学校", "相良高等学校", "静岡高等学校", "静岡商業高等学校", "静岡城北高等学校", "静岡中央高等学校", "静岡西高等学校", "静岡東高等学校", "島田高等学校", "島田工業高等学校", "島田商業高等学校", "清水西高等学校", "清水東高等学校", "下田高等学校", "天竜高等学校二俣校舎", "遠江総合高等学校", "韮山高等学校", "沼津工業高等学校", "沼津商業高等学校", "沼津城北高等学校", "沼津西高等学校", "沼津東高等学校", "榛原高等学校", "浜北西高等学校", "浜名高等学校", "浜松江之島高等学校", "浜松大平台高等学校", "浜松北高等学校", "浜松工業高等学校", "浜松湖東高等学校", "浜松湖南高等学校", "浜松城北工業高等学校", "浜松商業高等学校", "浜松東高等学校", "浜松南高等学校", "袋井高等学校", "袋井商業高等学校", "富士高等学校", "藤枝北高等学校", "藤枝西高等学校", "藤枝東高等学校", "富士宮北高等学校", "富士宮西高等学校", "富士宮東高等学校", "富岳館高等学校", "富士東高等学校", "三島北高等学校", "三島長陵高等学校", "三島南高等学校", "焼津水産高等学校", "焼津中央高等学校", "横須賀高等学校", "吉原高等学校", "静岡女子高等学校", "静岡市立高等学校", "清水桜が丘高等学校", "静岡聖光学院高等学校", "静岡大成高等学校", "静岡雙葉高等学校", "信濃むつみ高等学校", "芝浦工業大学柏高等学校", "柴田学園高等学校", "新発田中央高等学校", "渋谷教育学園幕張高等学校", "島田樟誠高等学校", "出雲高等学校", "出雲工業高等学校", "出雲商業高等学校", "出雲農林高等学校", "大田高等学校", "島根中央高等学校", "情報科学高等学校", "宍道高等学校", "大社高等学校", "大東高等学校", "津和野高等学校", "邇摩高等学校", "浜田高等学校", "浜田水産高等学校", "平田高等学校", "益田高等学校", "益田翔陽高等学校", "松江北高等学校", "松江商業高等学校", "松江農林高等学校", "松江東高等学校", "松江南高等学校", "三刀屋高等学校", "矢上高等学校", "安来高等学校", "横田高等学校", "島原中央高等学校", "清水ヶ丘高等学校", "清水国際高等学校", "下関市立下関商業高等学校", "自由ケ丘高等学校", "秀岳館高等学校", "就実高等学校", "修道高等学校", "自由の森学園高等学校", "修文学院高等学校", "秀明八千代高等学校", "夙川高等学校", "淑徳与野高等学校", "樹徳高等学校", "純真高等学校", "淳心学院高等学校", "純心女子高等学校", "松韻学園福島高等学校", "上越高等学校", "尚絅高等学校", "尚絅学院高等学校", "城西大学付属川越高等学校", "尚志館高等学校", "常総学院高等学校", "正智深谷高等学校", "松徳学院高等学校", "樟南高等学校", "湘南学院高等学校", "湘南学園高等学校", "湘南工科大学附属高等学校", "城南静岡高等学校", "湘南白百合学園高等学校", "樟南第二高等学校", "松柏学院倉吉北高等学校", "松風塾高等学校", "昌平高等学校", "昭和学院高等学校", "昭和学院秀英高等学校", "昭和学園高等学校", "昭和薬科大学附属高等学校", "如水館高等学校", "城北埼玉高等学校", "仁愛高等学校", "仁愛女子高等学校", "神港学園高等学校", "新庄東高等学校", "尽誠学園高等学校", "真颯館高等学校", "新田高等学校", "進徳学園進徳女子高等学校", "親和女子高等学校", "杉森高等学校", "椙山女学園高等学校", "逗子開成高等学校", "鈴鹿高等学校", "広島修道大学ひろしま協創高等学校", "須磨学園高等学校", "兵庫大学附属須磨ノ浦高等学校", "駿台甲府高等学校", "聖ウルスラ学院英智高等学校", "青雲高等学校", "誠英高等学校", "精華女子高等学校", "聖カタリナ学園高等学校", "聖カピタニオ女子高等学校", "聖光高等学校", "生光学園高等学校", "星槎高等学校", "誠修高等学校", "星城高等学校", "誠信高等学校", "聖心ウルスラ学園高等学校", "清真学園高等学校", "聖セシリア女子高等学校", "清泉女学院高等学校", "光英VERITAS高等学校", "聖徳大学附属取手聖徳女子高等学校", "聖ドミニコ学院高等学校", "西南学院高等学校", "西南女学院高等学校", "西武学園文理高等学校", "西武台高等学校", "西武台千葉高等学校", "聖望学園高等学校", "聖マリア女学院高等学校", "青藍泰斗高等学校", "星稜高等学校", "星陵高等学校", "星琳高等学校", "清林館高等学校", "聖霊高等学校", "聖隷クリストファー高等学校", "聖霊女子短期大学付属高等学校", "聖和学院高等学校", "聖和学園高等学校", "聖和女子学院高等学校", "関市立関商工高等学校", "関根学園高等学校", "瀬戸内高等学校", "広島桜が丘高等学校", "専修大学北上高等学校", "専修大学熊本玉名高等学校", "専修大学松戸高等学校", "洗足学園高等学校", "仙台育英学園高等学校", "仙台白百合学園高等学校", "仙台市立仙台高等学校", "仙台市立仙台工業高等学校", "仙台市立仙台商業高等学校", "仙台市立仙台大志高等学校", "セントヨゼフ女子学園高等学校", "創志学園高等学校", "捜真女学校高等学部", "創成館高等学校", "崇徳高等学校", "相洋高等学校", "園田学園高等学校", "第一薬科大学付属高等学校", "上智福岡高等学校", "大成女子高等学校", "大同大学大同高等学校", "高岡向陵高等学校", "高岡第一高等学校", "高岡龍谷高等学校", "高川学園高等学校", "高崎経済大学附属高等学校", "高崎健康福祉大学高崎高等学校", "高崎商科大学附属高等学校", "尚志学園尚志高等学校", "高田高等学校", "高松第一高等学校", "高松中央高等学校", "高水高等学校", "高山西高等学校", "滝高等学校", "滝川高等学校", "滝川第二高等学校", "拓殖大学紅陵高等学校", "武田高等学校", "広島文教大学附属高等学校", "竹田南高等学校", "多治見西高等学校", "橘学苑高等学校", "立花学園高等学校", "玉名女子高等学校", "玉野商工高等学校", "筑陽学園高等学校", "千葉学園高等学校", "千葉学芸高等学校", "千葉敬愛高等学校", "千葉経済大学附属高等学校", "旭農業高等学校", "姉崎高等学校", "我孫子高等学校", "安房高等学校", "安房拓心高等学校", "泉高等学校", "磯辺高等学校", "市川工業高等学校", "市川昴高等学校", "市川東高等学校", "市川南高等学校", "一宮商業高等学校", "市原高等学校", "市原緑高等学校", "市原八幡高等学校", "印旛明誠高等学校", "浦安高等学校", "浦安南高等学校", "生浜高等学校", "大多喜高等学校", "大原高等学校", "小見川高等学校", "柏高等学校", "柏井高等学校", "柏中央高等学校", "柏の葉高等学校", "柏南高等学校", "鎌ヶ谷高等学校", "鎌ヶ谷西高等学校", "木更津高等学校", "木更津東高等学校", "君津高等学校", "君津商業高等学校", "行徳高等学校", "九十九里高等学校", "京葉高等学校", "京葉工業高等学校", "検見川高等学校", "国府台高等学校", "小金高等学校", "国分高等学校", "犢橋高等学校", "佐倉高等学校", "佐倉西高等学校", "佐倉東高等学校", "佐倉南高等学校", "佐原高等学校", "佐原白楊高等学校", "清水高等学校", "沼南高等学校", "沼南高柳高等学校", "白井高等学校", "関宿高等学校", "匝瑳高等学校", "袖ヶ浦高等学校", "大網高等学校", "多古高等学校", "館山総合高等学校", "千城台高等学校", "千葉高等学校", "千葉北高等学校", "千葉工業高等学校", "千葉商業高等学校", "千葉女子高等学校", "千葉西高等学校", "千葉東高等学校", "千葉南高等学校", "銚子高等学校", "銚子商業高等学校", "長生高等学校", "津田沼高等学校", "東金高等学校", "東金商業高等学校", "東総工業高等学校", "土気高等学校", "富里高等学校", "長狭高等学校", "流山高等学校", "流山おおたかの森高等学校", "流山北高等学校", "流山南高等学校", "成田北高等学校", "成田国際高等学校", "成田西陵高等学校", "成東高等学校", "野田中央高等学校", "柏陵高等学校", "東葛飾高等学校", "我孫子東高等学校", "船橋高等学校", "船橋北高等学校", "船橋啓明高等学校", "船橋古和釜高等学校", "船橋芝山高等学校", "船橋豊富高等学校", "船橋東高等学校", "船橋二和高等学校", "船橋法典高等学校", "幕張総合高等学校", "松尾高等学校", "松戸高等学校", "松戸向陽高等学校", "松戸国際高等学校", "松戸馬橋高等学校", "松戸南高等学校", "松戸六実高等学校", "実籾高等学校", "茂原高等学校", "茂原樟陽高等学校", "薬園台高等学校", "八街高等学校", "八千代高等学校", "八千代西高等学校", "八千代東高等学校", "四街道高等学校", "四街道北高等学校", "若松高等学校", "翔凜高等学校", "千葉商科大学付属高等学校", "千葉市立稲毛高等学校", "千葉市立千葉高等学校", "千葉聖心高等学校", "千葉日本大学第一高等学校", "千葉英和高等学校", "千葉萌陽高等学校", "千葉明徳高等学校", "千葉黎明高等学校", "智辯学園高等学校", "智辯学園奈良カレッジ高等部", "智辯学園和歌山高等学校", "中央学院高等学校", "中央大学附属横浜高等学校", "中京高等学校", "中京大学附属中京高等学校", "中部大学第一高等学校", "銚子市立銚子高等学校", "鎮西高等学校", "鎮西学院高等学校", "筑紫女学園高等学校", "筑紫台高等学校", "つくば開成高等学校", "つくば国際大学高等学校", "つくば国際大学東風高等学校", "つくば秀英高等学校", "筑波大学附属坂戸高等学校", "黄柳野高等学校", "土浦日本大学高等学校", "鶴岡東高等学校", "敦賀気比高等学校", "鶴見大学附属高等学校", "帝京安積高等学校", "帝京大学可児高等学校", "帝京第五高等学校", "帝京第三高等学校", "帝京長岡高等学校", "帝塚山高等学校", "天理高等学校", "藤蔭高等学校", "桐蔭学園高等学校", "東奥学園高等学校", "東奥義塾高等学校", "東海高等学校", "東海学園高等学校", "東海大学付属甲府高等学校", "東海大学付属浦安高等学校", "東海大学付属相模高等学校", "東海大学付属静岡翔洋高等学校", "東海大学付属福岡高等学校", "東海大学付属諏訪高等学校", "東海大学付属熊本星翔高等学校", "東海大学付属市原望洋高等学校", "東海大学山形高等学校", "東京学館高等学校", "東京学館浦安高等学校", "東京学館新潟高等学校", "東京学館船橋高等学校", "東京成徳大学深谷高等学校", "東京都市大学塩尻高等学校", "東京農業大学第三高等学校", "東京農業大学第二高等学校", "桐光学園高等学校", "東大寺学園高等学校", "東邦高等学校", "同朋高等学校", "東邦大学付属東邦高等学校", "東北高等学校", "東北学院高等学校", "東北学院榴ヶ岡高等学校", "仙台城南高等学校", "東北生活文化大学高等学校", "東明館高等学校", "桐陽高等学校", "東葉高等学校", "東洋大学附属牛久高等学校", "東洋大学附属姫路高等学校", "藤嶺学園藤沢高等学校", "常磐高等学校", "常盤木学園高等学校", "常磐大学高等学校", "川島高等学校", "脇町高等学校", "阿波高等学校", "海部高等学校", "阿波西高等学校", "池田高等学校", "板野高等学校", "小松島高等学校", "小松島西高等学校", "つるぎ高等学校", "城西高等学校", "城東高等学校", "城ノ内高等学校", "城北高等学校", "城南高等学校", "池田高等学校辻校", "徳島科学技術高等学校", "徳島北高等学校", "徳島商業高等学校", "富岡西高等学校", "富岡東高等学校", "鳴門高等学校", "名西高等学校", "徳島市立高等学校", "徳島文理高等学校", "徳風高等学校", "常葉大学附属常葉高等学校", "常葉大学附属菊川高等学校", "常葉大学附属橘高等学校", "土佐高等学校", "土佐塾高等学校", "土佐女子高等学校", "足利高等学校", "足利工業高等学校", "足利清風高等学校", "足利南高等学校", "石橋高等学校", "今市高等学校", "今市工業高等学校", "宇都宮高等学校", "宇都宮北高等学校", "宇都宮工業高等学校", "宇都宮商業高等学校", "宇都宮女子高等学校", "宇都宮清陵高等学校", "宇都宮中央高等学校", "宇都宮白楊高等学校", "宇都宮東高等学校", "宇都宮南高等学校", "大田原高等学校", "大田原女子高等学校", "学悠館高等学校", "鹿沼高等学校", "鹿沼商工高等学校", "鹿沼東高等学校", "鹿沼南高等学校", "上三川高等学校", "烏山高等学校", "黒磯高等学校", "黒磯南高等学校", "黒羽高等学校", "小山高等学校", "小山北桜高等学校", "小山城南高等学校", "小山西高等学校", "小山南高等学校", "さくら清修高等学校", "佐野高等学校", "佐野松桜高等学校", "佐野東高等学校", "高根沢高等学校", "栃木高等学校", "栃木工業高等学校", "栃木商業高等学校", "栃木翔南高等学校", "栃木女子高等学校", "栃木農業高等学校", "那須清峰高等学校", "那須拓陽高等学校", "日光明峰高等学校", "益子芳星高等学校", "壬生高等学校", "真岡高等学校", "真岡工業高等学校", "真岡女子高等学校", "真岡北陵高等学校", "茂木高等学校", "矢板高等学校", "矢板東高等学校", "獨協埼玉高等学校", "鳥取家政学園鳥取敬愛高等学校", "青谷高等学校", "岩美高等学校", "倉吉総合産業高等学校", "倉吉西高等学校", "倉吉農業高等学校", "倉吉東高等学校", "境高等学校", "境港総合技術高等学校", "鳥取工業高等学校", "鳥取湖陵高等学校", "鳥取商業高等学校", "鳥取中央育英高等学校", "鳥取西高等学校", "鳥取東高等学校", "八頭高等学校", "米子高等学校", "米子工業高等学校", "米子西高等学校", "米子東高等学校", "米子南高等学校", "利根沼田学校組合立利根商業高等学校", "富田高等学校", "石動高等学校", "魚津高等学校", "魚津工業高等学校", "雄山高等学校", "上市高等学校", "呉羽高等学校", "小杉高等学校", "桜井高等学校", "志貴野高等学校", "新湊高等学校", "大門高等学校", "高岡高等学校", "高岡工芸高等学校", "高岡商業高等学校", "高岡南高等学校", "中央農業高等学校", "砺波高等学校", "富山高等学校", "富山いずみ高等学校", "富山工業高等学校", "富山商業高等学校", "富山中部高等学校", "富山西高等学校", "富山東高等学校", "富山北部高等学校", "富山南高等学校", "滑川高等学校", "南砺福野高等学校", "入善高等学校", "氷見高等学校", "福岡高等学校", "伏木高等学校", "八尾高等学校", "雄峰高等学校（通信制）", "富山国際大学付属高等学校", "富山第一高等学校", "豊川高等学校", "豊田大谷高等学校", "豊橋市立豊橋高等学校", "豊橋中央高等学校", "福岡女子商業高等学校", "中越高等学校", "長崎玉成高等学校", "壱岐高等学校", "諫早高等学校", "諫早商業高等学校", "諫早農業高等学校", "諫早東高等学校", "大村高等学校", "大村工業高等学校", "大村城南高等学校", "上五島高等学校", "川棚高等学校", "口加高等学校", "五島高等学校", "五島海陽高等学校", "佐世保北高等学校", "佐世保工業高等学校", "佐世保商業高等学校", "佐世保中央高等学校", "佐世保東翔高等学校", "佐世保西高等学校", "佐世保南高等学校", "鹿町工業高等学校", "島原高等学校", "島原工業高等学校", "島原商業高等学校", "清峰高等学校", "西陵高等学校", "対馬高等学校", "長崎鶴洋高等学校", "長崎北高等学校", "長崎工業高等学校", "長崎西高等学校", "長崎東高等学校", "長崎北陽台高等学校", "長崎南高等学校", "長崎明誠高等学校", "鳴滝高等学校", "波佐見高等学校", "平戸高等学校", "猶興館高等学校", "長崎女子高等学校", "長崎女子商業高等学校", "長崎市立長崎商業高等学校", "長崎日本大学高等学校", "長崎南山高等学校", "永島学園 出雲西高等学校", "明科高等学校", "赤穂高等学校", "梓川高等学校", "阿南高等学校", "飯田高等学校", "飯田OIDE長姫高等学校", "飯田風越高等学校", "飯山高等学校", "池田工業高等学校", "伊那北高等学校", "伊那弥生ヶ丘高等学校", "岩村田高等学校", "上田高等学校", "上田千曲高等学校", "上田染谷丘高等学校", "上田東高等学校", "小海高等学校", "大町岳陽高等学校", "岡谷工業高等学校", "岡谷東高等学校", "岡谷南高等学校", "下伊那農業高等学校", "下諏訪向陽高等学校", "上伊那農業高等学校", "木曽青峰高等学校", "佐久平総合技術高等学校（浅間キャンパス）", "駒ヶ根工業高等学校", "小諸高等学校", "小諸商業高等学校", "坂城高等学校", "更級農業高等学校", "塩尻志学館高等学校", "篠ノ井高等学校", "須坂高等学校", "須坂創成高等学校 須園キャンパス", "須坂創成高等学校 須商キャンパス", "須坂東高等学校", "諏訪実業高等学校", "諏訪清陵高等学校", "諏訪二葉高等学校", "蘇南高等学校", "田川高等学校", "辰野高等学校", "蓼科高等学校", "東御清翔高等学校", "豊科高等学校", "長野高等学校", "長野工業高等学校", "長野商業高等学校", "中野西高等学校", "長野西高等学校（通信制）", "長野東高等学校", "長野南高等学校", "長野吉田高等学校", "中野立志館高等学校", "野沢北高等学校", "野沢南高等学校", "白馬高等学校", "富士見高等学校", "穂高商業高等学校", "松川高等学校", "松代高等学校", "松本県ヶ丘高等学校", "松本蟻ヶ崎高等学校", "松本工業高等学校", "松本筑摩高等学校（通信制）", "松本深志高等学校", "松本美須々ヶ丘高等学校", "丸子修学館高等学校", "南安曇農業高等学校", "屋代高等学校", "屋代南高等学校", "長野俊英高等学校", "長野女子高等学校", "長野市立長野高等学校", "長野清泉女学院高等学校", "長野日本大学高等学校", "中村学園三陽高等学校", "中村学園女子高等学校", "中村女子高等学校", "中山学園高等学校", "名古屋高等学校", "名古屋大谷高等学校", "名古屋経済大学市邨高等学校", "名古屋経済大学高蔵高等学校", "名古屋工業高等学校", "名古屋国際高等学校", "名古屋女子大学高等学校", "名古屋市立菊里高等学校", "名古屋市立北高等学校", "名古屋市立工業高等学校", "名古屋市立工芸高等学校", "名古屋市立向陽高等学校", "名古屋市立桜台高等学校", "名古屋市立西陵高等学校", "名古屋市立中央高等学校", "名古屋市立富田高等学校", "名古屋市立名古屋商業高等学校", "名古屋市立緑高等学校", "名古屋市立名東高等学校", "名古屋市立山田高等学校", "名古屋市立若宮商業高等学校", "名古屋大学教育学部附属高等学校", "灘高等学校", "奈良育英高等学校", "奈良学園高等学校", "生駒高等学校", "畝傍高等学校", "王寺工業高等学校", "大淀高等学校", "香芝高等学校", "橿原高等学校", "高円芸術高等学校", "郡山高等学校", "五條高等学校", "御所実業高等学校", "桜井高等学校", "磯城野高等学校", "榛生昇陽高等学校", "青翔高等学校", "西和清陵高等学校", "添上高等学校", "高田高等学校", "高取国際高等学校", "登美ケ丘高等学校", "奈良高等学校", "奈良北高等学校", "奈良県立商業高等学校", "奈良商工高等学校", "二階堂高等学校", "西の京高等学校", "平城高等学校", "法隆寺国際高等学校", "大和広陵高等学校", "大和中央高等学校", "習志野市立習志野高等学校", "奈良女子高等学校", "奈良市立一条高等学校", "奈良大学附属高等学校", "奈良文化高等学校", "成田高等学校", "阿賀黎明高等学校", "新井高等学校", "糸魚川高等学校", "糸魚川白嶺高等学校", "小千谷高等学校", "小千谷西高等学校", "海洋高等学校", "柏崎高等学校", "柏崎工業高等学校", "柏崎総合高等学校", "柏崎常盤高等学校", "加茂高等学校", "加茂農林高等学校", "小出高等学校", "国際情報高等学校", "五泉高等学校", "佐渡高等学校", "佐渡総合高等学校", "三条高等学校", "三条商業高等学校", "三条東高等学校", "塩沢商工高等学校", "新発田高等学校", "新発田商業高等学校", "新発田農業高等学校", "新発田南高等学校", "上越総合技術高等学校", "正徳館高等学校", "高田高等学校", "高田商業高等学校", "高田農業高等学校", "高田北城高等学校", "中条高等学校", "燕中等教育学校 後期課程", "十日町高等学校", "十日町総合高等学校", "栃尾高等学校", "長岡高等学校", "長岡大手高等学校", "長岡工業高等学校", "長岡向陵高等学校", "長岡商業高等学校", "長岡農業高等学校", "長岡明徳高等学校", "新潟高等学校", "新潟北高等学校", "新潟県央工業高等学校", "新潟工業高等学校", "新潟江南高等学校", "新潟向陽高等学校", "新潟商業高等学校", "新潟中央高等学校", "新潟西高等学校", "新潟東高等学校", "新潟南高等学校", "新津高等学校", "新津工業高等学校", "新津南高等学校", "分水高等学校", "豊栄高等学校", "巻高等学校", "巻総合高等学校", "見附高等学校", "六日町高等学校", "村上高等学校", "村上桜ヶ丘高等学校", "吉田高等学校", "新潟産業大学附属高等学校", "新潟市立高志中等教育学校 後期課程", "新潟市立万代高等学校", "新潟市立明鏡高等学校", "新潟清心女子高等学校", "新潟青陵高等学校", "新潟第一高等学校", "新潟明訓高等学校", "新島学園高等学校", "西日本短期大学附属高等学校", "西宮市立西宮高等学校", "西宮市立西宮東高等学校", "西大和学園高等学校", "二松學舍大学附属柏高等学校", "日南学園高等学校", "日章学園高等学校", "日本航空高等学校", "日本航空高等学校石川", "日本大学習志野高等学校", "日本大学藤沢高等学校", "日本大学三島高等学校", "日本大学山形高等学校", "日本文理高等学校", "日本女子大学附属高等学校", "日本大学高等学校", "日本大学東北高等学校", "日本大学明誠高等学校", "日本福祉大学付属高等学校", "日本文理大学附属高等学校", "人間環境大学附属 岡崎高等学校", "沼津中央高等学校", "ノートルダム清心高等学校", "野田学園高等学校", "延岡学園高等学校", "博多高等学校", "博多女子高等学校", "萩光塩学院高等学校", "白鴎大学足利高等学校", "白鵬女子高等学校", "白陵高等学校", "羽黒高等学校", "八戸工業大学第一高等学校", "八戸工業大学第二高等学校", "八戸聖ウルスラ学院高等学校", "初芝橋本高等学校", "花咲徳栄高等学校", "花巻東高等学校", "浜松聖星高等学校", "浜松開誠館高等学校", "浜松学芸高等学校", "浜松啓陽高等学校", "浜松市立高等学校", "浜松日体高等学校", "早鞆高等学校", "比叡山高等学校", "東九州龍谷高等学校", "東筑紫学園高等学校", "東日本国際大学附属昌平高等学校", "東野高等学校", "東福岡高等学校", "光ヶ丘女子高等学校", "彦根総合高等学校", "日出学園高等学校", "比治山女子高等学校", "聖ヨゼフ学園高等学校", "英明高等学校", "秀明高等学校", "秀明英光高等学校", "海星高等学校", "桜丘高等学校", "自由ヶ丘高等学校", "青山高等学校", "日向学院高等学校", "日ノ本学園高等学校", "雲雀丘学園高等学校", "日々輝学園高等学校", "姫路市立琴丘高等学校", "姫路市立飾磨高等学校", "姫路市立姫路高等学校", "姫路女学院高等学校", "相生高等学校", "相生産業高等学校", "明石南高等学校", "明石高等学校", "明石北高等学校", "明石清水高等学校", "明石城西高等学校", "明石西高等学校", "赤穂高等学校", "芦屋高等学校", "網干高等学校", "尼崎高等学校", "尼崎稲園高等学校", "尼崎小田高等学校", "尼崎北高等学校", "尼崎工業高等学校", "尼崎西高等学校", "有馬高等学校", "淡路高等学校", "淡路三原高等学校", "伊川谷高等学校", "伊川谷北高等学校", "生野高等学校", "出石高等学校", "伊丹高等学校", "伊丹北高等学校", "伊丹西高等学校", "猪名川高等学校", "小野高等学校", "小野工業高等学校", "加古川北高等学校", "加古川西高等学校", "加古川東高等学校", "加古川南高等学校", "柏原高等学校", "香住高等学校", "上郡高等学校", "川西北陵高等学校", "川西緑台高等学校", "川西明峰高等学校", "神崎高等学校", "北須磨高等学校", "香寺高等学校", "神戸高等学校", "神戸北高等学校", "神戸甲北高等学校", "神戸商業高等学校", "神戸鈴蘭台高等学校", "神戸高塚高等学校", "御影高等学校", "国際高等学校", "篠山産業高等学校", "篠山鳳鳴高等学校", "佐用高等学校", "飾磨工業高等学校", "社高等学校", "松陽高等学校", "須磨友が丘高等学校", "須磨東高等学校", "洲本高等学校", "洲本実業高等学校", "青雲高等学校", "星陵高等学校", "兵庫県立大学附属高等学校", "太子高等学校", "高砂高等学校", "高砂南高等学校", "宝塚高等学校", "宝塚北高等学校", "宝塚西高等学校", "宝塚東高等学校", "但馬農業高等学校", "龍野高等学校", "津名高等学校", "東播工業高等学校", "豊岡高等学校", "豊岡総合高等学校", "長田高等学校", "鳴尾高等学校", "西宮高等学校", "西宮今津高等学校", "西宮北高等学校", "西宮甲山高等学校", "西宮香風高等学校", "西宮南高等学校", "西脇高等学校", "西脇工業高等学校", "兵庫県立農業高等学校", "浜坂高等学校", "播磨農業高等学校", "播磨南高等学校", "東灘高等学校", "東播磨高等学校", "氷上高等学校", "日高高等学校", "姫路北高等学校", "姫路工業高等学校", "姫路飾西高等学校", "姫路商業高等学校", "姫路西高等学校", "姫路東高等学校", "姫路別所高等学校", "姫路南高等学校", "兵庫高等学校", "兵庫工業高等学校", "福崎高等学校", "北条高等学校", "北摂三田高等学校", "舞子高等学校", "三木高等学校", "三木北高等学校", "三木東高等学校", "三田祥雲館高等学校", "三田西陵高等学校", "湊川高等学校", "武庫荘総合高等学校", "村岡高等学校", "山崎高等学校", "夢前高等学校", "夢野台高等学校", "八鹿高等学校", "平塚学園高等学校", "飛龍高等学校", "弘前学院聖愛高等学校", "弘前東高等学校", "広島学院高等学校", "安芸高等学校", "安芸府中高等学校", "安芸南高等学校", "安西高等学校", "五日市高等学校", "因島高等学校", "大竹高等学校", "尾道北高等学校", "尾道商業高等学校", "尾道東高等学校", "音戸高等学校", "海田高等学校", "可部高等学校", "賀茂高等学校", "神辺高等学校", "神辺旭高等学校", "祇園北高等学校", "熊野高等学校", "呉工業高等学校", "呉商業高等学校", "呉昭和高等学校", "呉三津田高等学校", "呉宮原高等学校", "黒瀬高等学校", "高陽高等学校", "高陽東高等学校", "西城紫水高等学校", "西条農業高等学校", "三次高等学校", "三次青陵高等学校", "庄原格致高等学校", "庄原実業高等学校", "世羅高等学校", "総合技術高等学校", "大門高等学校", "竹原高等学校", "忠海高等学校", "戸手高等学校", "西高等学校", "日彰館高等学校", "廿日市高等学校", "廿日市西高等学校", "東高等学校", "広高等学校", "広島高等学校", "広島井口高等学校", "広島観音高等学校", "広島工業高等学校", "広島国泰寺高等学校", "広島商業高等学校", "広島皆実高等学校", "福山葦陽高等学校", "福山工業高等学校", "福山商業高等学校", "福山誠之館高等学校", "福山明王台高等学校", "府中高等学校", "府中東高等学校", "松永高等学校", "御調高等学校", "三原高等学校", "三原東高等学校", "宮島工業高等学校", "安古市高等学校", "吉田高等学校", "広島国際学院高等学校", "広島三育学院高等学校", "広島山陽学園山陽高等学校", "広島城北高等学校", "広島女学院高等学校", "広島市立大手町商業高等学校", "広島市立沼田高等学校", "広島市立広島工業高等学校", "広島市立広島商業高等学校", "広島市立舟入高等学校", "広島市立美鈴が丘高等学校", "広島市立基町高等学校", "広島白鳩学園広島翔洋高等学校", "広島新庄高等学校", "広島大学附属高等学校", "広島大学附属福山高等学校", "広島なぎさ高等学校", "弘学館高等学校", "フェリス女学院高等学校", "足羽高等学校", "羽水高等学校", "大野高等学校", "奥越明成高等学校", "科学技術高等学校", "勝山高等学校", "金津高等学校", "高志高等学校", "鯖江高等学校", "武生高等学校", "武生東高等学校", "敦賀高等学校", "敦賀工業高等学校", "福井商業高等学校", "福井農林高等学校", "藤島高等学校", "丸岡高等学校", "美方高等学校", "三国高等学校", "若狭高等学校", "福井工業大学附属福井高等学校", "福井南高等学校", "福岡県公立古賀竟成館高等学校", "三井中央高等学校", "明善高等学校", "朝倉高等学校", "朝倉光陽高等学校", "朝倉東高等学校", "ありあけ新世高等学校", "育徳館高等学校", "糸島高等学校", "糸島農業高等学校", "稲築志耕館高等学校", "浮羽究真館高等学校", "浮羽工業高等学校", "宇美商業高等学校", "大川樟風高等学校", "大牟田北高等学校", "小倉高等学校", "小倉工業高等学校", "小倉商業高等学校", "小倉西高等学校", "小郡高等学校", "折尾高等学校", "遠賀高等学校", "香椎高等学校", "香椎工業高等学校", "春日高等学校", "香住丘高等学校", "嘉穂高等学校", "嘉穂総合高等学校", "嘉穂東高等学校", "苅田工業高等学校", "北九州高等学校", "京都高等学校", "鞍手高等学校", "久留米高等学校", "久留米筑水高等学校", "玄界高等学校", "玄洋高等学校", "光陵高等学校", "小倉東高等学校", "小倉南高等学校", "早良高等学校", "修猷館高等学校", "新宮高等学校", "水産高等学校", "須恵高等学校", "青豊高等学校", "城南高等学校", "田川高等学校", "太宰府高等学校", "筑紫丘高等学校", "築上西高等学校", "筑前高等学校", "筑豊高等学校", "筑紫高等学校", "筑紫中央高等学校", "伝習館高等学校", "東筑高等学校", "東鷹高等学校", "戸畑高等学校", "戸畑工業高等学校", "中間高等学校", "西田川高等学校", "直方高等学校", "博多青松高等学校（通信制）", "柏陵高等学校", "ひびき高等学校", "福岡高等学校", "福岡魁誠高等学校", "福岡県立福岡工業高等学校", "福岡講倫館高等学校", "福岡中央高等学校", "福岡農業高等学校", "福島高等学校", "北筑高等学校", "三池高等学校", "三池工業高等学校", "三潴高等学校", "武蔵台高等学校", "宗像高等学校", "門司学園高等学校", "門司大翔館高等学校", "山門高等学校", "八女高等学校", "八女工業高等学校", "八女農業高等学校", "八幡高等学校", "八幡中央高等学校", "八幡南高等学校", "行橋高等学校", "若松高等学校", "若松商業高等学校", "福岡工業大学附属城東高等学校", "福岡女学院高等学校", "福岡市立博多工業高等学校", "福岡市立福岡女子高等学校", "福岡市立福岡西陵高等学校", "福岡市立福翔高等学校", "福岡第一高等学校", "福岡大学附属大濠高等学校", "福岡大学附属若葉高等学校", "福岡常葉高等学校", "福岡海星女子学院高等学校", "福岡雙葉高等学校", "福岡舞鶴高等学校", "福島県磐城第一高等学校", "葵高等学校", "田村高等学校", "原町高等学校", "会津高等学校", "会津学鳳高等学校", "会津工業高等学校", "安積高等学校", "あさか開成高等学校", "安達高等学校", "安積黎明高等学校", "石川高等学校", "磐城高等学校", "いわき光洋高等学校", "磐城桜が丘高等学校", "いわき総合高等学校", "磐城農業高等学校", "小名浜海星高等学校水産校舎", "いわき翠の杜高等学校", "岩瀬農業高等学校", "小名浜海星高等学校本校", "喜多方高等学校", "光南高等学校", "郡山高等学校", "郡山北工業高等学校", "郡山商業高等学校", "郡山東高等学校", "郡山萌世高等学校（通信制）", "湖南高等学校", "白河高等学校", "白河旭高等学校", "白河実業高等学校", "須賀川桐陽高等学校", "清陵情報高等学校", "相馬高等学校", "相馬東高等学校", "平工業高等学校", "平商業高等学校", "只見高等学校", "橘高等学校", "勿来工業高等学校", "二本松工業高等学校", "修明高等学校", "福島高等学校", "福島北高等学校", "福島工業高等学校", "福島商業高等学校", "福島西高等学校", "福島東高等学校", "福島南高等学校", "福島明成高等学校", "船引高等学校", "保原高等学校", "南会津高等学校", "本宮高等学校", "湯本高等学校", "若松商業高等学校", "福島成蹊高等学校", "福島東稜高等学校", "福徳学院高等学校", "福山暁の星女子高等学校", "福山市立福山高等学校", "藤井学園寒川高等学校", "藤枝順心高等学校", "藤枝明誠高等学校", "富士学苑高等学校", "不二越工業高等学校", "藤沢翔陵高等学校", "不二女子高等学校", "富士市立高等学校", "不二聖心女子学院高等学校", "藤ノ花女子高等学校", "武相高等学校", "船橋市立船橋高等学校", "武南高等学校", "文徳高等学校", "古川学園高等学校", "文化学園長野高等学校", "文星芸術大学附属高等学校", "別府溝部学園高等学校", "鳳凰高等学校", "豊国学園高等学校", "鵬翔高等学校", "法政大学国際高等学校", "法政大学第二高等学校", "報徳学園高等学校", "北越高等学校", "北杜市立甲陵高等学校", "北陸学院高等学校", "北陸学園北陸高等学校", "北陵高等学校", "星野高等学校", "細田学園高等学校", "誉高等学校", "本庄第一高等学校", "本庄東高等学校", "前橋育英高等学校", "前橋市立前橋高等学校", "誠恵高等学校", "真和高等学校", "益田永島学園 明誠高等学校", "松江市立皆美が丘女子高等学校", "松商学園高等学校", "松戸市立松戸高等学校", "松本第一高等学校", "松山東雲高等学校", "松山聖陵高等学校", "松山学院高等学校", "三浦学苑高等学校", "三重高等学校", "明野高等学校", "あけぼの学園高等学校", "飯南高等学校", "飯野高等学校", "伊賀白鳳高等学校", "石薬師高等学校", "伊勢高等学校", "伊勢工業高等学校", "伊勢まなび高等学校", "いなべ総合学園高等学校", "稲生高等学校", "上野高等学校", "宇治山田高等学校", "宇治山田商業高等学校", "相可高等学校", "尾鷲高等学校", "亀山高等学校", "川越高等学校", "紀南高等学校", "桑名高等学校", "桑名北高等学校", "桑名工業高等学校", "桑名西高等学校", "神戸高等学校", "木本高等学校", "菰野高等学校", "志摩高等学校", "白子高等学校", "昴学園高等学校", "津高等学校", "津工業高等学校", "津商業高等学校", "津西高等学校", "津東高等学校", "鳥羽高等学校", "朝明高等学校", "名張高等学校", "名張青峰高等学校", "白山高等学校", "久居高等学校", "久居農林高等学校", "北星高等学校", "松阪高等学校", "松阪工業高等学校", "松阪商業高等学校", "みえ夢学園高等学校", "四日市高等学校", "四日市工業高等学校", "四日市商業高等学校", "四日市中央工業高等学校", "四日市西高等学校", "四日市農芸高等学校", "四日市南高等学校", "四日市四郷高等学校", "三島学園 知徳高等学校", "水城高等学校", "水谷学園出雲北陵高等学校", "聖園女学院高等学校", "三田学園高等学校", "三田松聖高等学校", "水戸葵陵高等学校", "水戸女子高等学校", "水戸啓明高等学校", "緑ヶ丘女子高等学校", "南山国際高等学校", "南山高等学校女子部", "南山高等学校男子部", "美濃加茂高等学校", "美萩野女子高等学校", "宮城学院高等学校", "石巻高等学校", "石巻北高等学校", "石巻工業高等学校", "石巻好文館高等学校", "石巻商業高等学校", "石巻西高等学校", "泉高等学校", "泉松陵高等学校", "泉館山高等学校", "登米総合産業高等学校", "大河原商業高等学校", "黒川高等学校", "気仙沼高等学校", "気仙沼向洋高等学校", "宮城県工業高等学校", "小牛田農林高等学校", "佐沼高等学校", "塩釜高等学校", "柴田高等学校", "柴田農林高等学校", "白石高等学校", "白石工業高等学校", "角田高等学校", "仙台三桜高等学校", "仙台第一高等学校", "仙台第三高等学校", "仙台第二高等学校", "仙台西高等学校", "仙台東高等学校", "仙台二華高等学校", "仙台南高等学校", "仙台向山高等学校", "多賀城高等学校", "築館高等学校", "貞山高等学校", "富谷高等学校", "登米高等学校", "中新田高等学校", "名取高等学校", "名取北高等学校", "宮城県農業高等学校", "迫桜高等学校", "東松島高等学校", "古川高等学校", "古川工業高等学校", "古川黎明高等学校", "松島高等学校", "宮城第一高等学校", "宮城野高等学校", "宮城広瀬高等学校", "村田高等学校", "本吉響高等学校", "利府高等学校", "涌谷高等学校", "亘理高等学校", "都城高等学校", "都城聖ドミニコ学園高等学校", "宮崎学園高等学校", "門川高等学校", "小林高等学校", "小林秀峰高等学校", "佐土原高等学校", "高城高等学校", "高鍋高等学校", "高鍋農業高等学校", "妻高等学校", "富島高等学校", "日南高等学校", "日南振徳高等学校", "延岡高等学校", "延岡工業高等学校", "延岡商業高等学校", "延岡星雲高等学校", "日向高等学校", "日向工業高等学校", "本庄高等学校", "都城泉ヶ丘高等学校", "都城工業高等学校", "都城商業高等学校", "都城西高等学校", "都城農業高等学校", "宮崎大宮高等学校", "宮崎海洋高等学校", "宮崎北高等学校", "宮崎工業高等学校", "宮崎商業高等学校", "宮崎西高等学校", "宮崎農業高等学校", "宮崎東高等学校", "宮崎南高等学校", "宮崎第一高等学校", "宮崎日本大学高等学校", "武庫川女子大学附属高等学校", "武蔵越生高等学校", "武蔵野音楽大学附属高等学校", "武蔵野星城高等学校", "明桜高等学校", "茗溪学園高等学校", "明光学園高等学校", "明治学園高等学校", "名城大学附属高等学校", "明誠学院高等学校", "明豊高等学校", "明和県央高等学校", "四日市メリノール学院", "茂原北陵高等学校", "盛岡誠桜高等学校", "盛岡白百合学園高等学校", "盛岡市立高等学校", "盛岡スコーレ高等学校", "盛岡大学附属高等学校", "盛岡中央高等学校", "森村学園高等部", "矢板中央高等学校", "焼津高等学校", "屋久島おおぞら高等学校", "安田女子高等学校", "鳥取城北高等学校", "八千代松陰高等学校", "八代白百合学園高等学校", "愛知黎明高等学校", "柳井学園高等学校", "柳川高等学校", "蒼開高等学校", "山形学院高等学校", "左沢高等学校", "置賜農業高等学校", "霞城学園高等学校", "上山明新館高等学校", "北村山高等学校", "寒河江高等学校", "寒河江工業高等学校", "酒田西高等学校", "酒田東高等学校", "庄内総合高等学校", "庄内農業高等学校", "新庄神室産業高等学校", "新庄北高等学校", "新庄南高等学校", "鶴岡北高等学校", "鶴岡工業高等学校", "鶴岡中央高等学校", "鶴岡南高等学校", "天童高等学校", "長井高等学校", "南陽高等学校", "谷地高等学校", "山形北高等学校", "山形工業高等学校", "山形中央高等学校", "山形西高等学校", "山形東高等学校", "山形南高等学校", "山辺高等学校", "遊佐高等学校", "米沢工業高等学校", "米沢興譲館高等学校", "米沢商業高等学校", "米沢東高等学校", "東北文教大学山形城北高等学校", "山形市立商業高等学校", "創学館高等学校", "山口県鴻城高等学校", "山口県桜ケ丘高等学校", "美祢青嶺高等学校", "厚狭高等学校", "岩国高等学校", "岩国商業高等学校", "岩国総合高等学校", "宇部高等学校", "宇部工業高等学校", "宇部商業高等学校", "宇部中央高等学校", "宇部西高等学校", "小野田高等学校", "小野田工業高等学校", "華陵高等学校", "下松高等学校", "下松工業高等学校", "熊毛北高等学校", "熊毛南高等学校", "下関工科高等学校", "下関西高等学校", "下関南高等学校", "新南陽高等学校", "高森高等学校", "田布施農工高等学校", "長府高等学校", "徳山高等学校", "徳山商工高等学校", "豊浦高等学校", "南陽工業高等学校", "西京高等学校", "萩高等学校", "光高等学校", "光丘高等学校", "防府高等学校", "防府商工高等学校", "防府西高等学校", "柳井高等学校", "山口高等学校", "山口中央高等学校", "山口農業高等学校", "山手学院高等学校", "大和青藍高等学校", "大和高田市立高田商業高等学校", "山梨学院高等学校", "塩山高等学校", "甲府工業高等学校", "甲府城西高等学校", "甲府昭和高等学校", "甲府第一高等学校", "甲府西高等学校", "甲府東高等学校", "甲府南高等学校", "巨摩高等学校", "白根高等学校", "中央高等学校", "都留高等学校", "日川高等学校", "韮崎高等学校", "韮崎工業高等学校", "農林高等学校", "笛吹高等学校", "富士河口湖高等学校", "富士北稜高等学校", "北杜高等学校", "身延高等学校", "山梨高等学校", "吉田高等学校", "山梨英和高等学校", "惺山高等学校", "八女学院高等学校", "遊学館高等学校", "勇志国際高等学校", "祐誠高等学校", "百合学院高等学校", "湯梨浜学園高等学校", "楊志館高等学校", "横芝敬愛高等学校", "横須賀学院高等学校", "横須賀市立横須賀総合高等学校", "横浜高等学校", "青山学院横浜英和高等学校", "横浜学園高等学校", "横浜共立学園高等学校", "横浜翠陵高等学校", "横浜商科大学高等学校", "横浜女学院高等学校", "横浜市立金沢高等学校", "横浜市立桜丘高等学校", "横浜市立戸塚高等学校", "横浜市立東高等学校", "横浜市立みなと総合高等学校", "横浜市立南高等学校", "横浜市立横浜サイエンスフロンティア高等学校", "横浜市立横浜商業高等学校", "横浜市立横浜総合高等学校", "横浜清風高等学校", "横浜創英高等学校", "横浜創学館高等学校", "横浜隼人高等学校", "横浜雙葉高等学校", "米子北高等学校", "米子永島学園米子松蔭高等学校", "米沢中央高等学校", "ラ・サール高等学校", "立花高等学校", "立教新座高等学校", "立命館守山高等学校", "龍谷富山高等学校", "流通経済大学付属柏高等学校", "ルーテル学院高等学校", "ルネサンス高等学校", "麗澤高等学校", "麗澤瑞浪高等学校", "れいめい高等学校", "六甲学院高等学校", "会津北嶺高等学校", "有田中央高等学校", "海南高等学校 海南校舎", "笠田高等学校", "神島高等学校", "紀央館高等学校", "貴志川高等学校", "熊野高等学校", "向陽高等学校", "粉河高等学校", "新宮高等学校", "星林高等学校", "耐久高等学校", "田辺高等学校", "田辺工業高等学校", "桐蔭高等学校", "那賀高等学校", "南部高等学校", "橋本高等学校", "日高高等学校", "箕島高等学校", "和歌山高等学校", "和歌山北高等学校 北校舎", "和歌山工業高等学校", "和歌山商業高等学校", "和歌山東高等学校", "和歌山市立和歌山高等学校", "和歌山信愛高等学校", "わせがく高等学校", "早稲田実業学校", "早稲田佐賀高等学校", "早稲田大学本庄高等学院", "和洋国府台女子高等学校", "岡山朝日高等学校", "常磐高等学校", "清水南高等学校", "浜松西高等学校", "海星高等学校", "済美高等学校", "桜丘高等学校", "市川高等学校", "城北高等学校", "聖光学院高等学校", "大成高等学校"]
;
List highschool_kana_list=
["せいせいこうとうがっこう", "あいこくがくえんだいがくふぞくよつかいどうこうとうがっこう", "あいこくがくえんだいがくふぞくりゅうがさきこうとうがっこう", "あいちこうとうがっこう", "あいちきょういくだいがくふぞくこうとうがっこう", "あいちけいせいこうとうがっこう", "あいちしょうぎょうこうとうがっこう", "あぐいこうとうがっこう", "あさひがおかこうとうがっこう", "あさひのこうとうがっこう", "あすけこうとうがっこう", "あつたこうとうがっこう", "あつみのうぎょうこうとうがっこう", "あんじょうこうとうがっこう", "あんじょうのうりんこうとうがっこう", "あんじょうひがしこうとうがっこう", "あんじょうみなみこうとうがっこう", "いしんこうとうがっこう", "いちのみやこうとうがっこう", "いちのみやきたこうとうがっこう", "いちのみやこうかこうとうがっこう", "いちのみやこうどうこうとうがっこう", "いちのみやしょうぎょうこうとうがっこう", "いちのみやにしこうとうがっこう", "いちのみやみなみこうとうがっこう", "いっしきこうとうがっこう", "いなざわこうとうがっこう", "いなざわひがしこうとうがっこう", "いぬやまこうとうがっこう", "いぬやまみなみこうとうがっこう", "いわくらそうごうこうとうがっこう", "いわづこうとうがっこう", "うつみこうとうがっこう", "かいしょうこうとうがっこう", "おおぶこうとうがっこう", "おおぶひがしこうとうがっこう", "おかざきこうとうがっこう", "おかざききたこうとうがっこう", "おかざきこうかこうとうがっこう", "おかざきしょうぎょうこうとうがっこう", "おかざきにしこうとうがっこう", "おかざきひがしこうとうがっこう", "かくじょうがおかこうとうがっこう", "かすがいこうとうがっこう", "かすがいこうかこうとうがっこう", "かすがいしょうぎょうこうとうがっこう", "かすがいにしこうとうがっこう", "かすがいひがしこうとうがっこう", "かすがいみなみこうとうがっこう", "がまごおりこうとうがっこう", "がまごおりひがしこうとうがっこう", "かもがおかこうとうがっこう", "かりやこうとうがっこう", "かりやきたこうとうがっこう", "かりやこうかこうとうがっこう", "かりやひがしこうとうがっこう", "いちのみやおこしこうかこうとうがっこう", "きそがわこうとうがっこう", "きょうわこうとうがっこう", "きょくりょうこうとうがっこう", "きらこうとうがっこう", "こうぞうじこうとうがっこう", "こうたこうとうがっこう", "こうなんこうとうがっこう", "こうこうとうがっこう", "こざかいこうとうがっこう", "ごじょうこうとうがっこう", "こちのこうとうがっこう", "こまきこうとうがっこう", "こまきこうぎょうこうとうがっこう", "こまきみなみこうとうがっこう", "ころもだいこうとうがっこう", "あいさいこうかこうとうがっこう", "さなげのうりんこうとうがっこう", "さやこうとうがっこう", "じしゅうかんこうとうがっこう", "しょうわこうとうがっこう", "しんかわこうとうがっこう", "しんしろゆうきょうかんこうとうがっこう", "ずいりょうこうとうがっこう", "せとこうとうがっこう", "せときたそうごうこうとうがっこう", "せとにしこうとうがっこう", "せとこうかこうとうがっこう", "たかはまこうとうがっこう", "たぐちこうとうがっこう", "たけとよこうとうがっこう", "ちぐさこうとうがっこう", "ちたしょうようこうとうがっこう", "ちりゅうこうとうがっこう", "ちりゅうひがしこうとうがっこう", "つしまこうとうがっこう", "つしまきたこうとうがっこう", "つしまひがしこうとうがっこう", "てんぱくこうとうがっこう", "とうかいしょうふうこうとうがっこう", "とうかいみなみこうとうがっこう", "とうごうこうとうがっこう", "とうりょうこうとうがっこう", "とこなめこうとうがっこう", "とよあけこうとうがっこう", "ゆたかがおかこうとうがっこう", "とよかわこうかこうとうがっこう", "とよたこうとうがっこう", "とよたきたこうとうがっこう", "とよたこうかこうとうがっこう", "とよたにしこうとうがっこう", "とよたひがしこうとうがっこう", "とよたみなみこうとうがっこう", "ゆたかのこうとうがっこう", "とよはしこうかこうとうがっこう", "とよはししょうぎょうこうとうがっこう", "とよはしにしこうとうがっこう", "とよはしひがしこうとうがっこう", "とよはしみなみこうとうがっこう", "なかがわしょうぎょうこうとうがっこう", "ながくてこうとうがっこう", "なかむらこうとうがっこう", "なごやにしこうとうがっこう", "なごやみなみこうとうがっこう", "せいしょうこうとうがっこう", "なるみこうとうがっこう", "なんようこうとうがっこう", "にしおこうとうがっこう", "にしおひがしこうとうがっこう", "にしはるこうとうがっこう", "にっしんこうとうがっこう", "にっしんにしこうとうがっこう", "にわこうとうがっこう", "はんだこうとうがっこう", "はんだこうかこうとうがっこう", "はんだしょうぎょうこうとうがっこう", "はんだのうぎょうこうとうがっこう", "はんだひがしこうとうがっこう", "ひがしうらこうとうがっこう", "びさいこうとうがっこう", "びほくこうとうがっこう", "ふくえこうとうがっこう", "へきなんこうとうがっこう", "へきなんこうかこうとうがっこう", "しょういんこうとうがっこう", "まつだいらこうとうがっこう", "みやすいさんこうとうがっこう", "みとこうとうがっこう", "みどりがおかこうとうがっこう", "みよしこうとうがっこう", "みわこうとうがっこう", "なごやこうかこうとうがっこう", "めいわこうとうがっこう", "もりやまこうとうがっこう", "よこすかこうとうがっこう", "あいちこうぎょうだいがくめいでんこうとうがっこう", "あいちさんぎょうだいがくこうぎょうこうとうがっこう", "あいちさんぎょうだいがくみかわこうとうがっこう", "あいちしゅくとくこうとうがっこう", "あいちみずほだいがくみずほこうとうがっこう", "あいづわかまつざべりおがくえんこうとうがっこう", "あいとくがくえんこうとうがっこう", "あおもりあけのほしこうとうがっこう", "あおもりこうとうがっこう", "あおもりきたこうとうがっこう", "あおもりこうぎょうこうとうがっこう", "あおもりしょうぎょうこうとうがっこう", "あおもりちゅうおうこうとうがっこう", "あおもりにしこうとうがっこう", "あおもりひがしこうとうがっこう", "あおもりみなみこうとうがっこう", "あじがさわこうとうがっこう", "おのえそうごうこうとうがっこう", "かしわぎのうぎょうこうとうがっこう", "くろいしこうとうがっこう", "ごしょがわらこうとうがっこう", "ごしょがわらこうぎょうこうとうがっこう", "ごしょがわらのうりんこうとうがっこう", "さんぼんぎこうとうがっこう", "さんぼんぎのうぎょうこうとうがっこう", "おおみなとこうとうがっこう", "たなぶこうとうがっこう", "とわだこうぎょうこうとうがっこう", "しちのへこうとうがっこう", "はちのへこうとうがっこう", "はちのへきたこうとうがっこう", "はちのへこうぎょうこうとうがっこう", "はちのへしょうぎょうこうとうがっこう", "はちのへすいさんこうとうがっこう", "はちのへちゅうおうこうとうがっこう", "はちのへにしこうとうがっこう", "はちのへひがしこうとうがっこう", "ひろさきこうとうがっこう", "ひろさきこうぎょうこうとうがっこう", "ひろさきじつぎょうこうとうがっこう", "ひろさきちゅうおうこうとうがっこう", "ひろさきみなみこうとうがっこう", "ほくとこうとうがっこう", "みさわこうとうがっこう", "みさわしょうぎょうこうとうがっこう", "きづくりこうとうがっこう", "ももいしこうとうがっこう", "あおもりやまだこうとうがっこう", "あかししりつあかししょうぎょうこうとうがっこう", "あかつきこうとうがっこう", "あきくさがくえんこうとうがっこう", "あきたこうとうがっこう", "あきたきたこうとうがっこう", "あきたこうぎょうこうとうがっこう", "あきたちゅうおうこうとうがっこう", "あきたにしこうとうがっこう", "あきたみなみこうとうがっこう", "あきためいとくかんこうとうがっこう", "あらやこうとうがっこう", "うごこうとうがっこう", "おおだてこくさいじょうほうがくいんこうとうがっこう", "おおだてほうめいこうとうがっこう", "おおまがりこうとうがっこう", "おおまがりこうぎょうこうとうがっこう", "おおまがりのうぎょうこうとうがっこう", "おがかいようこうとうがっこう", "かくのだてこうとうがっこう", "かなあしのうぎょうこうとうがっこう", "こさかこうとうがっこう", "あきたほくようこうとうがっこう", "にかほこうとうがっこう", "にしせんぼくこうとうがっこう", "にしめこうとうがっこう", "のしろこうとうがっこう", "のしろこうぎょうこうとうがっこう", "はなわこうとうがっこう", "ほんじょうこうとうがっこう", "ますだこうとうがっこう", "ゆざわこうとうがっこう", "ゆざわしょうほくこうとうがっこう", "ゆりこうとうがっこう", "よこてこうとうがっこう", "よこてせいりょうがくいんこうとうがっこう", "よこてじょうなんこうとうがっこう", "ろくごうこうとうがっこう", "あきたしりつあきたしょうぎょうこうとうがっこう", "あきたしりつごしょのがくいんこうとうがっこう", "あきたれいわこうとうがっこう", "せんだいだいがくふぞくめいせいこうとうがっこう", "めいしゅうがくえんひたちこうとうがっこう", "はままつしゅうがくしゃこうとうがっこう", "あさのこうとうがっこう", "あさひがおかこうとうがっこう", "あさひじゅくちゅうとうきょういくがっこう こうきかてい", "あざぶだいがくふぞくこうとうがっこう", "あしかがだいがくふぞくこうとうがっこう", "あしかがたんきだいがくふぞくこうとうがっこう", "あしやがくえんこうとうがっこう", "あすかみらいこうとうがっこう", "あずさだいいちこうとうがっこう", "あつぎちゅうおうこうとうがっこう", "あびこにかいどうこうとうがっこう", "あまがさきしりつあまがさきこうとうがっこう", "あやはこうとうがっこう", "あらいがくえんにいかわこうとうがっこう", "ありあけこうとうがっこう", "あれせいあしょうなんこうとうがっこう", "あんじょうがくえんこうとうがっこう", "あんじょうがくえんおかざきじょうせいこうとうがっこう", "いいだじょしこうとうがっこう", "いいづかこうとうがっこう", "いくえいこうとうがっこう", "いくえいにしこうとうがっこう", "いけだこうとうがっこう", "あなみずこうとうがっこう", "いいだこうとうがっこう", "うちなだこうとうがっこう", "かなざわいずみがおかこうとうがっこう", "かなざわこうようこうとうがっこう", "かなざわさくらがおかこうとうがっこう", "かなざわしょうぎょうこうとうがっこう", "かなざわたつみがおかこうとうがっこう", "かなざわにしこうとうがっこう", "かなざわにしきがおかこうとうがっこう", "かなざわにすいこうとうがっこう", "かなざわふしみこうとうがっこう", "かなざわほくりょうこうとうがっこう", "いしかわけんりつこうぎょうこうとうがっこう", "こまつこうとうがっこう", "こまつこうぎょうこうとうがっこう", "こまつしょうぎょうこうとうがっこう", "こまつめいほうこうとうがっこう", "すいせいこうとうがっこう", "だいしょうじこうとうがっこう", "だいしょうじじつぎょうこうとうがっこう", "たつるはまこうとうがっこう", "つるぎこうとうがっこう", "てらいこうとうがっこう", "ななおこうとうがっこう", "ななおしののめこうとうがっこう", "ののいちめいりんこうとうがっこう", "はくいこうとうがっこう", "はくいこうぎょうこうとうがっこう", "ほうだつこうとうがっこう", "まつとうこうとうがっこう", "ろくせいこうとうがっこう", "わじまこうとうがっこう", "さくらざかこうとうがっこう", "いずみしりついずみしょうぎょうこうとうがっこう", "いずみちゅうおうこうとうがっこう", "いせがくえんこうとうがっこう", "いたみしりついたみこうとうがっこう", "いちかわこうとうがっこう", "いちのせきがくいんこうとうがっこう", "いちのせきしゅうこうこうとうがっこう", "いちはらちゅうおうこうとうがっこう", "いなにしこうとうがっこう", "いばらきこうとうがっこう", "いばらききりすときょうがくえんこうとうがっこう", "あそうこうとうがっこう", "いしおかしょうぎょうこうとうがっこう", "いしおかだいいちこうとうがっこう", "いしおかだいにこうとうがっこう", "いしげしほうこうとうがっこう", "いなこうとうがっこう", "いばらきひがしこうとうがっこう", "いわせこうとうがっこう", "うしくこうとうがっこう", "うしくえいしんこうとうがっこう", "えどさきそうごうこうとうがっこう", "おおただいいちこうとうがっこう", "おおたせいざんこうとうがっこう", "おせこうとうがっこう", "かさまこうとうがっこう", "かしまこうとうがっこう", "かつたこうとうがっこう", "かつたこうぎょうこうとうがっこう", "かみすこうとうがっこう", "きぬしょうぎょうこうとうがっこう", "こがだいいちこうとうがっこう", "こがだいさんこうとうがっこう", "こがだいにこうとうがっこう", "さかいこうとうがっこう", "さわこうとうがっこう", "しもだてこうぎょうこうとうがっこう", "しもだてだいいちこうとうがっこう", "しもだてだいにこうとうがっこう", "しもつまだいいちこうとうがっこう", "しもつまだいにこうとうがっこう", "そうわこうぎょうこうとうがっこう", "だいごせいりゅうこうとうがっこう", "たがこうとうがっこう", "たかはぎこうとうがっこう", "たかはぎせいしょうこうとうがっこう", "たけぞのこうとうがっこう", "ちゅうおうこうとうがっこう", "つくばこうかこうとうがっこう", "つちうらこうぎょうこうとうがっこう", "つちうらこほくこうとうがっこう", "つちうらだいいちこうとうがっこう", "つちうらだいさんこうとうがっこう", "つちうらだいにこうとうがっこう", "とうかいこうとうがっこう", "ともべこうとうがっこう", "とりでしょうようこうとうがっこう", "とりでだいいちこうとうがっこう", "とりでだいにこうとうがっこう", "なかこうとうがっこう", "なかみなとこうとうがっこう", "なみきちゅうとうきょういくがっこう こうきかてい", "はさきこうとうがっこう", "はさきやながわこうとうがっこう", "ひたちきたこうとうがっこう", "ひたちこうぎょうこうとうがっこう", "ひたちしょうぎょうこうとうがっこう", "ひたちだいいちこうとうがっこう", "ひたちだいにこうとうがっこう", "ふじしろこうとうがっこう", "ふじしろしすいこうとうがっこう", "ほこただいいちこうとうがっこう", "ほこただいにこうとうがっこう", "まかべこうとうがっこう", "みつかいどうだいいちこうとうがっこう", "みつかいどうだいにこうとうがっこう", "みとこうぎょうこうとうがっこう", "みとさくらのまきこうとうがっこう", "みとしょうぎょうこうとうがっこう", "みとだいいちこうとうがっこう", "みとだいさんこうとうがっこう", "みとだいにこうとうがっこう", "みとのうぎょうこうとうがっこう", "みとみなみこうとうがっこう", "みどりおかこうとうがっこう", "もりやこうとうがっこう", "やちよこうとうがっこう", "ゆうきだいいちこうとうがっこう", "りゅうがさきだいいちこうとうがっこう", "りゅうがさきだいにこうとうがっこう", "りゅうがさきみなみこうとうがっこう", "いぶすきしりついぶすきしょうぎょうこうとうがっこう", "いまばりめいとくこうとうがっこう", "いわきしゅうえいこうとうがっこう", "いわきりょくいんこうとうがっこう", "いわせにほんだいがくこうとうがっこう", "いわたこうとうがっこう", "いわたひがしこうとうがっこう", "いわてこうとうがっこう", "はなきたせいうんこうとうがっこう", "いちのせきこうぎょうこうとうがっこう", "いちのせきだいいちこうとうがっこう", "いちのせきだいにこうとうがっこう", "いちのへこうとうがっこう", "いわいずみこうとうがっこう", "いわやどうこうとうがっこう", "おおふなとこうとうがっこう", "かねがさきこうとうがっこう", "かまいしこうとうがっこう", "きたかみしょうなんこうとうがっこう", "くじこうとうがっこう", "くじひがしこうとうがっこう", "くろさわじりきたこうとうがっこう", "くろさわじりこうぎょうこうとうがっこう", "こずかたこうとうがっこう", "しわそうごうこうとうがっこう", "だいとうこうとうがっこう", "たいらだてこうとうがっこう", "たかたこうとうがっこう", "とおのこうとうがっこう", "はなまききたこうとうがっこう", "はなまきのうぎょうこうとうがっこう", "はなまきみなみこうとうがっこう", "ふくおかこうとうがっこう", "みずさわこうとうがっこう", "みずさわこうぎょうこうとうがっこう", "みずさわしょうぎょうこうとうがっこう", "みやここうとうがっこう", "もりおかきたこうとうがっこう", "もりおかこうぎょうこうとうがっこう", "もりおかしょうぎょうこうとうがっこう", "もりおかだいいちこうとうがっこう", "もりおかだいさんこうとうがっこう", "もりおかだいにこうとうがっこう", "もりおかだいしこうとうがっこう", "もりおかのうぎょうこうとうがっこう", "もりおかみなみこうとうがっこう", "いわてじょしこうとうがっこう", "にがわがくいんこうとうがっこう", "うえくさがくえんだいがくふぞくこうとうがっこう", "うえだにしこうとうがっこう", "うぐいすだにこうとうがっこう", "うつのみやたんきだいがくふぞくこうとうがっこう", "うつのみやかいせいじょしがくいんこうとうがっこう", "うつのみやぶんせいじょしこうとうがっこう", "うべこうじょうこうとうがっこう", "うべふろんてぃあだいがくふぞくかがわこうとうがっこう", "ばいこうがくいんこうとうがっこう", "うらわあけのほしじょしこうとうがっこう", "うらわがくいんこうとうがっこう", "うらわじつぎょうがくえんこうとうがっこう", "うらわるーてるがくいんこうとうがっこう", "えいこうがくえんこうとうがっこう", "えいしんこうとうがっこう", "えいすうがっかんこうとうがっこう", "えいとくこうとうがっこう", "えーあいしーじぇいこうとうがっこう", "えくせらんこうとうがっこう", "えどがわがくえんとりでこうとうがっこう", "いまばりきたこうとうがっこう", "いまばりこうぎょうこうとうがっこう", "いまばりにしこうとうがっこう", "いまばりみなみこうとうがっこう", "いよこうとうがっこう", "いよのうぎょうこうとうがっこう", "うわこうとうがっこう", "うわじまひがしこうとうがっこう", "おおずこうとうがっこう", "おおずのうぎょうこうとうがっこう", "かみうけなこうとうがっこう", "かわのいしこうとうがっこう", "かわのえこうとうがっこう", "きたうわこうとうがっこう", "こまつこうとうがっこう", "さいじょうこうとうがっこう", "たんばらこうとうがっこう", "どいこうとうがっこう", "とうおんこうとうがっこう", "ながはまこうとうがっこう", "にいはまこうぎょうこうとうがっこう", "にいはましょうぎょうこうとうがっこう", "にいはまにしこうとうがっこう", "にいはまひがしこうとうがっこう", "にいはまみなみこうとうがっこう", "のむらこうとうがっこう", "ほうじょうこうとうがっこう", "まつやまきたこうとうがっこう", "まつやまこうぎょうこうとうがっこう", "まつやましょうぎょうこうとうがっこう", "まつやまちゅうおうこうとうがっこう", "まつやまひがしこうとうがっこう", "まつやまみなみこうとうがっこう", "みしまこうとうがっこう", "やわたはまこうとうがっこう", "よしだこうとうがっこう", "えひめだいがくふぞくこうとうがっこう", "おいすかはままつこくさいこうとうがっこう", "おうかがくえんこうとうがっこう", "おうみこうとうがっこう", "おうみきょうだいしゃこうとうがっこう", "おおいたこうとうがっこう", "うさこうとうがっこう", "うすきこうとうがっこう", "おおいたうえのがおかこうとうがっこう", "おおいたおぎのだいこうとうがっこう", "おおいたこうぎょうこうとうがっこう", "おおいたしょうぎょうこうとうがっこう", "おおいたつるさきこうとうがっこう", "おおいたにしこうとうがっこう", "おおいたひがしこうとうがっこう", "おおいたほうふこうとうがっこう", "おおいたまいづるこうとうがっこう", "おおいたみなみこうとうがっこう", "きつきこうとうがっこう", "くすみやまこうとうがっこう", "くにさきこうとうがっこう", "げいじゅつみどりがおかこうとうがっこう", "さいきかくじょうこうとうがっこう", "さいきほうなんこうとうがっこう", "じょうほうかがくこうとうがっこう", "たかだこうとうがっこう", "たけたこうとうがっこう", "つくみこうとうがっこう", "つるさきこうぎょうこうとうがっこう", "なかつきたこうとうがっこう", "なかつひがしこうとうがっこう", "なかつみなみこうとうがっこう", "ひたこうとうがっこう", "ひたみくまこうとうがっこう", "ひたりんこうこうとうがっこう", "べっぷしょうせいこうとうがっこう", "べっぷつるみがおかこうとうがっこう", "ゆふこうとうがっこう", "おおいたこくさいじょうほうこうとうがっこう", "おおいたとうめいこうとうがっこう", "おおがきにほんだいがくこうとうがっこう", "おおたしりつおおたこうとうがっこう", "おおたわがくえんかいせいこうとうがっこう", "おおつまらんざんこうとうがっこう", "おおとりがくえんこうとうがっこう", "おおにしがくえんこうとうがっこう", "おおみやかいせいこうとうがっこう", "おおむたこうとうがっこう", "おかやまこうとうがっこう", "おかやまがくげいかんこうとうがっこう", "さくようがくえんこうとうがっこう", "おかやまけんたかはしにっしんこうとうがっこう", "おかやまけんみまさかこうとうがっこう", "いはらこうとうがっこう きたこうち", "うじょうこうとうがっこう", "おかやまいちのみやこうとうがっこう", "おかやまこうぎょうこうとうがっこう", "おかやまじょうとうこうとうがっこう", "おかやまそうざんこうとうがっこう", "おかやまだいあんじちゅうとうきょういくがっこう こうきかてい", "おかやまひがししょうぎょうこうとうがっこう", "おかやまほうせんこうとうがっこう", "おかやまみつこうとうがっこう", "おかやまみなみこうとうがっこう", "おくこうとうがっこう", "まにわこうとうがっこうおちあいこうち", "かさおかこうとうがっこう", "かさおかこうぎょうこうとうがっこう", "かさおかしょうぎょうこうとうがっこう", "かつまだこうとうがっこう", "かつやまこうとうがっこう かつやまこうち", "かもがたこうとうがっこう", "くらしきあまきこうとうがっこう", "くらしきこうぎょうこうとうがっこう", "くらしきこじょういけこうとうがっこう", "くらしきしょうぎょうこうとうがっこう", "くらしきせいりょうこうとうがっこう", "くらしきちゅうおうこうとうがっこう", "くらしきみなみこうとうがっこう", "くらしきわしゅうこうとうがっこう", "こうようこうとうがっこう", "さいだいじこうとうがっこう", "せとこうとうがっこう", "せとみなみこうとうがっこう", "そうじゃこうとうがっこう", "そうじゃみなみこうとうがっこう", "たかはしこうとうがっこう", "たかはしじょうなんこうとうがっこう", "たかまつのうぎょうこうとうがっこう", "たましまこうとうがっこう", "たましましょうぎょうこうとうがっこう", "たまのこうとうがっこう", "たまのこうなんこうとうがっこう", "つやまこうとうがっこう", "つやまこうぎょうこうとうがっこう", "つやましょうぎょうこうとうがっこう", "つやまひがしこうとうがっこう", "にいみこうとうがっこうみなみこうち", "ひがしおかやまこうぎょうこうとうがっこう", "びぜんりょくようこうとうがっこう", "みずしまこうぎょうこうとうがっこう", "やかげこうとうがっこう", "はやしのこうとうがっこう", "わけしずたにこうとうがっこう", "おかやまさんようこうとうがっこう", "おかやましょうかだいがくふぞくこうとうがっこう", "おかやましりつおかやまこうらくかんこうとうがっこう", "おかやまはくりょうこうとうがっこう", "おかやまりかだいがくふぞくこうとうがっこう", "おかやまりゅうこくこうとうがっこう", "おきがくえんこうとうがっこう", "おきなわかとりっくこうとうがっこう", "いしかわこうとうがっこう", "いとまんこうとうがっこう", "うらそえこうとうがっこう", "うらそえこうぎょうこうとうがっこう", "うらそえしょうぎょうこうとうがっこう", "おきなわこうぎょうこうとうがっこう", "かいほうこうとうがっこう", "かでなこうとうがっこう", "ちゃたんこうとうがっこう", "きたなかぐすくこうとうがっこう", "ほくざんこうとうがっこう", "ぎのわんこうとうがっこう", "きゅうようこうとうがっこう", "ぐしかわこうとうがっこう", "ぐしかわしょうぎょうこうとうがっこう", "こうようこうとうがっこう", "こざこうとうがっこう", "しゅりこうとうがっこう", "しゅりひがしこうとうがっこう", "おろくこうとうがっこう", "ちねんこうとうがっこう", "ちゅうぶしょうぎょうこうとうがっこう", "ちゅうぶのうりんこうとうがっこう", "とまりこうとうがっこう", "とみしろこうとうがっこう", "とみしろみなみこうとうがっこう", "なごこうとうがっこう", "なごしょうこうこうとうがっこう", "なはこうとうがっこう", "なはこうぎょうこうとうがっこう", "なはこくさいこうとうがっこう", "なはしょうぎょうこうとうがっこう", "なはにしこうとうがっこう", "なんぶしょうぎょうこうとうがっこう", "なんぶのうりんこうとうがっこう", "にしはらこうとうがっこう", "はえばるこうとうがっこう", "ふてんまこうとうがっこう", "もとぶこうとうがっこう", "まえはらこうとうがっこう", "まわしこうとうがっこう", "みさとこうとうがっこう", "みさとこうぎょうこうとうがっこう", "みやここうとうがっこう", "みやこそうごうじつぎょうこうとうがっこう", "みらいこうかこうとうがっこう", "やえやまこうとうがっこう", "ようめいこうとうがっこう", "よかつこうとうがっこう", "よみたんこうとうがっこう", "おきなわしょうがくこうとうがっこう", "おのみちこうとうがっこう", "かなざわりゅうこくこうとうがっこう", "おりおあいしんこうとうがっこう", "かいしがくえんこうとうがっこう", "かいしんこうとうがっこう", "かいちこうとうがっこう", "おおてまえまるかめこうとうがっこう", "おおてまえたかまつこうとうがっこう", "はんざんこうとうがっこう", "いしだこうとうがっこう", "かがわちゅうおうこうとうがっこう", "かさだこうとうがっこう", "かんおんじだいいちこうとうがっこう", "かんおんじそうごうこうとうがっこう", "ことひらこうとうがっこう", "さかいでこうとうがっこう", "さかいでこうぎょうこうとうがっこう", "さかいでしょうぎょうこうとうがっこう", "さんぼんまつこうとうがっこう", "しどこうとうがっこう", "ぜんつうじだいいちこうとうがっこう", "たかせこうとうがっこう", "たかまつこうとうがっこう", "たかまつきたこうとうがっこう", "たかまつこうげいこうとうがっこう", "たかまつさくらいこうとうがっこう", "たかまつしょうぎょうこうとうがっこう", "たかまつにしこうとうがっこう", "たかまつひがしこうとうがっこう", "たかまつみなみこうとうがっこう", "たどつこうとうがっこう", "つだこうとうがっこう", "のうぎょうけいえいこうとうがっこう", "まるがめこうとうがっこう", "まるがめじょうせいこうとうがっこう", "みきこうとうがっこう", "かがわせいりょうこうとうがっこう", "しこくがくいんだいがくかがわにしこうとうがっこう", "とじゃくこうとうがっこう", "つだがくえんこうとうがっこう", "かごしまこうとうがっこう", "かごしまいくえいかんこうとうがっこう", "あまみこうとうがっこう", "いさのうりんこうとうがっこう", "いじゅういんこうとうがっこう", "いずみこうとうがっこう", "いちきのうげいこうとうがっこう", "いぶすきこうとうがっこう", "おおくちこうとうがっこう", "おおしまこうとうがっこう", "かいようこうとうがっこうつうしんせい", "かくしょうこうとうがっこう", "かごしまこうぎょうこうとうがっこう", "かごしまちゅうおうこうとうがっこう", "かごしまひがしこうとうがっこう", "かごしまみなみこうとうがっこう", "かじきこうとうがっこう", "かじきこうぎょうこうとうがっこう", "かせだこうとうがっこう", "かのやこうとうがっこう", "かのやこうぎょうこうとうがっこう", "かのやのうぎょうこうとうがっこう", "かもうこうとうがっこう", "せんだいこうとうがっこう", "かわなべこうとうがっこう", "きりしまこうとうがっこう", "きんこうわんこうとうがっこう", "くしきのこうとうがっこう", "くしらしょうぎょうこうとうがっこう", "こうなんこうとうがっこう", "こくぶこうとうがっこう", "さつなんこうぎょうこうとうがっこう", "さつまちゅうおうこうとうがっこう", "しぶしこうとうがっこう", "しょうようこうとうがっこう", "せんさつせいしゅうかんこうとうがっこう", "せんだいしょうこうこうとうがっこう", "たけおかだいこうとうがっこう", "たねがしまこうとうがっこう", "つるまるこうとうがっこう", "のだじょしこうとうがっこう", "はやとこうぎょうこうとうがっこう", "ふきあげこうとうがっこう", "ふくやまこうとうがっこう", "まくらざきこうとうがっこう", "めいおうかんこうとうがっこう", "やくしまこうとうがっこう", "かごしまじつぎょうこうとうがっこう", "かごしまじゅんしんじょしこうとうがっこう", "かごしまじょうせいこうとうがっこう", "かごしまじょうほうこうとうがっこう", "かごしましりつかごしまぎょくりゅうこうとうがっこう", "かごしましりつかごしましょうぎょうこうとうがっこう", "かごしましりつかごしまじょしこうとうがっこう", "かごしまだいいちこうとうがっこう", "りゅうおうこうとうがっこう", "かしはらがくいんこうとうがっこう", "かしまがくえんこうとうがっこう", "かしわぎがくえんこうとうがっこう", "かしわしりつかしわこうとうがっこう", "にほんたいいくだいがくかしわこうとうがっこう", "ちゅうぶだいがくはるひがおかこうとうがっこう", "かすかべきょうえいこうとうがっこう", "かすみがうらこうとうがっこう", "かたやまがくえんこうとうがっこう", "がっこうほうじんいしかわこうとうがっこう", "かつすいこうとうがっこう", "かとうがくえんこうとうがっこう", "かとうがくえんぎょうしゅうこうとうがっこう", "かながわがくえんこうとうがっこう", "あいかわこうとうがっこう", "あいはらこうとうがっこう", "あさひこうとうがっこう", "あさみぞだいこうとうがっこう", "あしがらこうとうがっこう", "あさおこうとうがっこう", "あさおそうごうこうとうがっこう", "あつぎこうとうがっこう", "あつぎきたこうとうがっこう", "あつぎしょうぎょうこうとうがっこう", "あつぎせいなんこうとうがっこう", "あつぎにしこうとうがっこう", "あつぎひがしこうとうがっこう", "あやせこうとうがっこう", "あやせにしこうとうがっこう", "ありまこうとうがっこう", "いくたこうとうがっこう", "いくたひがしこうとうがっこう", "いしだこうとうがっこう", "いせはらこうとうがっこう", "いそごこうぎょうこうとうがっこう", "いちがおこうとうがっこう", "えだこうとうがっこう", "えびなこうとうがっこう", "おおいこうとうがっこう", "おおいそこうとうがっこう", "おだわらこうとうがっこう", "おだわらじょうほくこうぎょうこうとうがっこう", "おだわらひがしこうとうがっこう", "おっぱまこうとうがっこう", "かいようかがくこうとうがっこう", "かないこうとうがっこう", "かながわこうぎょうこうとうがっこう", "かながわそうごうこうとうがっこう", "かながわそうごうさんぎょうこうとうがっこう", "かなざわそうごうこうとうがっこう", "かまくらこうとうがっこう", "かまりやこうとうがっこう", "かみつるまこうとうがっこう", "かみみぞこうとうがっこう", "かみみぞみなみこうとうがっこう", "かみやべこうとうがっこう", "かわさきこうとうがっこう", "かわさききたこうとうがっこう", "かわさきこうかこうとうがっこう", "かわわこうとうがっこう", "きしねこうとうがっこう", "きぼうがおかこうとうがっこう", "きりがおかこうとうがっこう", "こうほくこうとうがっこう", "こうりょうこうとうがっこう", "さがみはらちゅうとうきょういくがっこう こうきかてい", "さがみこうようかんこうとうがっこう", "さがみたなこうとうがっこう", "さがみはらこうとうがっこう", "さがみはらせいりょうこうとうがっこう", "さがみはらそうごうこうとうがっこう", "ざまこうとうがっこう", "ざまそうごうこうとうがっこう", "しちりがはまこうとうがっこう", "しょうこうこうとうがっこう", "しょうなんこうとうがっこう", "しょうなんだいこうとうがっこう", "しょうようこうとうがっこう", "しろさとこうとうがっこう", "さがみはらしろやまこうとうがっこう", "しんえいこうとうがっこう", "しんじょうこうとうがっこう", "すげこうとうがっこう", "ずしこうとうがっこう", "すみよしこうとうがっこう", "ずようこうとうがっこう", "せいしょうこうとうがっこう", "せやこうとうがっこう", "せやにしこうとうがっこう", "さむかわこうとうがっこう", "だいしこうとうがっこう", "おおふなこうとうがっこう", "やまとにしこうとうがっこう", "たかはまこうとうがっこう", "たなこうとうがっこう", "たまこうとうがっこう", "ちがさきこうとうがっこう", "ちがさきにしはまこうとうがっこう", "ちがさきほくりょうこうとうがっこう", "ちゅうおうのうぎょうこうとうがっこう", "つくいこうとうがっこう", "つくいはまこうとうがっこう", "つるみこうとうがっこう", "つるみそうごうこうとうがっこう", "つるみねこうとうがっこう", "ながやこうとうがっこう", "にっぱこうとうがっこう", "にのみやこうとうがっこう", "はくさんこうとうがっこう", "はくようこうとうがっこう", "はしもとこうとうがっこう", "はだのこうとうがっこう", "はだのそうごうこうとうがっこう", "はだのそやこうとうがっこう", "よこはまひとりざわこうとうがっこう", "ひらつかこうかこうとうがっこう", "ひらつかこうなんこうとうがっこう", "ひらつかしょうぎょうこうとうがっこう", "ひらつかしょうふうこうとうがっこう", "ひらつかのうぎょうこうとうがっこう", "ふかさわこうとうがっこう", "ふじさわこうかこうとうがっこう", "ふじさわせいりゅうこうとうがっこう", "ふじさわそうごうこうとうがっこう", "ふじさわにしこうとうがっこう", "ふたまたがわかんごふくしこうとうがっこう", "ほどがやこうとうがっこう", "まいおかこうとうがっこう", "みうらはっせこうとうがっこう いりえきゃんぱす", "むかいのおかこうぎょうこうとうがっこう", "もといしかわこうとうがっこう", "やえいこうとうがっこう", "やまきたこうとうがっこう", "やまとこうとうがっこう", "やまとひがしこうとうがっこう", "やまとみなみこうとうがっこう", "ゆりがおかこうとうがっこう", "よこすかこうとうがっこう", "よこすかおおつこうとうがっこう", "よこすかこうぎょうこうとうがっこう", "よこすかめいこうこうとうがっこう", "よこはまおうようこうとうがっこう", "よこはまきょくりょうこうとうがっこう", "よこはまこくさいこうとうがっこう", "よこはまさかえこうとうがっこう", "よこはましゅうゆうかんこうとうがっこう", "よこはますいらんこうとうがっこう", "よこはませいりょうこうとうがっこう", "よこはまたてのこうとうがっこう", "よこはまなんりょうこうとうがっこう", "よこはまひらぬまこうとうがっこう", "よこはまりょくえんこうとうがっこう", "よこはまみどりがおかこうとうがっこう", "よしだじまこうとうがっこう", "かながわだいがくふぞくこうとうがっこう", "かなざわこうとうがっこう", "かなざわがくいんこうとうがっこう", "かなざわしりつこうぎょうこうとうがっこう", "かなざわだいがくふぞくこうとうがっこう", "かのやしりつかのやじょしこうとうがっこう", "かのやちゅうおうこうとうがっこう", "かまくらがくえんこうとうがっこう", "かまくらじょがくいんこうとうがっこう", "かまくらじょしだいがくこうとうぶ", "かみむらがくえんこうとうぶ", "かもぎょうせいこうとうがっこう", "かりたすじょしこうとうがっこう", "かわごえしりつかわごえこうとうがっこう", "かわごえひがしこうとうがっこう", "かわさきしりつかわさきこうとうがっこう", "かわさきしりつかわさきそうごうかがくこうとうがっこう", "かわさきしりつさいわいこうとうがっこう", "かわさきしりつたかつこうとうがっこう", "かわさきしりつたちばなこうとうがっこう", "かんぜいこうとうがっこう", "かんさいちゅうおうこうとうがっこう", "かんせいがくいんこうとうぶ", "かんとうがくいんこうとうがっこう", "かんとうがくいんむつうらこうとうがっこう", "かんとうがくえんだいがくふぞくこうとうがっこう", "かんれいしらゆりがくえんこうとうがっこう", "きくかこうとうがっこう", "きくちじょしこうとうがっこう", "きさらづそうごうこうとうがっこう", "きたかまくらじょしがくえんこうとうがっこう", "きたきゅうしゅうしりつこうとうがっこう", "きびこうげんがくえんこうとうがっこう", "いけだこうとうがっこう", "いびこうとうがっこう", "えなこうとうがっこう", "えなのうぎょうこうとうがっこう", "えなみなみこうとうがっこう", "おおがききたこうとうがっこう", "おおがきこうぎょうこうとうがっこう", "おおがきさくらこうとうがっこう", "おおがきしょうぎょうこうとうがっこう", "おおがきにしこうとうがっこう", "おおがきひがしこうとうがっこう", "おおがきみなみこうとうがっこう", "おおがきようろうこうとうがっこう", "かいづめいせいこうとうがっこう", "かかみはらこうとうがっこう", "かかみがはらにしこうとうがっこう", "かにこうとうがっこう", "かにこうぎょうこうとうがっこう", "かのうこうとうがっこう", "かもこうとうがっこう", "かものうりんこうとうがっこう", "かようふろんてぃあこうとうがっこう", "ぎざんこうとうがっこう", "ぎなんこうぎょうこうとうがっこう", "ぎふこうとうがっこう", "ぎふかかみのこうとうがっこう", "ぎふきたこうとうがっこう", "ぎふこうぎょうこうとうがっこう", "ぎふしょうぎょうこうとうがっこう", "ぎふじょうほくこうとうがっこう", "ぎふそうごうがくえんこうとうがっこう", "ぎふのうりんこうとうがっこう", "ぐじょうこうとうがっこう", "ぐじょうきたこうとうがっこう", "せきこうとうがっこう", "せきうちこうとうがっこう", "むぎこうとうがっこう", "たじみこうとうがっこう", "たじみきたこうとうがっこう", "たじみこうぎょうこうとうがっこう", "ときこうりょうこうとうがっこう", "ときしょうぎょうこうとうがっこう", "とうのうじつぎょうこうとうがっこう", "とうのうふろんてぃあこうとうがっこう", "なかつこうとうがっこう", "なかつがわこうぎょうこうとうがっこう", "なかつしょうぎょうこうとうがっこう", "ながらこうとうがっこう", "はしまこうとうがっこう", "はしまきたこうとうがっこう", "ひだこうとうがっこう", "ひだたかやまこうとうがっこう", "ふわこうとうがっこう", "ましたせいふうこうとうがっこう", "みずなみこうとうがっこう", "もとすしょうようこうとうがっこう", "やおつこうとうがっこう", "よしきこうとうがっこう", "ぎふじょしこうとうがっこう", "ぎふしりつぎふしょうぎょうこうとうがっこう", "ぎふしょうとくがくえんこうとうがっこう", "ぎふだいいちこうとうがっこう", "ぎふひがしこうとうがっこう", "きぼうがおかこうとうがっこう", "きゅうしゅうがくいんこうとうがっこう", "きゅうしゅうこくさいだいがくふぞくこうとうがっこう", "きゅうしゅうさんぎょうだいがくふぞくきゅうしゅうこうとうがっこう", "きゅうしゅうさんぎょうだいがくふぞくきゅうしゅうさんぎょうこうとうがっこう", "きゅうしゅうぶんかがくえんこうとうがっこう", "きょうあいがくえんこうとうがっこう", "きょうえいこうとうがっこう", "ぎょうせいこくさいこうとうがっこう", "きょうわがくいんみずさわだいいちこうとうがっこう", "きりしましりつこくぶちゅうおうこうとうがっこう", "きりすときょうどくりつがくえんこうとうがっこう", "きりゅうしりつしょうぎょうこうとうがっこう", "きりうだいいちこうとうがっこう", "ぎんががくいんこうとうがっこう", "きんきだいがくふぞくしんぐうこうとうがっこう", "きんきだいがくふぞくとよおかこうとうがっこう", "きんきだいがくふぞくひろしまこうとうがっこう ひがしひろしまこう", "きんきだいがくふぞくふくおかこうとうがっこう", "きんきだいがくふぞくひろしまこうとうがっこう ふくやまこう", "きんきだいがくふぞくわかやまこうとうがっこう", "きんじょうがくいんこうとうがっこう", "くげぬまこうとうがっこう", "くのりがくえんこうとうがっこう", "くまもとがくえんだいがくふぞくこうとうがっこう", "あしきたこうとうがっこう", "あそちゅうおうこうとうがっこう あそこうしゃ", "あまくさこうとうがっこう", "たいしこうとうがっこう", "うとこうとうがっこう", "おおづこうとうがっこう", "おがわこうぎょうこうとうがっこう", "かもとこうとうがっこう", "かもとしょうこうこうとうがっこう", "かもとのうぎょうこうとうがっこう", "きくちこうとうがっこう", "きくちのうぎょうこうとうがっこう", "くまこうぎょうこうとうがっこう", "くまもとこうとうがっこう", "くまもときたこうとうがっこう", "くまもとこうぎょうこうとうがっこう", "くまもとしょうぎょうこうとうがっこう", "くまもとにしこうとうがっこう", "くまもとのうぎょうこうとうがっこう", "しょうようこうとうがっこう", "せいせいこうこうとうがっこう", "だいいちこうとうがっこう", "だいにこうとうがっこう", "たまなこうとうがっこう", "たまなこうぎょうこうとうがっこう", "とうりょうこうとうがっこう", "ひとよしこうとうがっこう", "ほくりょうこうとうがっこう", "まつばせこうとうがっこう", "みなまたこうとうがっこう", "みふねこうとうがっこう", "やつしろこうとうがっこう", "やつしろこうぎょうこうとうがっこう", "やつしろひがしこうとうがっこう", "やつしろせいりゅうこうとうがっこう", "あまくさたくしんこうとうがっこうほんどこうしゃ", "くまもとこくふこうとうがっこう", "くまもとしりつちはらだいこうとうがっこう", "くまもとしりつひつゆかんこうとうがっこう", "くまもとちゅうおうこうとうがっこう", "くまもとしんあいじょがくいんこうとうがっこう", "くまもとまりすとがくえんこうとうがっこう", "くもんこくさいがくえんこうとうぶ", "くらしきこうとうがっこう", "くらしきしりつくらしきしょうなんこうとうがっこう", "くらしきしりつまびりょうなんこうとうがっこう", "くらしきすいしょうこうとうがっこう", "くるめがくえんこうとうがっこう", "くるめしりつくるめしょうぎょうこうとうがっこう", "くるめしりつなんちくこうとうがっこう", "くるめしんあいこうとうがっこう", "くるめだいがくふせつこうとうがっこう", "くれあおやまこうとうがっこう", "くれしりつくれこうとうがっこう", "ごこうこうとうがっこう", "あんなかそうごうがくえんこうとうがっこう", "いせさきこうとうがっこう", "いせさきこうぎょうこうとうがっこう", "いせさきこうようこうとうがっこう", "いせさきしょうぎょうこうとうがっこう", "いせさきせいめいこうとうがっこう", "いたくらこうとうがっこう", "おおいずみこうとうがっこう", "おおたこうとうがっこう", "おおたこうぎょうこうとうがっこう", "おおたじょしこうとうがっこう", "おおたひがしこうとうがっこう", "おおたふれっくすこうとうがっこう", "おおままこうとうがっこう", "おぜこうとうがっこう", "きりゅうこうとうがっこう", "きりゅうこうぎょうこうとうがっこう", "しぶかわこうとうがっこう", "しぶかわこうぎょうこうとうがっこう", "しぶかわじょしこうとうがっこう", "しぶかわせいすいこうとうがっこう", "せたのうりんこうとうがっこう", "たかさきこうとうがっこう", "たかさききたこうとうがっこう", "たかさきこうぎょうこうとうがっこう", "たかさきしょうぎょうこうとうがっこう", "たかさきじょしこうとうがっこう", "たかさきひがしこうとうがっこう", "たてばやしこうとうがっこう", "たてばやししょうこうこうとうがっこう", "たてばやしじょしこうとうがっこう", "とみおかこうとうがっこう", "にしおうらこうとうがっこう", "にったあかつきこうとうがっこう", "ぬまたこうとうがっこう", "ぬまたじょしこうとうがっこう", "はるなこうとうがっこう", "ふじおかきたこうとうがっこう", "ふじおかちゅうおうこうとうがっこう", "まえばしこうとうがっこう", "まえばしこうぎょうこうとうがっこう", "まえばししょうぎょうこうとうがっこう", "まえばしじょしこうとうがっこう", "まえばしせいりょうこうとうがっこう", "まえばしにしこうとうがっこう", "まえばしひがしこうとうがっこう", "まえばしみなみこうとうがっこう", "まんばこうとうがっこう", "よしいこうとうがっこう", "とねじつぎょうこうとうがっこう", "けいあいこうとうがっこう", "けいあいがくえんこうとうがっこう", "けいあいだいがくようかいちばこうとうがっこう", "けいおうぎじゅくこうとうがっこう", "けいおうぎじゅくしきこうとうがっこう", "けいおうぎじゅくしょうなんふじさわこうとうぶ", "けいしんこうとうがっこう", "けいしんこうとうがっこう", "けいせいこうとうがっこう", "けいせいこうとうがっこう", "けいほこうとうがっこう", "けいめいがくいんこうとうがっこう", "けいめいがっかんこうとうがっこう", "けいわがくえんこうとうがっこう", "けんめいじょしがくいんこうとうがっこう", "こうがっかんこうとうがっこう", "こうしえんがくいんこうとうがっこう", "こうじょうこうとうがっこう", "こうじょうかんこうとうがっこう", "はままつがくいんこうとうがっこう", "はちのへがくいんこうせいこうとうがっこう", "こうせんかとりっくこうとうがっこう", "こうちこうとうがっこう", "こうちがくげいこうとうがっこう", "あきこうとうがっこう", "いのしょうぎょうこうとうがっこう", "おこうこうとうがっこう", "くぼかわこうとうがっこう", "こうちおづこうとうがっこう", "こうちおうてまえこうとうがっこう", "こうちこうぎょうこうとうがっこう", "こうちにしこうとうがっこう", "こうちのうぎょうこうとうがっこう", "こうちひがしこうとうがっこう", "こうちまるのうちこうとうがっこう", "こうちみなみこうとうがっこう", "しみずこうとうがっこう", "すくもこうぎょうこうとうがっこう", "なかむらこうとうがっこう", "はるのこうとうがっこう", "やまだこうとうがっこう", "こうちしりつこうちしょうぎょうこうとうがっこう", "こうちちゅうおうこうとうがっこう", "こうほうこうとうがっこう", "こうなんこうとうがっこう", "こうなんこうとうがっこう", "こうなんぎじゅくもりおかこうとうがっこう", "こうなんじょしこうとうがっこう", "ごうのかわがくえんいわみちすいかんこうとうがっこう", "こうのだいじょしがくいんこうとうぶ", "こうふくのかがくがくえんこうとうがっこう", "こうふしりつこうふしょうぎょうこうとうがっこう", "かいせいかこうとうがっこう", "こうべかいせいじょしがくいんこうとうがっこう", "こうべがくいんだいがくふぞくこうとうがっこう", "こうべこうりょうがくえんこうとうがっこう", "こうべこくさいだいがくふぞくこうとうがっこう", "こうべじょがくいんこうとうがくぶ", "こうべしりつかがくぎじゅつこうとうがっこう", "こうべしりつふきあいこうとうがっこう", "こうべしりつまやひょうごこうとうがっこう", "こうべしりつろっこうあいらんどこうとうがっこう", "こうべせいじょうこうとうがっこう", "こうべだいいちこうとうがっこう", "こうべときわじょしこうとうがっこう", "こうべのだこうとうがっこう", "さいせいこうかこうとうがっこう", "こうべやまてじょしこうとうがっこう", "こうべりゅうこくこうとうがっこう", "えいりじょしがくいんこうとうがっこう", "こうみょうがくえんさがみはらこうとうがっこう", "こうやさんこうとうがっこう", "こうようこうとうがっこう", "こうようがくいんこうとうがっこう", "こうりょうこうとうがっこう", "こうりょうこうとうがっこう", "こおりやまじょしだいがくふぞくこうとうがっこう", "こくがくいんだいがくとちぎこうとうがっこう", "こくさいがくいんこうとうがっこう", "ごしょがわらしょうぎょうこうとうがっこう", "ごしょがわらだいいちこうとうがっこう", "ごてんばにしこうとうがっこう", "おばやしせいしんじょしがくいんこうとうがっこう", "こまつおおたにこうとうがっこう", "こまつしりつこうとうがっこう", "えいめいこうとうがっこう", "うらわれいめいこうとうがっこう", "こんこうがくえんこうとうがっこう", "さいかいがくえんこうとうがっこう", "かわぐちきたこうとうがっこう", "あげおこうとうがっこう", "あげおたかのだいこうとうがっこう", "あげおたちばなこうとうがっこう", "あげおみなみこうとうがっこう", "あさかこうとうがっこう", "あさかにしこうとうがっこう", "いずみこうとうがっこう", "いながくえんそうごうこうとうがっこう", "いるまこうようこうとうがっこう", "いわつきこうとうがっこう", "いわつきしょうぎょうこうとうがっこう", "いわつきほくりょうこうとうがっこう", "うらわこうとうがっこう", "うらわきたこうとうがっこう", "うらわこうぎょうこうとうがっこう", "うらわしょうぎょうこうとうがっこう", "うらわだいいちじょしこうとうがっこう", "うらわにしこうとうがっこう", "うらわひがしこうとうがっこう", "ふじみのこうとうがっこう", "おおみやこうとうがっこう", "おおみやこうぎょうこうとうがっこう", "おおみやこうりょうこうとうがっこう", "おおみやしょうぎょうこうとうがっこう", "おおみやちゅうおうこうとうがっこう（つうしんせい）", "おおみやひがしこうとうがっこう", "おおみやみなみこうとうがっこう", "おおみやむさしのこうとうがっこう", "おがのこうとうがっこう", "おがわこうとうがっこう", "おけがわこうとうがっこう", "おけがわにしこうとうがっこう", "おごせこうとうがっこう", "かすかべこうとうがっこう", "かすかべこうぎょうこうとうがっこう", "かすかべじょしこうとうがっこう", "かすかべひがしこうとうがっこう", "かわぐちこうとうがっこう", "かわぐちこうぎょうこうとうがっこう", "かわぐちせいりょうこうとうがっこう", "かわぐちひがしこうとうがっこう", "かわごえこうとうがっこう", "かわごえこうぎょうこうとうがっこう", "かわごえじょしこうとうがっこう", "かわごえそうごうこうとうがっこう", "かわごえにしこうとうがっこう", "かわごえはつかりこうとうがっこう", "かわごえみなみこうとうがっこう", "きたもとこうとうがっこう", "くきこうとうがっこう", "くきこうぎょうこうとうがっこう", "くきほくようこうとうがっこう", "くまがやこうとうがっこう", "くまがやこうぎょうこうとうがっこう", "くまがやしょうぎょうこうとうがっこう", "くまがやじょしこうとうがっこう", "くまがやにしこうとうがっこう", "くまがやのうぎょうこうとうがっこう", "くりはしほくさいこうとうがっこう", "げいじゅつそうごうこうとうがっこう", "こうのすこうとうがっこう", "こうのすじょしこうとうがっこう", "こしがやこうとうがっこう", "こしがやきたこうとうがっこう", "こしがやそうごうぎじゅつこうとうがっこう", "こしがやにしこうとうがっこう", "こしがやひがしこうとうがっこう", "こしがやみなみこうとうがっこう", "こだまこうとうがっこう", "こだまはくようこうとうがっこう", "さかどこうとうがっこう", "さかどにしこうとうがっこう", "さってさくらこうとうがっこう", "さやまけいざいこうとうがっこう", "さやまこうぎょうこうとうがっこう", "さやませいりょうこうとうがっこう", "さやまりょくようこうとうがっこう", "しきこうとうがっこう", "しょうわこうとうがっこう", "しらおかこうとうがっこう", "しんしゅうかんこうとうがっこう", "すぎとこうとうがっこう", "すぎとのうぎょうこうとうがっこう", "せいわふくしこうとうがっこう", "そうかこうとうがっこう", "そうかにしこうとうがっこう", "そうかひがしこうとうがっこう", "そうかみなみこうとうがっこう", "ちちぶこうとうがっこう", "ちちぶのうこうかがくこうとうがっこう", "つるがしませいふうこうとうがっこう", "ときわこうとうがっこう", "ところざわこうとうがっこう", "ところざわきたこうとうがっこう", "ところざわしょうぎょうこうとうがっこう", "ところざわちゅうおうこうとうがっこう", "ところざわにしこうとうがっこう", "とだしょうようこうとうがっこう", "とよおかこうとうがっこう", "なめがわそうごうこうとうがっこう", "なんりょうこうとうがっこう", "にいざこうとうがっこう", "にいざそうごうぎじゅつこうとうがっこう", "にいざやなせこうとうがっこう", "はすだしょういんこうとうがっこう", "はとがやこうとうがっこう", "はとやまこうとうがっこう", "はにゅうこうとうがっこう", "はにゅうじつぎょうこうとうがっこう", "はにゅうだいいちこうとうがっこう", "はんのうこうとうがっこう", "ひだかこうとうがっこう", "ふかやこうとうがっこう", "ふかやしょうぎょうこうとうがっこう", "ふかやだいいちこうとうがっこう", "ふきあげしゅうおうこうとうがっこう", "ふじみこうとうがっこう", "ふどうおかこうとうがっこう", "ほんじょうこうとうがっこう", "まつぶしこうとうがっこう", "まつやまこうとうがっこう", "まつやまじょしこうとうがっこう", "みさとこうとうがっこう", "みさときたこうとうがっこう", "みさとこうぎょうぎじゅつこうとうがっこう", "みなのこうとうがっこう", "みやしろこうとうがっこう", "めぬまこうとうがっこう", "やしおこうとうがっこう", "やしおみなみこうとうがっこう", "よしかわみなみこうとうがっこう", "よのこうとうがっこう", "よりいじょうほくこうとうがっこう", "わこうこうとうがっこう", "わこうこくさいこうとうがっこう", "わしのみやこうとうがっこう", "わらびこうとうがっこう", "さいたまさかえこうとうがっこう", "さいたましりつうらわこうとうがっこう", "さいたましりつうらわみなみこうとうがっこう", "さいたましりつおおみやきたこうとうがっこう", "さいたまへいせいこうとうがっこう", "せいびこうとうがっこう", "やまがためいせいこうとうがっこう", "さかいでだいいちこうとうがっこう", "さかえきたこうとうがっこう", "さかえひがしこうとうがっこう", "さががくえんこうとうがっこう", "ありたこうぎょうこうとうがっこう", "いまりこうとうがっこう", "いまりじつぎょうこうとうがっこうしょうぎょうきゃんぱす", "うしづこうとうがっこう", "うれしのこうとうがっこう うれしのこうしゃ（そうごうがっかきゃんぱす）", "かしまこうとうがっこう あかもんがくしゃ", "かしまこうとうがっこう おおてもんがくしゃ", "からつこうぎょうこうとうがっこう", "からつしょうぎょうこうとうがっこう", "からつにしこうとうがっこう", "からつひがしこうとうがっこう", "からつみなみこうとうがっこう", "かんざきこうとうがっこう", "かんざきせいめいこうとうがっこう", "きゅうらぎこうとうがっこう", "こうしかんこうとうがっこう", "おぎこうとうがっこう", "さがきたこうとうがっこう", "さがこうぎょうこうとうがっこう", "さがしょうぎょうこうとうがっこう", "さがにしこうとうがっこう", "さがのうぎょうこうとうがっこう", "さがひがしこうとうがっこう", "たくこうとうがっこう", "たけおこうとうがっこう", "ちえんかんこうとうがっこう", "とすこうとうがっこう", "とすこうぎょうこうとうがっこう", "とすしょうぎょうこうとうがっこう", "みやきこうとうがっこう", "さがじょしたんきだいがくふぞくさがじょしこうとうがっこう", "さがせいわこうとうがっこう", "さかたみなみこうとうがっこう", "さがみじょしだいがくこうとうぶ", "りゅうこくこうとうがっこう", "さくしんがくいんこうとうがっこう", "さくちょうせいこうとうがっこう", "さくらこくさいこうとうがっこう", "さくらのせいぼがくいんこうとうがっこう", "おうりんこうとうがっこう", "さのきよすみこうとうがっこう", "さのにほんだいがくこうとうがっこう", "さびえるこうとうがっこう", "さやまがおかこうとうがっこう", "されじおがくいんこうとうがっこう", "やまむらがくえんこうとうがっこう", "やまむらこくさいこうとうがっこう", "さんようじょがくえんこうとうぶ", "さんようがくえんこうとうがっこう", "しががくえんこうとうがっこう", "しがくかんこうとうぶ", "しがくかんこうとうぶ", "いしやまこうとうがっこう", "えちこうとうがっこう", "あどがわこうとうがっこう", "いかこうとうがっこう", "いしべこうとうがっこう", "いぶきこうとうがっこう", "おおつこうとうがっこう", "おおつしょうぎょうこうとうがっこう", "おおつせいりょうこうとうがっこう", "かたたこうとうがっこう", "きたおおつこうとうがっこう", "くさつこうとうがっこう", "くさつひがしこうとうがっこう", "こうせいこうとうがっこう", "こうなんこうとうがっこう", "こくさいじょうほうこうとうがっこう", "こなんのうぎょうこうとうがっこう", "かわせこうとうがっこう", "しがらきこうとうがっこう", "ぜぜこうとうがっこう", "せたこうぎょうこうとうがっこう", "たかしまこうとうがっこう", "たまがわこうとうがっこう", "とらひめこうとうがっこう", "ながはまきたこうとうがっこう", "ながはまのうぎょうこうとうがっこう", "ながはまほくせいこうとうがっこう", "のとがわこうとうがっこう", "ひがしおおつこうとうがっこう", "ひこねこうぎょうこうとうがっこう", "ひこねしょうせいかんこうとうがっこう", "ひこねひがしこうとうがっこう", "ひのこうとうがっこう", "まいばらこうとうがっこう", "みなくちこうとうがっこう", "みなくちひがしこうとうがっこう", "もりやまこうとうがっこう", "もりやまきたこうとうがっこう", "はちまんこうとうがっこう", "はちまんこうぎょうこうとうがっこう", "はちまんしょうぎょうこうとうがっこう", "ようかいちこうとうがっこう", "ようかいちみなみこうとうがっこう", "りっとうこうとうがっこう", "しがたんきだいがくふぞくこうとうがっこう", "しがくかんこうとうがっこう", "しずおかえいわじょがくいんこうとうがっこう", "しずおかがくえんこうとうがっこう", "しずおかきたこうとうがっこう", "しずおかけんふじみこうとうがっこう", "あたみこうとうがっこう", "あらいこうとうがっこう", "いけしんでんこうとうがっこう", "いずそうごうこうとうがっこう", "いずちゅうおうこうとうがっこう", "いわたきたこうとうがっこう", "いわたにしこうとうがっこう", "いわたのうぎょうこうとうがっこう", "いわたみなみこうとうがっこう", "せいりゅうかんこうとうがっこう", "おがさこうとうがっこう", "かがくぎじゅつこうとうがっこう", "かけがわこうぎょうこうとうがっこう", "かけがわにしこうとうがっこう", "かけがわひがしこうとうがっこう", "かなやこうとうがっこう", "かわねこうとうがっこう", "こさいこうとうがっこう", "ごてんばこうとうがっこう", "ごてんばみなみこうとうがっこう", "おやまこうとうがっこう", "さがらこうとうがっこう", "しずおかこうとうがっこう", "しずおかしょうぎょうこうとうがっこう", "しずおかじょうほくこうとうがっこう", "しずおかちゅうおうこうとうがっこう", "しずおかにしこうとうがっこう", "しずおかひがしこうとうがっこう", "しまだこうとうがっこう", "しまだこうぎょうこうとうがっこう", "しまだしょうぎょうこうとうがっこう", "しみずにしこうとうがっこう", "しみずひがしこうとうがっこう", "しもだこうとうがっこう", "てんりゅうこうとうがっこうふたまたこうしゃ", "とおとうみそうごうこうとうがっこう", "にらやまこうとうがっこう", "ぬまづこうぎょうこうとうがっこう", "ぬまづしょうぎょうこうとうがっこう", "ぬまづじょうほくこうとうがっこう", "ぬまづにしこうとうがっこう", "ぬまづひがしこうとうがっこう", "はいばらこうとうがっこう", "はまきたにしこうとうがっこう", "はまなこうとうがっこう", "はままつえのしまこうとうがっこう", "はままつおおひらだいこうとうがっこう", "はままつきたこうとうがっこう", "はままつこうぎょうこうとうがっこう", "はままつことうこうとうがっこう", "はままつこなんこうとうがっこう", "はままつじょうほくこうぎょうこうとうがっこう", "はままつしょうぎょうこうとうがっこう", "はままつひがしこうとうがっこう", "はままつみなみこうとうがっこう", "ふくろいこうとうがっこう", "ふくろいしょうぎょうこうとうがっこう", "ふじこうとうがっこう", "ふじえだきたこうとうがっこう", "ふじえだにしこうとうがっこう", "ふじえだひがしこうとうがっこう", "ふじのみやきたこうとうがっこう", "ふじのみやにしこうとうがっこう", "ふじのみやひがしこうとうがっこう", "ふがくかんこうとうがっこう", "ふじひがしこうとうがっこう", "みしまきたこうとうがっこう", "みしまちょうりょうこうとうがっこう", "みしまみなみこうとうがっこう", "やいづすいさんこうとうがっこう", "やいづちゅうおうこうとうがっこう", "よこすかこうとうがっこう", "よしわらこうとうがっこう", "しずおかじょしこうとうがっこう", "しずおかしりつこうとうがっこう", "しみずさくらがおかこうとうがっこう", "しずおかせいこうがくいんこうとうがっこう", "しずおかたいせいこうとうがっこう", "しずおかふたばこうとうがっこう", "しなのむつみこうとうがっこう", "しばうらこうぎょうだいがくかしわこうとうがっこう", "しばたがくえんこうとうがっこう", "しばたちゅうおうこうとうがっこう", "しぶやきょういくがくえんまくはりこうとうがっこう", "しまだしょうせいこうとうがっこう", "いずもこうとうがっこう", "いずもこうぎょうこうとうがっこう", "いずもしょうぎょうこうとうがっこう", "いずものうりんこうとうがっこう", "おおだこうとうがっこう", "しまねちゅうおうこうとうがっこう", "じょうほうかがくこうとうがっこう", "しんじこうとうがっこう", "たいしゃこうとうがっこう", "たいとうこうとうがっこう", "つわのこうとうがっこう", "にまこうとうがっこう", "はまだこうとうがっこう", "はまだすいさんこうとうがっこう", "ひらたこうとうがっこう", "ますだこうとうがっこう", "ますだしょうようこうとうがっこう", "まつえきたこうとうがっこう", "まつえしょうぎょうこうとうがっこう", "まつえのうりんこうとうがっこう", "まつえひがしこうとうがっこう", "まつえみなみこうとうがっこう", "みとやこうとうがっこう", "やかみこうとうがっこう", "やすぎこうとうがっこう", "よこたこうとうがっこう", "しまばらちゅうおうこうとうがっこう", "しみずがおかこうとうがっこう", "しみずこくさいこうとうがっこう", "しものせきしりつしものせきしょうぎょうこうとうがっこう", "じゆうがおかこうとうがっこう", "しゅうがくかんこうとうがっこう", "しゅうじつこうとうがっこう", "しゅうどうこうとうがっこう", "じゆうのもりがくえんこうとうがっこう", "しゅうぶんがくいんこうとうがっこう", "しゅうめいやちよこうとうがっこう", "しゅくがわこうとうがっこう", "しゅくとくよのこうとうがっこう", "じゅとくこうとうがっこう", "じゅんしんこうとうがっこう", "じゅんしんがくいんこうとうがっこう", "じゅんしんじょしこうとうがっこう", "しょういんがくえんふくしまこうとうがっこう", "じょうえつこうとうがっこう", "しょうけいこうとうがっこう", "しょうけいがくいんこうとうがっこう", "じょうさいだいがくふぞくかわごえこうとうがっこう", "しょうしかんこうとうがっこう", "じょうそうがくいんこうとうがっこう", "しょうちふかやこうとうがっこう", "しょうとくがくいんこうとうがっこう", "しょうなんこうとうがっこう", "しょうなんがくいんこうとうがっこう", "しょうなんがくえんこうとうがっこう", "しょうなんこうかだいがくふぞくこうとうがっこう", "じょうなんしずおかこうとうがっこう", "しょうなんしらゆりがくえんこうとうがっこう", "しょうなんだいにこうとうがっこう", "しょうはくがくいんくらよしきたこうとうがっこう", "しょうふうじゅくこうとうがっこう", "しょうへいこうとうがっこう", "しょうわがくいんこうとうがっこう", "しょうわがくいんしゅうえいこうとうがっこう", "しょうわがくえんこうとうがっこう", "しょうわやっかだいがくふぞくこうとうがっこう", "じょすいかんこうとうがっこう", "じょうほくさいたまこうとうがっこう", "じんあいこうとうがっこう", "じんあいじょしこうとうがっこう", "しんこうがくえんこうとうがっこう", "しんじょうひがしこうとうがっこう", "じんせいがくえんこうとうがっこう", "しんそうかんこうとうがっこう", "にったこうとうがっこう", "しんとくがくえんしんとくじょしこうとうがっこう", "しんわじょしこうとうがっこう", "すぎもりこうとうがっこう", "すぎやまじょがくえんこうとうがっこう", "ずしかいせいこうとうがっこう", "すずかこうとうがっこう", "ひろしましゅうどうだいがくひろしまきょうそうこうとうがっこう", "すまがくえんこうとうがっこう", "ひょうごだいがくふぞくすまのうらこうとうがっこう", "すんだいこうふこうとうがっこう", "せいうるすらがくいんえいちこうとうがっこう", "せいうんこうとうがっこう", "せいえいこうとうがっこう", "せいかじょしこうとうがっこう", "せいかたりながくえんこうとうがっこう", "せいかぴたにおじょしこうとうがっこう", "せいこうこうとうがっこう", "せいこうがくえんこうとうがっこう", "せいさこうとうがっこう", "せいしゅうこうとうがっこう", "せいじょうこうとうがっこう", "せいしんこうとうがっこう", "せいしんうるすらがくえんこうとうがっこう", "せいしんがくえんこうとうがっこう", "せいせしりあじょしこうとうがっこう", "せいせんじょがくいんこうとうがっこう", "せいとくだいがくふぞくじょしこうとうがっこう", "せいとくだいがくふぞくとりでせいとくじょしこうとうがっこう", "せいどみにこがくいんこうとうがっこう", "せいなんがくいんこうとうがっこう", "せいなんじょがくいんこうとうがっこう", "せいぶがくえんぶんりこうとうがっこう", "せいぶだいこうとうがっこう", "せいぶだいちばこうとうがっこう", "せいぼうがくえんこうとうがっこう", "せいまりあじょがくいんこうとうがっこう", "せいらんたいとこうとうがっこう", "せいりょうこうとうがっこう", "せいりょうこうとうがっこう", "せいりんこうとうがっこう", "せいりんかんこうとうがっこう", "せいれいこうとうがっこう", "せいれいくりすとふぁーこうとうがっこう", "せいれいじょしたんきだいがくふぞくこうとうがっこう", "せいわがくいんこうとうがっこう", "せいわがくえんこうとうがっこう", "せいわじょしがくいんこうとうがっこう", "せきしりつせきしょうこうこうとうがっこう", "せきねがくえんこうとうがっこう", "せとうちこうとうがっこう", "ひろしまさくらがおかこうとうがっこう", "せんしゅうだいがくきたかみこうとうがっこう", "せんしゅうだいがくくまもとたまなこうとうがっこう", "せんしゅうだいがくまつどこうとうがっこう", "せんぞくがくえんこうとうがっこう", "せんだいいくえいがくえんこうとうがっこう", "せんだいしらゆりがくえんこうとうがっこう", "せんだいしりつせんだいこうとうがっこう", "せんだいしりつせんだいこうぎょうこうとうがっこう", "せんだいしりつせんだいしょうぎょうこうとうがっこう", "せんだいしりつせんだいたいしこうとうがっこう", "せんとよぜふじょしがくえんこうとうがっこう", "そうしがくえんこうとうがっこう", "そうしんじょがっこうこうとうがくぶ", "そうせいかんこうとうがっこう", "そうとくこうとうがっこう", "そうようこうとうがっこう", "そのだがくえんこうとうがっこう", "だいいちやっかだいがくふぞくこうとうがっこう", "じょうちふくおかこうとうがっこう", "たいせいじょしこうとうがっこう", "だいどうだいがくだいどうこうとうがっこう", "たかおかこうりょうこうとうがっこう", "たかおかだいいちこうとうがっこう", "たかおかりゅうこくこうとうがっこう", "たかがわがくえんこうとうがっこう", "たかさきけいざいだいがくふぞくこうとうがっこう", "たかさきけんこうふくしだいがくたかさきこうとうがっこう", "たかさきしょうかだいがくふぞくこうとうがっこう", "しょうしこうとうがっこう", "たかだこうとうがっこう", "たかまつだいいちこうとうがっこう", "たかまつちゅうおうこうとうがっこう", "たかみずこうとうがっこう", "たかやまにしこうとうがっこう", "たきこうとうがっこう", "たきがわこうとうがっこう", "たきがわだいにこうとうがっこう", "たくしょくだいがくこうりょうこうとうがっこう", "たけだこうとうがっこう", "ひろしまぶんきょうだいがくふぞくこうとうがっこう", "たけたみなみこうとうがっこう", "たじみにしこうとうがっこう", "たちばながくえんこうとうがっこう", "たちばながくえんこうとうがっこう", "たまなじょしこうとうがっこう", "たまのしょうこうこうとうがっこう", "ちくようがくえんこうとうがっこう", "ちばがくえんこうとうがっこう", "ちばがくげいこうとうがっこう", "ちばけいあいこうとうがっこう", "ちばけいざいだいがくふぞくこうとうがっこう", "あさひのうぎょうこうとうがっこう", "あねさきこうとうがっこう", "あびここうとうがっこう", "あわこうとうがっこう", "あわたくしんこうとうがっこう", "いずみこうとうがっこう", "いそべこうとうがっこう", "いちかわこうぎょうこうとうがっこう", "いちかわすばるこうとうがっこう", "いちかわひがしこうとうがっこう", "いちかわみなみこうとうがっこう", "いちのみやしょうぎょうこうとうがっこう", "いちはらこうとうがっこう", "いちはらみどりこうとうがっこう", "いちはらやわたこうとうがっこう", "いんばめいせいこうとうがっこう", "うらやすこうとうがっこう", "うらやすみなみこうとうがっこう", "おいはまこうとうがっこう", "おおたきこうとうがっこう", "おおはらこうとうがっこう", "おみがわこうとうがっこう", "かしわこうとうがっこう", "かしわいこうとうがっこう", "かしわちゅうおうこうとうがっこう", "かしわのはこうとうがっこう", "かしわみなみこうとうがっこう", "かまがやこうとうがっこう", "かまがやにしこうとうがっこう", "きさらづこうとうがっこう", "きさらづひがしこうとうがっこう", "きみつこうとうがっこう", "きみつしょうぎょうこうとうがっこう", "ぎょうとくこうとうがっこう", "くじゅうくりこうとうがっこう", "けいようこうとうがっこう", "けいようこうぎょうこうとうがっこう", "けみがわこうとうがっこう", "こうのだいこうとうがっこう", "こがねこうとうがっこう", "こくぶんこうとうがっこう", "こてはしこうとうがっこう", "さくらこうとうがっこう", "さくらにしこうとうがっこう", "さくらひがしこうとうがっこう", "さくらみなみこうとうがっこう", "さわらこうとうがっこう", "さわらはくようこうとうがっこう", "しみずこうとうがっこう", "しょうなんこうとうがっこう", "しょうなんたかやなぎこうとうがっこう", "しろいこうとうがっこう", "せきやどこうとうがっこう", "そうさこうとうがっこう", "そでがうらこうとうがっこう", "おおあみこうとうがっこう", "たここうとうがっこう", "たてやまそうごうこうとうがっこう", "ちしろだいこうとうがっこう", "ちばこうとうがっこう", "ちばきたこうとうがっこう", "ちばこうぎょうこうとうがっこう", "ちばしょうぎょうこうとうがっこう", "ちばじょしこうとうがっこう", "ちばにしこうとうがっこう", "ちばひがしこうとうがっこう", "ちばみなみこうとうがっこう", "ちょうしこうとうがっこう", "ちょうししょうぎょうこうとうがっこう", "ちょうせいこうとうがっこう", "つだぬまこうとうがっこう", "とうがねこうとうがっこう", "とうがねしょうぎょうこうとうがっこう", "とうそうこうぎょうこうとうがっこう", "とけこうとうがっこう", "とみさとこうとうがっこう", "ながさこうとうがっこう", "ながれやまこうとうがっこう", "ながれやまおおたかのもりこうとうがっこう", "ながれやまきたこうとうがっこう", "ながれやまみなみこうとうがっこう", "なりたきたこうとうがっこう", "なりたこくさいこうとうがっこう", "なりたせいりょうこうとうがっこう", "なるとうこうとうがっこう", "のだちゅうおうこうとうがっこう", "はくりょうこうとうがっこう", "ひがしかつしかこうとうがっこう", "あびこひがしこうとうがっこう", "ふなばしこうとうがっこう", "ふなばしきたこうとうがっこう", "ふなばしけいめいこうとうがっこう", "ふなばしこわがまこうとうがっこう", "ふなばししばやまこうとうがっこう", "ふなばしとよとみこうとうがっこう", "ふなばしひがしこうとうがっこう", "ふなばしふたわこうとうがっこう", "ふなばしほうでんこうとうがっこう", "まくはりそうごうこうとうがっこう", "まつおこうとうがっこう", "まつどこうとうがっこう", "まつどこうようこうとうがっこう", "まつどこくさいこうとうがっこう", "まつどまばしこうとうがっこう", "まつどみなみこうとうがっこう", "まつどむつみこうとうがっこう", "みもみこうとうがっこう", "もばらこうとうがっこう", "もばらしょうようこうとうがっこう", "やくえんだいこうとうがっこう", "やちまたこうとうがっこう", "やちよこうとうがっこう", "やちよにしこうとうがっこう", "やちよひがしこうとうがっこう", "よつかいどうこうとうがっこう", "よつかいどうきたこうとうがっこう", "わかまつこうとうがっこう", "しょうりんこうとうがっこう", "ちばしょうかだいがくふぞくこうとうがっこう", "ちばしりついなげこうとうがっこう", "ちばしりつちばこうとうがっこう", "ちばせいしんこうとうがっこう", "ちばにほんだいがくだいいちこうとうがっこう", "ちばえいわこうとうがっこう", "ちばほうようこうとうがっこう", "ちばめいとくこうとうがっこう", "ちばれいめいこうとうがっこう", "ちべんがくえんこうとうがっこう", "ちべんがくえんならかれっじこうとうぶ", "ちべんがくえんわかやまこうとうがっこう", "ちゅうおうがくいんこうとうがっこう", "ちゅうおうだいがくふぞくよこはまこうとうがっこう", "ちゅうきょうこうとうがっこう", "ちゅうきょうだいがくふぞくちゅうきょうこうとうがっこう", "ちゅうぶだいがくだいいちこうとうがっこう", "ちょうししりつちょうしこうとうがっこう", "ちんぜいこうとうがっこう", "ちんぜいがくいんこうとうがっこう", "ちくしじょがくえんこうとうがっこう", "ちくしだいこうとうがっこう", "つくばかいせいこうとうがっこう", "つくばこくさいだいがくこうとうがっこう", "つくばこくさいだいがくはるかぜこうとうがっこう", "つくばしゅうえいこうとうがっこう", "つくばだいがくふぞくさかどこうとうがっこう", "つげのこうとうがっこう", "つちうらにほんだいがくこうとうがっこう", "つるおかひがしこうとうがっこう", "つるがけひこうとうがっこう", "つるみだいがくふぞくこうとうがっこう", "ていきょうあさかこうとうがっこう", "ていきょうだいがくかにこうとうがっこう", "ていきょうだいごこうとうがっこう", "ていきょうだいさんこうとうがっこう", "ていきょうながおかこうとうがっこう", "てづかやまこうとうがっこう", "てんりこうとうがっこう", "とういんこうとうがっこう", "とういんがくえんこうとうがっこう", "とうおうがくえんこうとうがっこう", "とうおうぎじゅくこうとうがっこう", "とうかいこうとうがっこう", "とうかいがくえんこうとうがっこう", "とうかいだいがくふぞくこうふこうとうがっこう", "とうかいだいがくふぞくうらやすこうとうがっこう", "とうかいだいがくふぞくさがみこうとうがっこう", "とうかいだいがくふぞくしずおかしょうようこうとうがっこう", "とうかいだいがくふぞくふくおかこうとうがっこう", "とうかいだいがくふぞくすわこうとうがっこう", "とうかいだいがくふぞくくまもとせいしょうこうとうがっこう", "とうかいだいがくふぞくいちはらぼうようこうとうがっこう", "とうかいだいがくやまがたこうとうがっこう", "とうきょうがっかんこうとうがっこう", "とうきょうがっかんうらやすこうとうがっこう", "とうきょうがっかんにいがたこうとうがっこう", "とうきょうがっかんふなばしこうとうがっこう", "とうきょうせいとくだいがくふかやこうとうがっこう", "とうきょうとしだいがくしおじりこうとうがっこう", "とうきょうのうぎょうだいがくだいさんこうとうがっこう", "とうきょうのうぎょうだいがくだいにこうとうがっこう", "とうこうがくえんこうとうがっこう", "とうだいじがくえんこうとうがっこう", "とうほうこうとうがっこう", "どうほうこうとうがっこう", "とうほうだいがくふぞくとうほうこうとうがっこう", "とうほくこうとうがっこう", "とうほくがくいんこうとうがっこう", "とうほくがくいんつつじがおかこうとうがっこう", "せんだいじょうなんこうとうがっこう", "とうほくせいかつぶんかだいがくこうとうがっこう", "とうめいかんこうとうがっこう", "とうようこうとうがっこう", "とうようこうとうがっこう", "とうようだいがくふぞくうしくこうとうがっこう", "とうようだいがくふぞくひめじこうとうがっこう", "とうれいがくえんふじさわこうとうがっこう", "ときわこうとうがっこう", "ときわぎがくえんこうとうがっこう", "ときわだいがくこうとうがっこう", "かわしまこうとうがっこう", "わきまちこうとうがっこう", "あわこうとうがっこう", "かいふこうとうがっこう", "あわにしこうとうがっこう", "いけだこうとうがっこう", "いたのこうとうがっこう", "こまつしまこうとうがっこう", "こまつしまにしこうとうがっこう", "つるぎこうとうがっこう", "じょうせいこうとうがっこう", "じょうとうこうとうがっこう", "じょうのうちこうとうがっこう", "じょうほくこうとうがっこう", "じょうなんこうとうがっこう", "いけだこうとうがっこうつじこう", "とくしまかがくぎじゅつこうとうがっこう", "とくしまきたこうとうがっこう", "とくしましょうぎょうこうとうがっこう", "とみおかにしこうとうがっこう", "とみおかひがしこうとうがっこう", "なるとこうとうがっこう", "みょうざいこうとうがっこう", "とくしましりつこうとうがっこう", "とくしまぶんりこうとうがっこう", "とくふうこうとうがっこう", "とこはだいがくふぞくとこはこうとうがっこう", "とこはだいがくふぞくきくかわこうとうがっこう", "とこはだいがくふぞくたちばなこうとうがっこう", "とさこうとうがっこう", "とさじゅくこうとうがっこう", "とさじょしこうとうがっこう", "あしかがこうとうがっこう", "あしかがこうぎょうこうとうがっこう", "あしかがせいふうこうとうがっこう", "あしかがみなみこうとうがっこう", "いしばしこうとうがっこう", "いまいちこうとうがっこう", "いまいちこうぎょうこうとうがっこう", "うつのみやこうとうがっこう", "うつのみやきたこうとうがっこう", "うつのみやこうぎょうこうとうがっこう", "うつのみやしょうぎょうこうとうがっこう", "うつのみやじょしこうとうがっこう", "うつのみやせいりょうこうとうがっこう", "うつのみやちゅうおうこうとうがっこう", "うつのみやはくようこうとうがっこう", "うつのみやひがしこうとうがっこう", "うつのみやみなみこうとうがっこう", "おおたわらこうとうがっこう", "おおたわらじょしこうとうがっこう", "がくゆうかんこうとうがっこう", "かぬまこうとうがっこう", "かぬましょうこうこうとうがっこう", "かぬまひがしこうとうがっこう", "かぬまみなみこうとうがっこう", "かみのかわこうとうがっこう", "からすやまこうとうがっこう", "くろいそこうとうがっこう", "くろいそみなみこうとうがっこう", "くろばねこうとうがっこう", "おやまこうとうがっこう", "おやまほくおうこうとうがっこう", "おやまじょうなんこうとうがっこう", "おやまにしこうとうがっこう", "おやまみなみこうとうがっこう", "さくらせいしゅうこうとうがっこう", "さのこうとうがっこう", "さのしょうおうこうとうがっこう", "さのひがしこうとうがっこう", "たかねざわこうとうがっこう", "とちぎこうとうがっこう", "とちぎこうぎょうこうとうがっこう", "とちぎしょうぎょうこうとうがっこう", "とちぎしょうなんこうとうがっこう", "とちぎじょしこうとうがっこう", "とちぎのうぎょうこうとうがっこう", "なすせいほうこうとうがっこう", "なすたくようこうとうがっこう", "にっこうめいほうこうとうがっこう", "ましこほうせいこうとうがっこう", "みぶこうとうがっこう", "もおかこうとうがっこう", "もおかこうぎょうこうとうがっこう", "もおかじょしこうとうがっこう", "もおかほくりょうこうとうがっこう", "もてぎこうとうがっこう", "やいたこうとうがっこう", "やいたひがしこうとうがっこう", "どっきょうさいたまちゅうがくこうとうがっこう", "とっとりかせいがくえんとっとりけいあいこうとうがっこう", "あおやこうとうがっこう", "いわみこうとうがっこう", "くらよしそうごうさんぎょうこうとうがっこう", "くらよしにしこうとうがっこう", "くらよしのうぎょうこうとうがっこう", "くらよしひがしこうとうがっこう", "さかいこうとうがっこう", "さかいみなとそうごうぎじゅつこうとうがっこう", "とっとりこうぎょうこうとうがっこう", "とっとりこりょうこうとうがっこう", "とっとりしょうぎょうこうとうがっこう", "とっとりちゅうおういくえいこうとうがっこう", "とっとりにしこうとうがっこう", "とっとりひがしこうとうがっこう", "やずこうとうがっこう", "よなごこうとうがっこう", "よなごこうぎょうこうとうがっこう", "よなごにしこうとうがっこう", "よなごひがしこうとうがっこう", "よなごみなみこうとうがっこう", "とねしょうぎょうこうとうがっこう", "とみたこうとうがっこう", "いするぎこうとうがっこう", "うおづこうとうがっこう", "うおづこうぎょうこうとうがっこう", "おやまこうとうがっこう", "かみいちこうとうがっこう", "くれはこうとうがっこう", "こすぎこうとうがっこう", "さくらいこうとうがっこう", "しきのこうとうがっこう", "しんみなとこうとうがっこう", "だいもんこうとうがっこう", "たかおかこうとうがっこう", "たかおかこうげいこうとうがっこう", "たかおかしょうぎょうこうとうがっこう", "たかおかみなみこうとうがっこう", "ちゅうおうのうぎょうこうとうがっこう", "となみこうとうがっこう", "とやまこうとうがっこう", "とやまいずみこうとうがっこう", "とやまこうぎょうこうとうがっこう", "とやましょうぎょうこうとうがっこう", "とやまちゅうぶこうとうがっこう", "とやまにしこうとうがっこう", "とやまひがしこうとうがっこう", "とやまほくぶこうとうがっこう", "とやまみなみこうとうがっこう", "なめりかわこうとうがっこう", "なんとふくのこうとうがっこう", "にゅうぜんこうとうがっこう", "ひみこうとうがっこう", "ふくおかこうとうがっこう", "ふしきこうとうがっこう", "やつおこうとうがっこう", "ゆうほうこうごうかっこう（つうしんせい）", "とやまこくさいだいがくふぞくこうとうがっこう", "とやまだいいちこうとうがっこう", "とよかわこうとうがっこう", "とよたおおたにこうとうがっこう", "とよはししりつとよはしこうとうがっこう", "とよはしちゅうおうこうとうがっこう", "ふくおかじょししょうぎょうこうとうがっこう", "ちゅうえつこうとうがっこう", "ながさきぎょくせいこうとうがっこう", "いきこうとうがっこう", "いさはやこうとうがっこう", "いさはやしょうぎょうこうとうがっこう", "いさはやのうぎょうこうとうがっこう", "いさはやひがしこうとうがっこう", "おおむらこうとうがっこう", "おおむらこうぎょうこうとうがっこう", "おおむらじょうなんこうとうがっこう", "かみごとうこうとうがっこう", "かわたなこうとうがっこう", "こうかこうとうがっこう", "ごとうこうとうがっこう", "ごとうかいようこうとうがっこう", "させぼきたこうとうがっこう", "させぼこうぎょうこうとうがっこう", "させぼしょうぎょうこうとうがっこう", "させぼちゅうおうこうとうがっこう", "させぼとうしょうこうとうがっこう", "させぼにしこうとうがっこう", "させぼみなみこうとうがっこう", "しかまちこうぎょうこうとうがっこう", "しまばらこうとうがっこう", "しまばらこうぎょうこうとうがっこう", "しまばらしょうぎょうこうとうがっこう", "せいほうこうとうがっこう", "せいりょうこうとうがっこう", "つしまこうとうがっこう", "ながさきかくようこうとうがっこう", "ながさききたこうとうがっこう", "ながさきこうぎょうこうとうがっこう", "ながさきにしこうとうがっこう", "ながさきひがしこうとうがっこう", "ながさきほくようだいこうとうがっこう", "ながさきみなみこうとうがっこう", "ながさきめいせいこうとうがっこう", "なるたきこうとうがっこう", "はさみこうとうがっこう", "ひらどこうとうがっこう", "ゆうこうかんこうとうがっこう", "ながさきじょしこうとうがっこう", "ながさきじょししょうぎょうこうとうがっこう", "ながさきしりつながさきしょうぎょうこうとうがっこう", "ながさきにほんだいがくこうとうがっこう", "ながさきなんざんこうとうがっこう", "ながしまがくえんいずもにしこうとうがっこう", "あかしなこうとうがっこう", "あかほこうとうがっこう", "あずさがわこうとうがっこう", "あなんこうとうがっこう", "いいだこうとうがっこう", "いいだおーあいでぃーいーおさひめこうとうがっこう", "いいだふうえつこうとうがっこう", "いいやまこうとうがっこう", "いけだこうぎょうこうとうがっこう", "いなきたこうとうがっこう", "いなやよいがおかこうとうがっこう", "いわむらだこうとうがっこう", "うえだこうとうがっこう", "うえだちくまこうとうがっこう", "うえだそめやおかこうとうがっこう", "うえだひがしこうとうがっこう", "おうみこうとうがっこう", "おおまちがくようこうとうがっこう", "おかやこうぎょうこうとうがっこう", "おかやひがしこうとうがっこう", "おかやみなみこうとうがっこう", "しもいなのうぎょうこうとうがっこう", "しもすわこうようこうとうがっこう", "かみいなのうぎょうこうとうがっこう", "きそせいほうこうとうがっこう", "さくだいらそうごうぎじゅつこうとうがっこうあさまきゃんぱす", "こまがねこうぎょうこうとうがっこう", "こもろこうとうがっこう", "こもろしょうぎょうこうとうがっこう", "さかきこうとうがっこう", "さらしなのうぎょうこうとうがっこう", "しおじりしがくかんこうとうがっこう", "しののいこうとうがっこう", "すざかこうとうがっこう", "すざかそうせいこうとうがっこう すえんきゃんぱす", "すざかそうせいこうとうがっこう すしょうきゃんぱす", "すざかひがしこうとうがっこう", "すわじつぎょうこうとうがっこう", "すわせいりょうこうとうがっこう", "すわふたばこうとうがっこう", "そなんこうとうがっこう", "たがわこうとうがっこう", "たつのこうとうがっこう", "たてしなこうとうがっこう", "とうみせいしょうこうとうがっこう", "とよしなこうとうがっこう", "ながのこうとうがっこう", "ながのこうぎょうこうとうがっこう", "ながのしょうぎょうこうとうがっこう", "なかのにしこうとうがっこう", "ながのにしこうとうがっこうつうしんせい", "ながのひがしこうとうがっこう", "ながのみなみこうとうがっこう", "ながのよしだこうとうがっこう", "なかのりっしかんこうとうがっこう", "のざわきたこうとうがっこう", "のざわみなみこうとうがっこう", "はくばこうとうがっこう", "ふじみこうとうがっこう", "ほたかしょうぎょうこうとうがっこう", "まつかわこうとうがっこう", "まつしろこうとうがっこう", "まつもとあがたがおかこうとうがっこう", "まつもとありがさきこうとうがっこう", "まつもとこうぎょうこうとうがっこう", "まつもとちくまこうとうがっこうつうしんせい", "まつもとふかしこうとうがっこう", "まつもとみすずがおかこうとうがっこう", "まるこしゅうがくかんこうとうがっこう", "みなみあづみのうぎょうこうとうがっこう", "やしろこうとうがっこう", "やしろみなみこうとうがっこう", "ながのしゅんえいこうとうがっこう", "ながのじょしこうとうがっこう", "ながのしりつながのこうとうがっこう", "ながのせいせんじょがくいんこうとうがっこう", "ながのにほんだいがくこうとうがっこう", "なかむらがくえんさんようこうとうがっこう", "なかむらがくえんじょしこうとうがっこう", "なかむらじょしこうとうがっこう", "なかやまがくえんこうとうがっこう", "なごやこうとうがっこう", "なごやおおたにこうとうがっこう", "なごやけいざいだいがくいちむらこうとうがっこう", "なごやけいざいだいがくたかくらこうとうがっこう", "なごやこうぎょうこうとうがっこう", "なごやこくさいこうとうがっこう", "なごやじょしだいがくこうとうがっこう", "なごやしりつきくざとこうとうがっこう", "なごやしりつきたこうとうがっこう", "なごやしりつこうぎょうこうとうがっこう", "なごやしりつこうげいこうとうがっこう", "なごやしりつこうようこうとうがっこう", "なごやしりつさくらだいこうとうがっこう", "なごやしりつせいりょうこうとうがっこう", "なごやしりつちゅうおうこうとうがっこう", "なごやしりつとみだこうとうがっこう", "なごやしりつなごやしょうぎょうこうとうがっこう", "なごやしりつみどりこうとうがっこう", "なごやしりつめいとうこうとうがっこう", "なごやしりつやまだこうとうがっこう", "なごやしりつわかみやしょうぎょうこうとうがっこう", "なごやだいがくきょういくがくぶふぞくこうとうがっこう", "なだこうとうがっこう", "ならいくえいこうとうがっこう", "ならがくえんこうとうがっこう", "いこまこうとうがっこう", "うねびこうとうがっこう", "おうじこうぎょうこうとうがっこう", "おおよどこうとうがっこう", "かしばこうとうがっこう", "かしはらこうとうがっこう", "たかまどげいじゅつこうとうがっこう", "こおりやまこうとうがっこう", "ごじょうこうとうがっこう", "ごせじつぎょうこうとうがっこう", "さくらいこうとうがっこう", "しきのこうとうがっこう", "しんせいしょうようこうとうがっこう", "せいしょうこうとうがっこう", "せいわせいりょうこうとうがっこう", "そえかみこうとうがっこう", "たかだこうとうがっこう", "たかとりこくさいこうとうがっこう", "とみがおかこうとうがっこう", "ならこうとうがっこう", "ならきたこうとうがっこう", "ならじょうほうしょうぎょうこうとうがっこう", "ならすざくこうとうがっこう", "にかいどうこうとうがっこう", "にしのきょうこうとうがっこう", "へいじょうこうとうがっこう", "ほうりゅうじこくさいこうとうがっこう", "やまとこうりょうこうとうがっこう", "やまとちゅうおうこうとうがっこう", "ならしのしりつならしのこうとうがっこう", "ならじょしこうとうがっこう", "ならしりついちじょうこうとうがっこう", "ならだいがくふぞくこうとうがっこう", "ならぶんかこうとうがっこう", "なりたこうとうがっこう", "あがれいめいこうとうがっこう", "あらいこうとうがっこう", "いといがわこうとうがっこう", "いといがわはくれいこうとうがっこう", "おぢやこうとうがっこう", "おぢやにしこうとうがっこう", "かいようこうとうがっこう", "かしわざきこうとうがっこう", "かしわざきこうぎょうこうとうがっこう", "かしわざきそうごうこうとうがっこう", "かしわざきときわこうとうがっこう", "かもこうとうがっこう", "かものうりんこうとうがっこう", "こいでこうとうがっこう", "こくさいじょうほうこうとうがっこう", "ごせんこうとうがっこう", "さどこうとうがっこう", "さどそうごうこうとうがっこう", "さんじょうこうとうがっこう", "さんじょうしょうぎょうこうとうがっこう", "さんじょうひがしこうとうがっこう", "しおざわしょうこうこうとうがっこう", "しばたこうとうがっこう", "しばたしょうぎょうこうとうがっこう", "しばたのうぎょうこうとうがっこう", "しばたみなみこうとうがっこう", "じょうえつそうごうぎじゅつこうとうがっこう", "しょうとくかんこうとうがっこう", "たかだこうとうがっこう", "たかだしょうぎょうこうとうがっこう", "たかだのうぎょうこうとうがっこう", "たかだきたしろこうとうがっこう", "なかじょうこうとうがっこう", "つばめちゅうとうきょういくがっこう こうきかてい", "とおかまちこうとうがっこう", "とおかまちそうごうこうとうがっこう", "とちおこうとうがっこう", "ながおかこうとうがっこう", "ながおかおおてこうとうがっこう", "ながおかこうぎょうこうとうがっこう", "ながおかこうりょうこうとうがっこう", "ながおかしょうぎょうこうとうがっこう", "ながおかのうぎょうこうとうがっこう", "ながおかめいとくこうとうがっこう", "にいがたこうとうがっこう", "にいがたきたこうとうがっこう", "にいがたけんおうこうぎょうこうとうがっこう", "にいがたこうぎょうこうとうがっこう", "にいがたこうなんこうとうがっこう", "にいがたこうようこうとうがっこう", "にいがたしょうぎょうこうとうがっこう", "にいがたちゅうおうこうとうがっこう", "にいがたにしこうとうがっこう", "にいがたひがしこうとうがっこう", "にいがたみなみこうとうがっこう", "にいつこうとうがっこう", "にいつこうぎょうこうとうがっこう", "にいつみなみこうとうがっこう", "ぶんすいこうとうがっこう", "とよさかこうとうがっこう", "まきこうとうがっこう", "まきそうごうこうとうがっこう", "みつけこうとうがっこう", "むいかまちこうとうがっこう", "むらかみこうとうがっこう", "むらかみさくらがおかこうとうがっこう", "よしだこうとうがっこう", "にいがたさんぎょうだいがくふぞくこうとうがっこう", "にいがたしりつこうしちゅうとうきょういくがっこう 後期課程", "にいがたしりつばんだいこうとうがっこう", "にいがたしりつめいきょうこうとうがっこう", "にいがたせいしんじょしこうとうがっこう", "にいがたせいりょうこうとうがっこう", "にいがただいいちこうとうがっこう", "にいがためいくんこうとうがっこう", "にいじまがくえんこうとうがっこう", "にしにっぽんたんきだいがくふぞくこうとうがっこう", "にしのみやしりつにしのみやこうとうがっこう", "にしのみやしりつにしのみやひがしこうとうがっこう", "にしやまとがくえんこうとうがっこう", "にしょうがくしゃだいがくふぞくかしわこうとうがっこう", "にちなんがくえんこうとうがっこう", "にっしょうがくえんこうとうがっこう", "にほんこうくうこうとうがっこう", "にほんこうくうこうとうがっこういしかわ", "にほんだいがくならしのこうとうがっこう", "にほんだいがくふじさわこうとうがっこう", "にほんだいがくみしまこうとうがっこう", "にほんだいがくやまがたこうとうがっこう", "にほんぶんりこうとうがっこう", "にほんじょしだいがくふぞくこうとうがっこう", "にほんだいがくこうとうがっこう", "にほんだいがくとうほくこうとうがっこう", "にほんだいがくめいせいこうとうがっこう", "にほんふくしだいがくふぞくこうとうがっこう", "につぽんぶんりだいがくふぞくこうとうがっこう", "にんげんかんきょうだいがくふぞく おかざきこうとうがっこう", "ぬまづちゅうおうこうとうがっこう", "のーとるだむせいしんこうとうがっこう", "のだがくえんこうとうがっこう", "のべおかがくえんこうとうがっこう", "はかたこうとうがっこう", "はかたじょしこうとうがっこう", "はぎこうえんがくいんこうとうがっこう", "はくおうだいがくあしかがこうとうがっこう", "はくほうじょしこうとうがっこう", "はくりょうこうとうがっこう", "はぐろこうとうがっこう", "はちのへこうぎょうだいがくだいいちこうとうがっこう", "はちのへこうぎょうだいがくだいにこうとうがっこう", "はちのへせいうるすらがくいんこうとうがっこう", "はつしばはしもとこうとうがっこう", "はなさきとくはるこうとうがっこう", "はなまきひがしこうとうがっこう", "はままつせいせいこうとうがっこう", "はままつかいせいかんこうとうがっこう", "はままつがくげいこうとうがっこう", "はままつけいようこうとうがっこう", "はままつしりつこうとうがっこう", "はままつにったいこうとうがっこう", "はやともこうとうがっこう", "ひえいざんこうとうがっこう", "ひがしきゅうしゅうりゅうこくこうとうがっこう", "ひがしちくしがくえんこうとうがっこう", "ひがしにっぽんこくさいだいがくふぞくしょうへいこうとうがっこう", "ひがしのこうとうがっこう", "ひがしふくおかこうとうがっこう", "ひかりがおかじょしこうとうがっこう", "ひこねそうごうこうとうがっこう", "ひのでがくえんこうとうがっこう", "ひじやまじょしこうとうがっこう", "せいよぜふがくえんこうとうがっこう", "えいめいこうとうがっこう", "しゅうめいこうとうがっこう", "しゅうめいえいこうこうとうがっこう", "かいせいこうとうがっこう", "さくらがおかこうとうがっこう", "じゆうがおかこうとうがっこう", "あおやまこうとうがっこう", "ひゅうががくいんこうとうがっこう", "ひのもとがくえんこうとうがっこう", "ひばりがおかがくえんこうとうがっこう", "ひびきがくえんこうとうがっこう", "ひめじしりつことがおかこうとうがっこう", "ひめじしりつしかまこうとうがっこう", "ひめじしりつひめじこうとうがっこう", "ひめじじょがくいんこうとうがっこう", "あいおいこうとうがっこう", "あいおいさんぎょうこうとうがっこう", "あかしみなみこうとうがっこう", "あかしこうとうがっこう", "あかしきたこうとうがっこう", "あかししみずこうとうがっこう", "あかしじょうさいこうとうがっこう", "あかしにしこうとうがっこう", "あこうこうとうがっこう", "あしやこうとうがっこう", "あぼしこうとうがっこう", "あまがさきこうとうがっこう", "あまがさきいなぞのこうとうがっこう", "あまがさきおだこうとうがっこう", "あまがさききたこうとうがっこう", "あまがさきこうぎょうこうとうがっこう", "あまがさきにしこうとうがっこう", "ありまこうとうがっこう", "あわじこうとうがっこう", "あわじみはらこうとうがっこう", "いかわだにこうとうがっこう", "いかわだにきたこうとうがっこう", "いくのこうとうがっこう", "いずしこうとうがっこう", "いたみこうとうがっこう", "いたみきたこうとうがっこう", "いたみにしこうとうがっこう", "いながわこうとうがっこう", "おのこうとうがっこう", "おのこうぎょうこうとうがっこう", "かこがわきたこうとうがっこう", "かこがわにしこうとうがっこう", "かこがわひがしこうとうがっこう", "かこがわみなみこうとうがっこう", "かいばらこうとうがっこう", "かすみこうとうがっこう", "かみごおりこうとうがっこう", "かわにしほくりょうこうとうがっこう", "かわにしみどりだいこうとうがっこう", "かわにしめいほうこうとうがっこう", "かんざきこうとうがっこう", "きたすまこうとうがっこう", "こうでらこうとうがっこう", "こうべこうとうがっこう", "こうべきたこうとうがっこう", "こうべこうほくこうとうがっこう", "こうべしょうぎょうこうとうがっこう", "こうべすずらんだいこうとうがっこう", "こうべたかつかこうとうがっこう", "みかげこうとうがっこう", "こくさいこうとうがっこう", "ささやまさんぎょうこうとうがっこう", "ささやまほうめいこうとうがっこう", "さようこうとうがっこう", "しかまこうぎょうこうとうがっこう", "やしろこうとうがっこう", "しょうようこうとうがっこう", "すまともがおかこうとうがっこう", "すまひがしこうとうがっこう", "すもとこうとうがっこう", "すもとじつぎょうこうとうがっこう", "せいうんこうとうがっこう", "せいりょうこうとうがっこう", "ひょうごけんりつだいがくふぞくこうとうがっこう", "たいしこうとうがっこう", "たかさごこうとうがっこう", "たかさごみなみこうとうがっこう", "たからづかこうとうがっこう", "たからづかきたこうとうがっこう", "たからづかにしこうとうがっこう", "たからづかひがしこうとうがっこう", "たじまのうぎょうこうとうがっこう", "たつのこうとうがっこう", "つなこうとうがっこう", "とうばんこうぎょうこうとうがっこう", "とよおかこうとうがっこう", "とよおかそうごうこうとうがっこう", "ながたこうとうがっこう", "なるおこうとうがっこう", "にしのみやこうとうがっこう", "にしのみやいまづこうとうがっこう", "にしのみやきたこうとうがっこう", "にしのみやかぶとやまこうとうがっこう", "にしのみやこうふうこうとうがっこう", "にしのみやみなみこうとうがっこう", "にしわきこうとうがっこう", "にしわきこうぎょうこうとうがっこう", "ひょうごけんりつのうぎょうこうとうがっこう", "はまさかこうとうがっこう", "はりまのうぎょうこうとうがっこう", "はりまみなみこうとうがっこう", "ひがしなだこうとうがっこう", "ひがしはりまこうとうがっこう", "ひかみこうとうがっこう", "ひだかこうとうがっこう", "ひめじきたこうとうがっこう", "ひめじこうぎょうこうとうがっこう", "ひめじしきさいこうとうがっこう", "ひめじしょうぎょうこうとうがっこう", "ひめじにしこうとうがっこう", "ひめじひがしこうとうがっこう", "ひめじべっしょこうとうがっこう", "ひめじみなみこうとうがっこう", "ひょうごこうとうがっこう", "ひょうごこうぎょうこうとうがっこう", "ふくさきこうとうがっこう", "ほうじょうこうとうがっこう", "ほくせつさんだこうとうがっこう", "まいここうとうがっこう", "みきこうとうがっこう", "みききたこうとうがっこう", "みきひがしこうとうがっこう", "さんだしょううんかんこうとうがっこう", "さんだせいりょうこうとうがっこう", "みなとがわこうとうがっこう", "むこのそうそうごうこうとうがっこう", "むらおかこうとうがっこう", "やまざきこうとうがっこう", "ゆめさきこうとうがっこう", "ゆめのだいこうとうがっこう", "ようかこうとうがっこう", "ひらつかがくえんこうとうがっこう", "ひりゅうこうとうがっこう", "ひろさきがくいんせいあいこうとうがっこう", "ひろさきひがしこうとうがっこう", "ひろしまがくいんこうとうがっこう", "あきこうとうがっこう", "あきふちゅうこうとうがっこう", "あきみなみこうとうがっこう", "やすにしこうとうがっこう", "いつかいちこうとうがっこう", "いんのしまこうとうがっこう", "おおたけこうとうがっこう", "おのみちきたこうとうがっこう", "おのみちしょうぎょうこうとうがっこう", "おのみちひがしこうとうがっこう", "おんどこうとうがっこう", "かいたこうとうがっこう", "かべこうとうがっこう", "かもこうとうがっこう", "かんなべこうとうがっこう", "かんなべあさひこうとうがっこう", "ぎおんきたこうとうがっこう", "くまのこうとうがっこう", "くれこうぎょうこうとうがっこう", "くれしょうぎょうこうとうがっこう", "くれしょうわこうとうがっこう", "くれみつたこうとうがっこう", "くれみやはらこうとうがっこう", "くろせこうとうがっこう", "こうようこうとうがっこう", "こうようひがしこうとうがっこう", "さいじょうしすいこうとうがっこう", "さいじょうのうぎょうこうとうがっこう", "みよしこうとうがっこう", "みよしせいりょうこうとうがっこう", "しょうばらかくちこうとうがっこう", "しょうばらじつぎょうこうとうがっこう", "せらこうとうがっこう", "そうごうぎじゅつこうとうがっこう", "だいもんこうとうがっこう", "たけはらこうとうがっこう", "ただのうみこうとうがっこう", "とでこうとうがっこう", "にしこうとうがっこう", "にっしょうかんこうとうがっこう", "はつかいちこうとうがっこう", "はつかいちにしこうとうがっこう", "ひがしこうとうがっこう", "ひろこうとうがっこう", "ひろしまこうとうがっこう", "ひろしまいのくちこうとうがっこう", "ひろしまかんおんこうとうがっこう", "ひろしまこうぎょうこうとうがっこう", "ひろしまこくたいじこうとうがっこう", "ひろしましょうぎょうこうとうがっこう", "ひろしまみなみこうとうがっこう", "ふくやまいようこうとうがっこう", "ふくやまこうぎょうこうとうがっこう", "ふくやましょうぎょうこうとうがっこう", "ふくやませいしかんこうとうがっこう", "ふくやまみょうおうだいこうとうがっこう", "ふちゅうこうとうがっこう", "ふちゅうひがしこうとうがっこう", "まつながこうとうがっこう", "みつぎこうとうがっこう", "みはらこうとうがっこう", "みはらひがしこうとうがっこう", "みやじまこうぎょうこうとうがっこう", "やすふるいちこうとうがっこう", "よしだこうとうがっこう", "ひろしまこくさいがくいんこうとうがっこう", "ひろしまさんいくがくいんこうとうがっこう", "さんようこうとうがっこう", "ひろしまじょうほくこうとうがっこう", "ひろしまじょがくいんちゅうがくこうとうがっこう", "ひろしましりつおおてまちしょうぎょうこうとうがっこう", "ひろしましりつぬまたこうとうがっこう", "ひろしましりつひろしまこうぎょうこうとうがっこう", "ひろしましりつひろしましょうぎょうこうとうがっこう", "ひろしましりつふないりこうとうがっこう", "ひろしましりつみすずがおかこうとうがっこう", "ひろしましりつもとまちこうとうがっこう", "ひろしましょうようこうとうがっこう", "ひろしましんじょうこうとうがっこう", "ひろしまだいがくふぞくこうとうがっこう", "ひろしまだいがくふぞくふくやまこうとうがっこう", "ひろしまなぎさこうとうがっこう", "こうがくかんこうとうがっこう", "ふぇりすじょがくいんこうとうがっこう", "あすわこうとうがっこう", "うすいこうとうがっこう", "おおのこうとうがっこう", "おくえつめいせいこうとうがっこう", "かがくぎじゅつこうとうがっこう", "かつやまこうとうがっこう", "かなづこうとうがっこう", "こしこうとうがっこう", "さばえこうとうがっこう", "たけふこうとうがっこう", "たけふひがしこうとうがっこう", "つるがこうとうがっこう", "つるがこうぎょうこうとうがっこう", "ふくいしょうぎょうこうとうがっこう", "ふくいのうりんこうとうがっこう", "ふじしまこうとうがっこう", "まるおかこうとうがっこう", "みかたこうとうがっこう", "みくにこうとうがっこう", "わかさこうとうがっこう", "ふくいこうぎょうだいがくふぞくふくいこうとうがっこう", "ふくいみなみこうとうがっこう", "こがきょうせいかんこうとうがっこう", "みいちゅうおうこうとうがっこう", "めいぜんこうとうがっこう", "あさくらこうとうがっこう", "あさくらこうようこうとうがっこう", "あさくらひがしこうとうがっこう", "ありあけしんせいこうとうがっこう", "いくとくかんこうとうがっこう", "いとしまこうとうがっこう", "いとしまのうぎょうこうとうがっこう", "いなつきしこうかんこうとうがっこう", "うきはきゅうしんかんこうとうがっこう", "うきはこうぎょうこうとうがっこう", "うみしょうぎょうこうとうがっこう", "おおかわしょうふうこうとうがっこう", "おおむたきたこうとうがっこう", "こくらこうとうがっこう", "こくらこうぎょうこうとうがっこう", "こくらしょうぎょうこうとうがっこう", "こくらにしこうとうがっこう", "おごおりこうとうがっこう", "おりおこうとうがっこう", "おんがこうとうがっこう", "かしいこうとうがっこう", "かしいこうぎょうこうとうがっこう", "かすがこうとうがっこう", "かすみがおかこうとうがっこう", "かほこうとうがっこう", "かほそうごうこうとうがっこう", "かほひがしこうとうがっこう", "かんだこうぎょうこうとうがっこう", "きたきゅうしゅうこうとうがっこう", "みやここうとうがっこう", "くらてこうとうがっこう", "くるめこうとうがっこう", "くるめちくすいこうとうがっこう", "げんかいこうとうがっこう", "げんようこうとうがっこう", "こうりょうこうとうがっこう", "こくらひがしこうとうがっこう", "こくらみなみこうとうがっこう", "さわらこうとうがっこう", "しゅうゆうかんこうとうがっこう", "しんぐうこうとうがっこう", "すいさんこうとうがっこう", "すえこうとうがっこう", "せいほうこうとうがっこう", "じょうなんこうとうがっこう", "たがわこうとうがっこう", "だざいふこうとうがっこう", "ちくしがおかこうとうがっこう", "ちくじょうにしこうとうがっこう", "ちくぜんこうとうがっこう", "ちくほうこうとうがっこう", "ちくしこうとうがっこう", "ちくしちゅうおうこうとうがっこう", "でんしゅうかんこうとうがっこう", "とうちくこうとうがっこう", "とうようこうとうがっこう", "とばたこうとうがっこう", "とばたこうぎょうこうとうがっこう", "なかまこうとうがっこう", "にしたがわこうとうがっこう", "のおがたこうとうがっこう", "はかたせいしょうこうとうがっこうつうしんせい", "はくりょうこうとうがっこう", "ひびきこうとうがっこう", "ふくおかこうとうがっこう", "ふくおかかいせいこうとうがっこう", "ふくおかけんりつふくおかこうぎょうこうとうがっこう", "ふくおかこうりんかんこうとうがっこう", "ふくおかちゅうおうこうとうがっこう", "ふくおかのうぎょうこうとうがっこう", "ふくしまこうとうがっこう", "ほくちくこうとうがっこう", "みいけこうとうがっこう", "みいけこうぎょうこうとうがっこう", "みずまこうとうがっこう", "むさしだいこうとうがっこう", "むなかたこうとうがっこう", "もじがくえんこうとうがっこう", "もじだいしょうかんこうとうがっこう", "やまとこうとうがっこう", "やめこうとうがっこう", "やめこうぎょうこうとうがっこう", "やめのうぎょうこうとうがっこう", "やはたこうとうがっこう", "やはたちゅうおうこうとうがっこう", "やはたみなみこうとうがっこう", "ゆくはしこうとうがっこう", "わかまつこうとうがっこう", "わかまつしょうぎょうこうとうがっこう", "ふくおかこうぎょうだいがくふぞくじょうとうこうとうがっこう", "ふくおかじょがくいんこうとうがっこう", "ふくおかしりつはかたこうぎょうこうとうがっこう", "ふくおかしりつふくおかじょしこうとうがっこう", "ふくおかしりつふくおかせいりょうこうとうがっこう", "ふくおかしりつふくしょうこうとうがっこう", "ふくおかだいいちこうとうがっこう", "ふくおかだいがくふぞくおおほりこうとうがっこう", "ふくおかだいがくふぞくわかばこうとうがっこう", "ふくおかじょうようこうとうがっこう", "ふくおかかいせいじょしがくいんこうとうがっこう", "ふくおかふたばこうとうがっこう", "ふくおかまいづるこうとうがっこう", "ふくしまけんいわきだいいちこうとうがっこう", "あおいこうとうがっこう", "たむらこうとうがっこう", "はらまちこうとうがっこう", "あいづこうとうがっこう", "あいづがくほうこうとうがっこう", "あいづこうぎょうこうとうがっこう", "あさかこうとうがっこう", "あさかかいせいこうとうがっこう", "あだちこうとうがっこう", "あさかれいめいこうとうがっこう", "いしかわこうとうがっこう", "いわきこうとうがっこう", "いわきこうようこうとうがっこう", "いわきさくらがおかこうとうがっこう", "いわきそうごうこうとうがっこう", "いわきのうぎょうこうとうがっこう", "いわきかいせいこうとうがっこう", "いわきみどりのもりこうとうがっこう", "いわせのうぎょうこうとうがっこう", "おなはまこうとうがっこう", "きたかたこうとうがっこう", "こうなんこうとうがっこう", "こおりやまこうとうがっこう", "こおりやまきたこうぎょうこうとうがっこう", "こおりやましょうぎょうこうとうがっこう", "こおりやまひがしこうとうがっこう", "こおりやまほうせいこうとうがっこうつうしんせい", "こなんこうとうがっこう", "しらかわこうとうがっこう", "しらかわあさひこうとうがっこう", "しらかわじつぎょうこうとうがっこう", "すかがわとうようこうとうがっこう", "せいりょうじょうほうこうとうがっこう", "そうまこうとうがっこう", "そうまひがしこうとうがっこう", "たいらこうぎょうこうとうがっこう", "たいらしょうぎょうこうとうがっこう", "ただみこうとうがっこう", "たちばなこうとうがっこう", "なこそこうぎょうこうとうがっこう", "にほんまつこうぎょうこうとうがっこう", "しゅうめいこうとうがっこう", "ふくしまこうとうがっこう", "ふくしまきたこうとうがっこう", "ふくしまこうぎょうこうとうがっこう", "ふくしましょうぎょうこうとうがっこう", "ふくしまにしこうとうがっこう", "ふくしまひがしこうとうがっこう", "ふくしまみなみこうとうがっこう", "ふくしまめいせいこうとうがっこう", "ふねひきこうとうがっこう", "ほばらこうとうがっこう", "みなみあいづこうとうがっこう", "もとみやこうとうがっこう", "ゆもとこうとうがっこう", "わかまつしょうぎょうこうとうがっこう", "ふくしませいけいこうとうがっこう", "ふくしまとうりょうこうとうがっこう", "ふくとくがくいんこうとうがっこう", "ふくやまあけのほしじょしこうとうがっこう", "ふくやましりつふくやまこうとうがっこう", "ふじいがくえんさんがわこうとうがっこう", "ふじえだじゅんしんこうとうがっこう", "ふじえだめいせいこうとうがっこう", "ふじがくえんこうとうがっこう", "ふじこしこうぎょうこうとうがっこう", "ふじさわしょうりょうこうとうがっこう", "ふじじょしこうとうがっこう", "ふじしりつこうとうがっこう", "ふじせいしんじょしがくいんこうとうがっこう", "ふじのはなじょしこうとうがっこう", "ぶそうこうとうがっこう", "ふなばししりつふなばしこうとうがっこう", "ぶなんこうとうがっこう", "ぶんとくこうとうがっこう", "ふるかわがくえんこうとうがっこう", "ぶんかがくえんながのこうとうがっこう", "ぶんせいげいじゅつだいがくふぞくこうとうがっこう", "べっぷみぞべがくえんこうとうがっこう", "ほうおうこうとうがっこう", "ほうこくがくえんこうとうがっこう", "ほうしょうこうとうがっこう", "ほうせいだいがくこくさいこうとうがっこう", "ほうせいだいがくだいにこうとうがっこう", "ほうとくがくえんこうとうがっこう", "ほくえつこうとうがっこう", "ほくとしりつこうりょうこうとうがっこう", "ほくりくがくいんこうとうがっこう", "ほくりくこうとうがっこう", "ほくりょうこうとうがっこう", "ほしのこうとうがっこう", "ほそだがくえんこうとうがっこう", "ほまれこうとうがっこう", "ほんじょうだいいちこうとうがっこう", "ほんじょうひがしこうとうがっこう", "まえばしいくえいこうとうがっこう", "まえばししりつまえばしこうとうがっこう", "せいけいこうとうがっこう", "しんわこうとうがっこう", "ますだながしまがくえんめいせいこうとうがっこう", "まつえしりつ みなみがおかじょしこうとうがっこう", "まつしょうがくえんこうとうがっこう", "まつどしりつまつどこうとうがっこう", "まつもとだいいちこうとうがっこう", "まつやましののめこうとうがっこう", "まつやませいりょうこうとうがっこう", "まつやまじょうなんこうとうがっこう", "みうらがくえんこうとうがっこう", "みえこうとうがっこう", "あけのこうとうがっこう", "あけぼのがくえんこうとうがっこう", "いいなんこうとうがっこう", "いいのこうとうがっこう", "いがはくほうこうとうがっこう", "いしやくしこうとうがっこう", "いせこうとうがっこう", "いせこうぎょうこうとうがっこう", "いせまなびこうとうがっこう", "いなべそうごうがくえんこうとうがっこう", "いのうこうとうがっこう", "うえのこうとうがっこう", "うじやまだこうとうがっこう", "うじやまだしょうぎょうこうとうがっこう", "おうかこうとうがっこう", "おわせこうとうがっこう", "かめやまこうとうがっこう", "かわごえこうとうがっこう", "きなんこうとうがっこう", "くわなこうとうがっこう", "くわなきたこうとうがっこう", "くわなこうぎょうこうとうがっこう", "くわなにしこうとうがっこう", "かんべこうとうがっこう", "きのもとこうとうがっこう", "こものこうとうがっこう", "しまこうとうがっこう", "しろここうとうがっこう", "すばるがくえんこうとうがっこう", "つこうとうがっこう", "つこうぎょうこうとうがっこう", "つしょうぎょうこうとうがっこう", "つにしこうとうがっこう", "つひがしこうとうがっこう", "とばこうとうがっこう", "あさけこうとうがっこう", "なばりこうとうがっこう", "なばりせいほうこうとうがっこう", "はくさんこうとうがっこう", "ひさいこうとうがっこう", "ひさいのうりんこうとうがっこう", "ほくせいこうとうがっこう", "まつさかこうとうがっこう", "まつさかこうぎょうこうとうがっこう", "まつさかしょうぎょうこうとうがっこう", "みえゆめがくえんこうとうがっこう", "よっかいちこうとうがっこう", "よっかいちこうぎょうこうとうがっこう", "よっかいちしょうぎょうこうとうがっこう", "よっかいちちゅうおうこうぎょうこうとうがっこう", "よっかいちにしこうとうがっこう", "よっかいちのうげいこうとうがっこう", "よっかいちみなみこうとうがっこう", "よっかいちよごうこうとうがっこう", "ちとくこうとうがっこう", "すいじょうこうとうがっこう", "いずもほくりょうこうとうがっこう", "みそのじょがくいんこうとうがっこう", "さんだがくえんこうとうがっこう", "さんだしょうせいこうとうがっこう", "みときりょうこうとうがっこう", "みとじょしこうとうがっこう", "みとけいめいこうとうがっこう", "みどりがおかじょしこうとうがっこう", "なんざんこくさいこうとうがっこう", "なんざんこうとうがっこうじょしぶ", "なんざんこうとうがっこうだんしぶ", "みのかもこうとうがっこう", "みはぎのじょしこうとうがっこう", "みやぎがくいんこうとうがっこう", "いしのまきこうとうがっこう", "けんいしのまききたこうとうがっこう", "けんいしのまきこうぎょうこうとうがっこう", "いしのまきこうぶんかんこうとうがっこう", "いしのまきしょうぎょうこうとうがっこう", "いしのまきにしこうとうがっこう", "いずみこうとうがっこう", "いずみしょうりょうこうとうがっこう", "いずみたてやまこうとうがっこう", "とめそうごうさんぎょうこうとうがっこう", "おおがわらしょうぎょうこうとうがっこう", "くろかわこうとうがっこう", "けせんぬまこうとうがっこう", "けんけせんぬまこうようこうとうがっこう", "みやぎけんこうぎょうこうとうがっこう", "けんこごたのうりんこうとうがっこう", "さぬまこうとうがっこう", "しおがまこうとうがっこう", "しばたこうとうがっこう", "しばたのうりんこうとうがっこう", "しろいしこうとうがっこう", "けんしろいしこうぎょうこうとうがっこう", "かくだこうとうがっこう", "せんだいさんおうこうとうがっこう", "せんだいだいいちこうとうがっこう", "せんだいだいさんこうとうがっこう", "せんだいだいにこうとうがっこう", "せんだいにしこうとうがっこう", "せんだいひがしこうとうがっこう", "けんせんだいにかこうとうがっこう", "せんだいみなみこうとうがっこう", "けんせんだいむかいやまこうとうがっこう", "たがじょうこうとうがっこう", "つきだてこうとうがっこう", "ていざんこうとうがっこう", "けんとみやこうとうがっこう", "とめこうとうがっこう", "けんなかにいだこうとうがっこう", "なとりこうとうがっこう", "けんなとりきたこうとうがっこう", "みやぎけんのうぎょうこうとうがっこう", "はくおうこうとうがっこう", "ひがしまつしまこうとうがっこう", "ふるかわこうとうがっこう", "ふるかわこうぎょうこうとうがっこう", "ふるかわれいめいこうとうがっこう", "まつしまこうとうがっこう", "みやぎだいいちこうとうがっこう", "みやぎのこうとうがっこう", "みやぎひろせこうとうがっこう", "むらたこうとうがっこう", "けんもとよしひびきこうとうがっこう", "りふこうとうがっこう", "わくやこうとうがっこう", "けんわたりこうとうがっこう", "みやこのじょうこうとうがっこう", "みやこのじょうせいどみにこがくえんこうとうがっこう", "みやざきがくえんこうとうがっこう", "かどがわこうとうがっこう", "こばやしこうとうがっこう", "こばやししゅうほうこうとうがっこう", "さどわらこうとうがっこう", "たかじょうこうとうがっこう", "たかなべこうとうがっこう", "たかなべのうぎょうこうとうがっこう", "つまこうとうがっこう", "とみしまこうとうがっこう", "にちなんこうとうがっこう", "にちなんしんとくこうとうがっこう", "のべおかこうとうがっこう", "のべおかこうぎょうこうとうがっこう", "のべおかしょうぎょうこうとうがっこう", "のべおかせいうんこうとうがっこう", "ひゅうがこうとうがっこう", "ひゅうがこうぎょうこうとうがっこう", "ほんじょうこうとうがっこう", "みやこのじょういずみがおかこうとうがっこう", "みやこのじょうこうぎょうこうとうがっこう", "みやこのじょうしょうぎょうこうとうがっこう", "みやこのじょうにしこうとうがっこう", "みやこのじょうのうぎょうこうとうがっこう", "みやざきおおみやこうとうがっこう", "みやざきかいようこうとうがっこう", "みやざききたこうとうがっこう", "みやざきこうぎょうこうとうがっこう", "みやざきしょうぎょうこうとうがっこう", "みやざきにしこうとうがっこう", "みやざきのうぎょうこうとうがっこう", "みやざきひがしこうとうがっこう", "みやざきみなみこうとうがっこう", "みやざきだいいちこうとうがっこう", "みやざきにほんだいがくこうとうがっこう", "むこがわじょしだいがくふぞくこうとうがっこう", "むさしおごせこうとうがっこう", "むさしのおんがくだいがくふぞくこうとうがっこう", "むさしのせいじょうこうとうがっこう", "めいおうこうとうがっこう", "めいけいがくえんこうとうがっこう", "めいこうがくえんこうとうがっこう", "めいじがくえんちゅうがくこうとうがっこう", "めいじょうだいがくふぞくこうとうがっこう", "めいせいがくいんこうとうがっこう", "めいほうこうとうがっこう", "めいわけんおうこうとうがっこう", "よっかいちめりのーるがくいん", "もばらほくりょうこうとうがっこう", "もりおかせいおうこうとうがっこう", "もりおかしらゆりがくえんこうとうがっこう", "もりおかしりつこうとうがっこう", "もりおかすこーれこうとうがっこう", "もりおかだいがくふぞくこうとうがっこう", "もりおかちゅうおうこうとうがっこう", "もりむらがくえんこうとうぶ", "やいたちゅうおうこうとうがっこう", "やいづこうとうがっこう", "やくしまおおぞらこうとうがっこう", "やすだじょしこうとうがっこう", "とっとりじょうほくこうとうがっこう", "やちよしょういんこうとうがっこう", "やつしろしらゆりがくえんこうとうがっこう", "あいちれいめいこうとうがっこう", "やないがくえんこうとうがっこう", "やながわこうとうがっこう", "そうかいこうとうがっこう", "やまがたがくいんこうとうがっこう", "あてらざわこうとうがっこう", "おきたまのうぎょうこうとうがっこう", "かじょうがくえんこうとうがっこう", "かみのやまめいしんかんこうとうがっこう", "きたむらやまこうとうがっこう", "さがえこうとうがっこう", "さがえこうぎょうこうとうがっこう", "さかたにしこうとうがっこう", "さかたひがしこうとうがっこう", "しょうないそうごうこうとうがっこう", "しょうないのうぎょうこうとうがっこう", "しんじょうかむろさんぎょうこうとうがっこう", "しんじょうきたこうとうがっこう", "しんじょうみなみこうとうがっこう", "つるおかきたこうとうがっこう", "つるおかこうぎょうこうとうがっこう", "つるおかちゅうおうこうとうがっこう", "つるおかみなみこうとうがっこう", "てんどうこうとうがっこう", "ながいこうとうがっこう", "なんようこうとうがっこう", "やちこうとうがっこう", "やまがたきたこうとうがっこう", "やまがたこうぎょうこうとうがっこう", "やまがたちゅうおうこうとうがっこう", "やまがたにしこうとうがっこう", "やまがたひがしこうとうがっこう", "やまがたみなみこうとうがっこう", "やまのべこうとうがっこう", "ゆざこうとうがっこう", "よねざわこうぎょうこうとうがっこう", "よねざわこうじょうかんこうとうがっこう", "よねざわしょうぎょうこうとうがっこう", "よねざわひがしこうとうがっこう", "やまがたじょうほくこうとうがっこう", "やまがたしりつしょうぎょうこうとうがっこう", "そうがくかんこうとうがっこう", "やまぐちけんこうじょうこうとうがっこう", "やまぐちけんさくらがおかこうとうがっこう", "みねせいりょうこうとうがっこう", "あさこうとうがっこう", "いわくにこうとうがっこう", "いわくにしょうぎょうこうとうがっこう", "いわくにそうごうこうとうがっこう", "うべこうとうがっこう", "うべこうぎょうこうとうがっこう", "うべしょうぎょうこうとうがっこう", "うべちゅうおうこうとうがっこう", "うべにしこうとうがっこう", "おのだこうとうがっこう", "おのだこうぎょうこうとうがっこう", "かりょうこうとうがっこう", "くだまつこうとうがっこう", "くだまつこうぎょうこうとうがっこう", "くまげきたこうとうがっこう", "くまげみなみこうとうがっこう", "しものせきこうかこうとうがっこう", "しものせきにしこうとうがっこう", "しものせきみなみこうとうがっこう", "しんなんようこうとうがっこう", "たかもりこうとうがっこう", "たぶせのうこうこうとうがっこう", "ちょうふこうとうがっこう", "とくやまこうとうがっこう", "とくやましょうこうこうとうがっこう", "とよらこうとうがっこう", "なんようこうぎょうこうとうがっこう", "さいきょうこうとうがっこう", "はぎこうとうがっこう", "ひかりこうとうがっこう", "ひかりがおかこうとうがっこう", "ほうふこうとうがっこう", "ほうふしょうこうこうとうがっこう", "ほうふにしこうとうがっこう", "やないこうとうがっこう", "やまぐちこうとうがっこう", "やまぐちちゅうおうこうとうがっこう", "やまぐちのうぎょうこうとうがっこう", "やまてがくいんこうとうがっこう", "やまとせいらんこうとうがっこう", "やまとたかだしりつたかだしょうぎょうこうとうがっこう", "やまなしがくいんこうとうがっこう", "えんざんこうとうがっこう", "こうふこうぎょうこうとうがっこう", "こうふじょうさいこうとうがっこう", "こうふしょうわこうとうがっこう", "こうふだいいちこうとうがっこう", "こうふにしこうとうがっこう", "こうふひがしこうとうがっこう", "こうふみなみこうとうがっこう", "こまこうとうがっこう", "しらねこうとうがっこう", "ちゅうおうこうとうがっこう", "つるこうとうがっこう", "ひかわこうとうがっこう", "にらさきこうとうがっこう", "にらさきこうぎょうこうとうがっこう", "のうりんこうとうがっこう", "ふえふきこうとうがっこう", "ふじかわぐちここうとうがっこう", "ふじほくりょうこうとうがっこう", "ほくとこうとうがっこう", "みのぶこうとうがっこう", "やまなしこうとうがっこう", "よしだこうとうがっこう", "やまなしえいわこうとうがっこう", "やまもとがくえんこうとうがっこう", "やめがくいんこうとうがっこう", "ゆうがっかんこうとうがっこう", "ゆうしこくさいこうとうがっこう", "ゆうせいこうとうがっこう", "ゆりがくいんこうとうがっこう", "ゆりはまがくえんこうとうがっこう", "ようしかんこうとうがっこう", "よこしばけいあいこうとうがっこう", "よこすかがくいんこうとうがっこう", "よこすかしりつよこすかそうごうこうとうがっこう", "よこはまこうとうがっこう", "あおやまがくいんよこはまえいわこうとうがっこう", "よこはまがくえんこうとうがっこう", "よこはまきょうりつがくえんこうとうがっこう", "よこはますいりょうこうとうがっこう", "よこはましょうかだいがくこうとうがっこう", "よこはまじょがくいんこうとうがっこう", "よこはましりつかなざわこうとうがっこう", "よこはましりつさくらがおかこうとうがっこう", "よこはましりつとつかこうとうがっこう", "よこはましりつひがしこうとうがっこう", "よこはましりつみなとそうごうこうとうがっこう", "よこはましりつみなみこうとうがっこう", "よこはましりつよこはまさいえんすふろんてぃあこうとうがっこう", "よこはましりつよこはましょうぎょうこうとうがっこう", "よこはましりつよこはまそうごうこうとうがっこう", "よこはませいふうこうとうがっこう", "よこはまそうえいこうとうがっこう", "よこはまそうがくかんこうとうがっこう", "よこはまはやとこうとうがっこう", "よこはまふたばこうとうがっこう", "よなごきたこうとうがっこう", "よなごしょういんこうとうがっこう", "よねざわちゅうおうこうとうがっこう", "らさーるこうとうがっこう", "たちばなこうとうがっこう", "りっきょうにいざこうとうがっこう", "りつめいかんもりやまこうとうがっこう", "りゅうこくとやまこうとうがっこう", "りゅうつうけいざいだいがくふぞくかしわこうとうがっこう", "るーてるがくいんこうとうがっこう", "るねさんすこうとうがっこう", "れいたくこうとうがっこう", "れいたくみずなみこうとうがっこう", "れいめいこうとうがっこう", "ろっこうがくいんこうとうがっこう", "あいづほくれいこうとうがっこう", "ありだちゅうおうこうとうがっこう", "かいなんこうとうがっこう かいなんこうしゃ", "かせだこうとうがっこう", "かしまこうとうがっこう", "きおうかんこうとうがっこう", "きしがわこうとうがっこう", "くまのこうとうがっこう", "こうようこうとうがっこう", "こかわこうとうがっこう", "しんぐうこうとうがっこう", "せいりんこうとうがっこう", "たいきゅうこうとうがっこう", "たなべこうとうがっこう", "たなべこうぎょうこうとうがっこう", "とういんこうとうがっこう", "なかこうとうがっこう", "みなべこうとうがっこう", "はしもとこうとうがっこう", "ひだかこうとうがっこう", "みのしまこうとうがっこう", "わかやまこうとうがっこう", "わかやまにしこうとうがっこう きたこうしゃ", "わかやまこうぎょうこうとうがっこう", "わかやましょうぎょうこうとうがっこう", "わかやまひがしこうとうがっこう", "わかやましりつわかやまこうとうがっこう", "わかやましんあいこうとうがっこう", "わせがくこうとうがっこう", "わせだじつぎょうがっこう", "わせださがこうとうがっこう", "わせだだいがくほんじょうこうとうがくいん", "わようこうのだいじょしこうとうがっこう", "おかやまあさひこうとうがっこう", "ときわこうとうがっこう", "しみずみなみこうとうがっこう", "はままつにしこうとうがっこう", "かいせいこうとうがっこう", "さいびこうとうがっこう", "さくらおかこうとうがっこう", "いちかわこうとうがっこう", "じょうほくこうとうがっこう", "せいこうがくいんこうとうがっこう", "たいせいこうとうがっこう"]
;
Map highschool_map=
{

"静清高等学校": {
"読み方": "せいせいこうとうがっこう",
"所在位置": "静岡県"
},
"愛国学園大学附属四街道高等学校": {
"読み方": "あいこくがくえんだいがくふぞくよつかいどうこうとうがっこう",
"所在位置": "千葉県"
},
"愛国学園大学附属龍ヶ崎高等学校": {
"読み方": "あいこくがくえんだいがくふぞくりゅうがさきこうとうがっこう",
"所在位置": "茨城県"
},
"愛知高等学校": {
"読み方": "えちこうとうがっこう",
"所在位置": "滋賀県"
},
"愛知教育大学附属高等学校": {
"読み方": "あいちきょういくだいがくふぞくこうとうがっこう",
"所在位置": "愛知県"
},
"愛知啓成高等学校": {
"読み方": "あいちけいせいこうとうがっこう",
"所在位置": "愛知県"
},
"愛知商業高等学校": {
"読み方": "あいちしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"阿久比高等学校": {
"読み方": "あぐいこうとうがっこう",
"所在位置": "愛知県"
},
"旭丘高等学校": {
"読み方": "あさひがおかこうとうがっこう",
"所在位置": "神奈川県"
},
"旭野高等学校": {
"読み方": "あさひのこうとうがっこう",
"所在位置": "愛知県"
},
"足助高等学校": {
"読み方": "あすけこうとうがっこう",
"所在位置": "愛知県"
},
"熱田高等学校": {
"読み方": "あつたこうとうがっこう",
"所在位置": "愛知県"
},
"渥美農業高等学校": {
"読み方": "あつみのうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"安城高等学校": {
"読み方": "あんじょうこうとうがっこう",
"所在位置": "愛知県"
},
"安城農林高等学校": {
"読み方": "あんじょうのうりんこうとうがっこう",
"所在位置": "愛知県"
},
"安城東高等学校": {
"読み方": "あんじょうひがしこうとうがっこう",
"所在位置": "愛知県"
},
"安城南高等学校": {
"読み方": "あんじょうみなみこうとうがっこう",
"所在位置": "愛知県"
},
"惟信高等学校": {
"読み方": "いしんこうとうがっこう",
"所在位置": "愛知県"
},
"一宮高等学校": {
"読み方": "いちのみやこうとうがっこう",
"所在位置": "愛知県"
},
"一宮北高等学校": {
"読み方": "いちのみやきたこうとうがっこう",
"所在位置": "愛知県"
},
"一宮工科高等学校": {
"読み方": "いちのみやこうかこうとうがっこう",
"所在位置": "愛知県"
},
"一宮興道高等学校": {
"読み方": "いちのみやこうどうこうとうがっこう",
"所在位置": "愛知県"
},
"一宮商業高等学校": {
"読み方": "いちのみやしょうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"一宮西高等学校": {
"読み方": "いちのみやにしこうとうがっこう",
"所在位置": "愛知県"
},
"一宮南高等学校": {
"読み方": "いちのみやみなみこうとうがっこう",
"所在位置": "愛知県"
},
"一色高等学校": {
"読み方": "いっしきこうとうがっこう",
"所在位置": "愛知県"
},
"稲沢高等学校": {
"読み方": "いなざわこうとうがっこう",
"所在位置": "愛知県"
},
"稲沢東高等学校": {
"読み方": "いなざわひがしこうとうがっこう",
"所在位置": "愛知県"
},
"犬山高等学校": {
"読み方": "いぬやまこうとうがっこう",
"所在位置": "愛知県"
},
"犬山南高等学校": {
"読み方": "いぬやまみなみこうとうがっこう",
"所在位置": "愛知県"
},
"岩倉総合高等学校": {
"読み方": "いわくらそうごうこうとうがっこう",
"所在位置": "愛知県"
},
"岩津高等学校": {
"読み方": "いわづこうとうがっこう",
"所在位置": "愛知県"
},
"内海高等学校": {
"読み方": "うつみこうとうがっこう",
"所在位置": "愛知県"
},
"海翔高等学校": {
"読み方": "かいしょうこうとうがっこう",
"所在位置": "愛知県"
},
"大府高等学校": {
"読み方": "おおぶこうとうがっこう",
"所在位置": "愛知県"
},
"大府東高等学校": {
"読み方": "おおぶひがしこうとうがっこう",
"所在位置": "愛知県"
},
"岡崎高等学校": {
"読み方": "おかざきこうとうがっこう",
"所在位置": "愛知県"
},
"岡崎北高等学校": {
"読み方": "おかざききたこうとうがっこう",
"所在位置": "愛知県"
},
"岡崎工科高等学校": {
"読み方": "おかざきこうかこうとうがっこう",
"所在位置": "愛知県"
},
"岡崎商業高等学校": {
"読み方": "おかざきしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"岡崎西高等学校": {
"読み方": "おかざきにしこうとうがっこう",
"所在位置": "愛知県"
},
"岡崎東高等学校": {
"読み方": "おかざきひがしこうとうがっこう",
"所在位置": "愛知県"
},
"鶴城丘高等学校": {
"読み方": "かくじょうがおかこうとうがっこう",
"所在位置": "愛知県"
},
"春日井高等学校": {
"読み方": "かすがいこうとうがっこう",
"所在位置": "愛知県"
},
"春日井工科高等学校": {
"読み方": "かすがいこうかこうとうがっこう",
"所在位置": "愛知県"
},
"春日井商業高等学校": {
"読み方": "かすがいしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"春日井西高等学校": {
"読み方": "かすがいにしこうとうがっこう",
"所在位置": "愛知県"
},
"春日井東高等学校": {
"読み方": "かすがいひがしこうとうがっこう",
"所在位置": "愛知県"
},
"春日井南高等学校": {
"読み方": "かすがいみなみこうとうがっこう",
"所在位置": "愛知県"
},
"蒲郡高等学校": {
"読み方": "がまごおりこうとうがっこう",
"所在位置": "愛知県"
},
"蒲郡東高等学校": {
"読み方": "がまごおりひがしこうとうがっこう",
"所在位置": "愛知県"
},
"加茂丘高等学校": {
"読み方": "かもがおかこうとうがっこう",
"所在位置": "愛知県"
},
"刈谷高等学校": {
"読み方": "かりやこうとうがっこう",
"所在位置": "愛知県"
},
"刈谷北高等学校": {
"読み方": "かりやきたこうとうがっこう",
"所在位置": "愛知県"
},
"刈谷工科高等学校": {
"読み方": "かりやこうかこうとうがっこう",
"所在位置": "愛知県"
},
"刈谷東高等学校": {
"読み方": "かりやひがしこうとうがっこう",
"所在位置": "愛知県"
},
"一宮起工科高等学校": {
"読み方": "いちのみやおこしこうかこうとうがっこう",
"所在位置": "愛知県"
},
"木曽川高等学校": {
"読み方": "きそがわこうとうがっこう",
"所在位置": "愛知県"
},
"杏和高等学校": {
"読み方": "きょうわこうとうがっこう",
"所在位置": "愛知県"
},
"旭陵高等学校": {
"読み方": "きょくりょうこうとうがっこう",
"所在位置": "愛知県"
},
"吉良高等学校": {
"読み方": "きらこうとうがっこう",
"所在位置": "愛知県"
},
"高蔵寺高等学校": {
"読み方": "こうぞうじこうとうがっこう",
"所在位置": "愛知県"
},
"幸田高等学校": {
"読み方": "こうたこうとうがっこう",
"所在位置": "愛知県"
},
"江南高等学校": {
"読み方": "こうなんこうとうがっこう",
"所在位置": "愛知県"
},
"国府高等学校": {
"読み方": "こうこうとうがっこう",
"所在位置": "愛知県"
},
"小坂井高等学校": {
"読み方": "こざかいこうとうがっこう",
"所在位置": "愛知県"
},
"五条高等学校": {
"読み方": "ごじょうこうとうがっこう",
"所在位置": "愛知県"
},
"古知野高等学校": {
"読み方": "こちのこうとうがっこう",
"所在位置": "愛知県"
},
"小牧高等学校": {
"読み方": "こまきこうとうがっこう",
"所在位置": "愛知県"
},
"小牧工業高等学校": {
"読み方": "こまきこうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"小牧南高等学校": {
"読み方": "こまきみなみこうとうがっこう",
"所在位置": "愛知県"
},
"衣台高等学校": {
"読み方": "ころもだいこうとうがっこう",
"所在位置": "愛知県"
},
"愛西工科高等学校": {
"読み方": "あいさいこうかこうとうがっこう",
"所在位置": "愛知県"
},
"猿投農林高等学校": {
"読み方": "さなげのうりんこうとうがっこう",
"所在位置": "愛知県"
},
"佐屋高等学校": {
"読み方": "さやこうとうがっこう",
"所在位置": "愛知県"
},
"時習館高等学校": {
"読み方": "じしゅうかんこうとうがっこう",
"所在位置": "愛知県"
},
"昭和高等学校": {
"読み方": "しょうわこうとうがっこう",
"所在位置": "愛知県"
},
"新川高等学校": {
"読み方": "しんかわこうとうがっこう",
"所在位置": "愛知県"
},
"新城有教館高等学校": {
"読み方": "しんしろゆうきょうかんこうとうがっこう",
"所在位置": "愛知県"
},
"瑞陵高等学校": {
"読み方": "ずいりょうこうとうがっこう",
"所在位置": "愛知県"
},
"瀬戸高等学校": {
"読み方": "せとこうとうがっこう",
"所在位置": "岡山県"
},
"瀬戸北総合高等学校": {
"読み方": "せときたそうごうこうとうがっこう",
"所在位置": "愛知県"
},
"瀬戸西高等学校": {
"読み方": "せとにしこうとうがっこう",
"所在位置": "愛知県"
},
"瀬戸工科高等学校": {
"読み方": "せとこうかこうとうがっこう",
"所在位置": "愛知県"
},
"高浜高等学校": {
"読み方": "たかはまこうとうがっこう",
"所在位置": "神奈川県"
},
"田口高等学校": {
"読み方": "たぐちこうとうがっこう",
"所在位置": "愛知県"
},
"武豊高等学校": {
"読み方": "たけとよこうとうがっこう",
"所在位置": "愛知県"
},
"千種高等学校": {
"読み方": "ちぐさこうとうがっこう",
"所在位置": "愛知県"
},
"知多翔洋高等学校": {
"読み方": "ちたしょうようこうとうがっこう",
"所在位置": "愛知県"
},
"知立高等学校": {
"読み方": "ちりゅうこうとうがっこう",
"所在位置": "愛知県"
},
"知立東高等学校": {
"読み方": "ちりゅうひがしこうとうがっこう",
"所在位置": "愛知県"
},
"津島高等学校": {
"読み方": "つしまこうとうがっこう",
"所在位置": "愛知県"
},
"津島北高等学校": {
"読み方": "つしまきたこうとうがっこう",
"所在位置": "愛知県"
},
"津島東高等学校": {
"読み方": "つしまひがしこうとうがっこう",
"所在位置": "愛知県"
},
"天白高等学校": {
"読み方": "てんぱくこうとうがっこう",
"所在位置": "愛知県"
},
"東海樟風高等学校": {
"読み方": "とうかいしょうふうこうとうがっこう",
"所在位置": "愛知県"
},
"東海南高等学校": {
"読み方": "とうかいみなみこうとうがっこう",
"所在位置": "愛知県"
},
"東郷高等学校": {
"読み方": "とうごうこうとうがっこう",
"所在位置": "愛知県"
},
"桃陵高等学校": {
"読み方": "とうりょうこうとうがっこう",
"所在位置": "愛知県"
},
"常滑高等学校": {
"読み方": "とこなめこうとうがっこう",
"所在位置": "愛知県"
},
"豊明高等学校": {
"読み方": "とよあけこうとうがっこう",
"所在位置": "愛知県"
},
"豊丘高等学校": {
"読み方": "ゆたかがおかこうとうがっこう",
"所在位置": "愛知県"
},
"豊川工科高等学校": {
"読み方": "とよかわこうかこうとうがっこう",
"所在位置": "愛知県"
},
"豊田高等学校": {
"読み方": "とよたこうとうがっこう",
"所在位置": "愛知県"
},
"豊田北高等学校": {
"読み方": "とよたきたこうとうがっこう",
"所在位置": "愛知県"
},
"豊田工科高等学校": {
"読み方": "とよたこうかこうとうがっこう",
"所在位置": "愛知県"
},
"豊田西高等学校": {
"読み方": "とよたにしこうとうがっこう",
"所在位置": "愛知県"
},
"豊田東高等学校": {
"読み方": "とよたひがしこうとうがっこう",
"所在位置": "愛知県"
},
"豊田南高等学校": {
"読み方": "とよたみなみこうとうがっこう",
"所在位置": "愛知県"
},
"豊野高等学校": {
"読み方": "ゆたかのこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋工科高等学校": {
"読み方": "とよはしこうかこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋商業高等学校": {
"読み方": "とよはししょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋西高等学校": {
"読み方": "とよはしにしこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋東高等学校": {
"読み方": "とよはしひがしこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋南高等学校": {
"読み方": "とよはしみなみこうとうがっこう",
"所在位置": "愛知県"
},
"中川商業高等学校": {
"読み方": "なかがわしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"長久手高等学校": {
"読み方": "ながくてこうとうがっこう",
"所在位置": "愛知県"
},
"中村高等学校": {
"読み方": "なかむらこうとうがっこう",
"所在位置": "高知県"
},
"名古屋西高等学校": {
"読み方": "なごやにしこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋南高等学校": {
"読み方": "なごやみなみこうとうがっこう",
"所在位置": "愛知県"
},
"成章高等学校": {
"読み方": "せいしょうこうとうがっこう",
"所在位置": "愛知県"
},
"鳴海高等学校": {
"読み方": "なるみこうとうがっこう",
"所在位置": "愛知県"
},
"南陽高等学校": {
"読み方": "なんようこうとうがっこう",
"所在位置": "山形県"
},
"西尾高等学校": {
"読み方": "にしおこうとうがっこう",
"所在位置": "愛知県"
},
"西尾東高等学校": {
"読み方": "にしおひがしこうとうがっこう",
"所在位置": "愛知県"
},
"西春高等学校": {
"読み方": "にしはるこうとうがっこう",
"所在位置": "愛知県"
},
"日進高等学校": {
"読み方": "にっしんこうとうがっこう",
"所在位置": "愛知県"
},
"日進西高等学校": {
"読み方": "にっしんにしこうとうがっこう",
"所在位置": "愛知県"
},
"丹羽高等学校": {
"読み方": "にわこうとうがっこう",
"所在位置": "愛知県"
},
"半田高等学校": {
"読み方": "はんだこうとうがっこう",
"所在位置": "愛知県"
},
"半田工科高等学校": {
"読み方": "はんだこうかこうとうがっこう",
"所在位置": "愛知県"
},
"半田商業高等学校": {
"読み方": "はんだしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"半田農業高等学校": {
"読み方": "はんだのうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"半田東高等学校": {
"読み方": "はんだひがしこうとうがっこう",
"所在位置": "愛知県"
},
"東浦高等学校": {
"読み方": "ひがしうらこうとうがっこう",
"所在位置": "愛知県"
},
"尾西高等学校": {
"読み方": "びさいこうとうがっこう",
"所在位置": "愛知県"
},
"尾北高等学校": {
"読み方": "びほくこうとうがっこう",
"所在位置": "愛知県"
},
"福江高等学校": {
"読み方": "ふくえこうとうがっこう",
"所在位置": "愛知県"
},
"碧南高等学校": {
"読み方": "へきなんこうとうがっこう",
"所在位置": "愛知県"
},
"碧南工科高等学校": {
"読み方": "へきなんこうかこうとうがっこう",
"所在位置": "愛知県"
},
"松蔭高等学校": {
"読み方": "しょういんこうとうがっこう",
"所在位置": "愛知県"
},
"松平高等学校": {
"読み方": "まつだいらこうとうがっこう",
"所在位置": "愛知県"
},
"三谷水産高等学校": {
"読み方": "みやすいさんこうとうがっこう",
"所在位置": "愛知県"
},
"御津高等学校": {
"読み方": "みとこうとうがっこう",
"所在位置": "愛知県"
},
"緑丘高等学校": {
"読み方": "みどりがおかこうとうがっこう",
"所在位置": "愛知県"
},
"三好高等学校": {
"読み方": "みよしこうとうがっこう",
"所在位置": "愛知県"
},
"美和高等学校": {
"読み方": "みわこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋工科高等学校": {
"読み方": "なごやこうかこうとうがっこう",
"所在位置": "愛知県"
},
"明和高等学校": {
"読み方": "めいわこうとうがっこう",
"所在位置": "愛知県"
},
"守山高等学校": {
"読み方": "もりやまこうとうがっこう",
"所在位置": "滋賀県"
},
"横須賀高等学校": {
"読み方": "よこすかこうとうがっこう",
"所在位置": "静岡県"
},
"愛知工業大学名電高等学校": {
"読み方": "あいちこうぎょうだいがくめいでんこうとうがっこう",
"所在位置": "愛知県"
},
"愛知産業大学工業高等学校": {
"読み方": "あいちさんぎょうだいがくこうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"愛知産業大学三河高等学校": {
"読み方": "あいちさんぎょうだいがくみかわこうとうがっこう",
"所在位置": "愛知県"
},
"愛知淑徳高等学校": {
"読み方": "あいちしゅくとくこうとうがっこう",
"所在位置": "愛知県"
},
"愛知みずほ大学瑞穂高等学校": {
"読み方": "あいちみずほだいがくみずほこうとうがっこう",
"所在位置": "愛知県"
},
"会津若松ザベリオ学園高等学校": {
"読み方": "あいづわかまつざべりおがくえんこうとうがっこう",
"所在位置": "福島県"
},
"愛徳学園高等学校": {
"読み方": "あいとくがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"青森明の星高等学校": {
"読み方": "あおもりあけのほしこうとうがっこう",
"所在位置": "青森県"
},
"青森高等学校": {
"読み方": "あおもりこうとうがっこう",
"所在位置": "青森県"
},
"青森北高等学校": {
"読み方": "あおもりきたこうとうがっこう",
"所在位置": "青森県"
},
"青森工業高等学校": {
"読み方": "あおもりこうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"青森商業高等学校": {
"読み方": "あおもりしょうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"青森中央高等学校": {
"読み方": "あおもりちゅうおうこうとうがっこう",
"所在位置": "青森県"
},
"青森西高等学校": {
"読み方": "あおもりにしこうとうがっこう",
"所在位置": "青森県"
},
"青森東高等学校": {
"読み方": "あおもりひがしこうとうがっこう",
"所在位置": "青森県"
},
"青森南高等学校": {
"読み方": "あおもりみなみこうとうがっこう",
"所在位置": "青森県"
},
"鰺ヶ沢高等学校": {
"読み方": "あじがさわこうとうがっこう",
"所在位置": "青森県"
},
"尾上総合高等学校": {
"読み方": "おのえそうごうこうとうがっこう",
"所在位置": "青森県"
},
"柏木農業高等学校": {
"読み方": "かしわぎのうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"黒石高等学校": {
"読み方": "くろいしこうとうがっこう",
"所在位置": "青森県"
},
"五所川原高等学校": {
"読み方": "ごしょがわらこうとうがっこう",
"所在位置": "青森県"
},
"五所川原工業高等学校": {
"読み方": "ごしょがわらこうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"五所川原農林高等学校": {
"読み方": "ごしょがわらのうりんこうとうがっこう",
"所在位置": "青森県"
},
"三本木高等学校": {
"読み方": "さんぼんぎこうとうがっこう",
"所在位置": "青森県"
},
"三本木農業高等学校": {
"読み方": "さんぼんぎのうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"大湊高等学校": {
"読み方": "おおみなとこうとうがっこう",
"所在位置": "青森県"
},
"田名部高等学校": {
"読み方": "たなぶこうとうがっこう",
"所在位置": "青森県"
},
"十和田工業高等学校": {
"読み方": "とわだこうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"七戸高等学校": {
"読み方": "しちのへこうとうがっこう",
"所在位置": "青森県"
},
"八戸高等学校": {
"読み方": "はちのへこうとうがっこう",
"所在位置": "青森県"
},
"八戸北高等学校": {
"読み方": "はちのへきたこうとうがっこう",
"所在位置": "青森県"
},
"八戸工業高等学校": {
"読み方": "はちのへこうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"八戸商業高等学校": {
"読み方": "はちのへしょうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"八戸水産高等学校": {
"読み方": "はちのへすいさんこうとうがっこう",
"所在位置": "青森県"
},
"八戸中央高等学校": {
"読み方": "はちのへちゅうおうこうとうがっこう",
"所在位置": "青森県"
},
"八戸西高等学校": {
"読み方": "はちのへにしこうとうがっこう",
"所在位置": "青森県"
},
"八戸東高等学校": {
"読み方": "はちのへひがしこうとうがっこう",
"所在位置": "青森県"
},
"弘前高等学校": {
"読み方": "ひろさきこうとうがっこう",
"所在位置": "青森県"
},
"弘前工業高等学校": {
"読み方": "ひろさきこうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"弘前実業高等学校": {
"読み方": "ひろさきじつぎょうこうとうがっこう",
"所在位置": "青森県"
},
"弘前中央高等学校": {
"読み方": "ひろさきちゅうおうこうとうがっこう",
"所在位置": "青森県"
},
"弘前南高等学校": {
"読み方": "ひろさきみなみこうとうがっこう",
"所在位置": "青森県"
},
"北斗高等学校": {
"読み方": "ほくとこうとうがっこう",
"所在位置": "青森県"
},
"三沢高等学校": {
"読み方": "みさわこうとうがっこう",
"所在位置": "青森県"
},
"三沢商業高等学校": {
"読み方": "みさわしょうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"木造高等学校": {
"読み方": "きづくりこうとうがっこう",
"所在位置": "青森県"
},
"百石高等学校": {
"読み方": "ももいしこうとうがっこう",
"所在位置": "青森県"
},
"青森山田高等学校": {
"読み方": "あおもりやまだこうとうがっこう",
"所在位置": "青森県"
},
"明石市立明石商業高等学校": {
"読み方": "あかししりつあかししょうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"暁高等学校": {
"読み方": "あかつきこうとうがっこう",
"所在位置": "三重県"
},
"秋草学園高等学校": {
"読み方": "あきくさがくえんこうとうがっこう",
"所在位置": "埼玉県"
},
"秋田高等学校": {
"読み方": "あきたこうとうがっこう",
"所在位置": "秋田県"
},
"秋田北高等学校": {
"読み方": "あきたきたこうとうがっこう",
"所在位置": "秋田県"
},
"秋田工業高等学校": {
"読み方": "あきたこうぎょうこうとうがっこう",
"所在位置": "秋田県"
},
"秋田中央高等学校": {
"読み方": "あきたちゅうおうこうとうがっこう",
"所在位置": "秋田県"
},
"秋田西高等学校": {
"読み方": "あきたにしこうとうがっこう",
"所在位置": "秋田県"
},
"秋田南高等学校": {
"読み方": "あきたみなみこうとうがっこう",
"所在位置": "秋田県"
},
"秋田明徳館高等学校": {
"読み方": "あきためいとくかんこうとうがっこう",
"所在位置": "秋田県"
},
"新屋高等学校": {
"読み方": "あらやこうとうがっこう",
"所在位置": "秋田県"
},
"羽後高等学校": {
"読み方": "うごこうとうがっこう",
"所在位置": "秋田県"
},
"大館国際情報学院高等学校": {
"読み方": "おおだてこくさいじょうほうがくいんこうとうがっこう",
"所在位置": "秋田県"
},
"大館鳳鳴高等学校": {
"読み方": "おおだてほうめいこうとうがっこう",
"所在位置": "秋田県"
},
"大曲高等学校": {
"読み方": "おおまがりこうとうがっこう",
"所在位置": "秋田県"
},
"大曲工業高等学校": {
"読み方": "おおまがりこうぎょうこうとうがっこう",
"所在位置": "秋田県"
},
"大曲農業高等学校": {
"読み方": "おおまがりのうぎょうこうとうがっこう",
"所在位置": "秋田県"
},
"男鹿海洋高等学校": {
"読み方": "おがかいようこうとうがっこう",
"所在位置": "秋田県"
},
"角館高等学校": {
"読み方": "かくのだてこうとうがっこう",
"所在位置": "秋田県"
},
"金足農業高等学校": {
"読み方": "かなあしのうぎょうこうとうがっこう",
"所在位置": "秋田県"
},
"小坂高等学校": {
"読み方": "こさかこうとうがっこう",
"所在位置": "秋田県"
},
"秋田北鷹高等学校": {
"読み方": "あきたほくようこうとうがっこう",
"所在位置": "秋田県"
},
"仁賀保高等学校": {
"読み方": "にかほこうとうがっこう",
"所在位置": "秋田県"
},
"西仙北高等学校": {
"読み方": "にしせんぼくこうとうがっこう",
"所在位置": "秋田県"
},
"西目高等学校": {
"読み方": "にしめこうとうがっこう",
"所在位置": "秋田県"
},
"能代高等学校": {
"読み方": "のしろこうとうがっこう",
"所在位置": "秋田県"
},
"能代工業高等学校": {
"読み方": "のしろこうぎょうこうとうがっこう",
"所在位置": "秋田県"
},
"花輪高等学校": {
"読み方": "はなわこうとうがっこう",
"所在位置": "秋田県"
},
"本荘高等学校": {
"読み方": "ほんじょうこうとうがっこう",
"所在位置": "秋田県"
},
"増田高等学校": {
"読み方": "ますだこうとうがっこう",
"所在位置": "秋田県"
},
"湯沢高等学校": {
"読み方": "ゆざわこうとうがっこう",
"所在位置": "秋田県"
},
"湯沢翔北高等学校": {
"読み方": "ゆざわしょうほくこうとうがっこう",
"所在位置": "秋田県"
},
"由利高等学校": {
"読み方": "ゆりこうとうがっこう",
"所在位置": "秋田県"
},
"横手高等学校": {
"読み方": "よこてこうとうがっこう",
"所在位置": "秋田県"
},
"横手清陵学院高等学校": {
"読み方": "よこてせいりょうがくいんこうとうがっこう",
"所在位置": "秋田県"
},
"横手城南高等学校": {
"読み方": "よこてじょうなんこうとうがっこう",
"所在位置": "秋田県"
},
"六郷高等学校": {
"読み方": "ろくごうこうとうがっこう",
"所在位置": "秋田県"
},
"秋田市立秋田商業高等学校": {
"読み方": "あきたしりつあきたしょうぎょうこうとうがっこう",
"所在位置": "秋田県"
},
"秋田市立御所野学院高等学校": {
"読み方": "あきたしりつごしょのがくいんこうとうがっこう",
"所在位置": "秋田県"
},
"秋田令和高等学校": {
"読み方": "あきたれいわこうとうがっこう",
"所在位置": "秋田県"
},
"仙台大学附属明成高等学校": {
"読み方": "せんだいだいがくふぞくめいせいこうとうがっこう",
"所在位置": "宮城県"
},
"明秀学園日立高等学校": {
"読み方": "めいしゅうがくえんひたちこうとうがっこう",
"所在位置": "茨城県"
},
"浜松修学舎高等学校": {
"読み方": "はままつしゅうがくしゃこうとうがっこう",
"所在位置": "静岡県"
},
"浅野高等学校": {
"読み方": "あさのこうとうがっこう",
"所在位置": "神奈川県"
},
"朝日塾中等教育学校 後期課程": {
"読み方": "あさひじゅくちゅうとうきょういくがっこう こうきかてい",
"所在位置": "岡山県"
},
"麻布大学附属高等学校": {
"読み方": "あざぶだいがくふぞくこうとうがっこう",
"所在位置": "神奈川県"
},
"足利大学附属高等学校": {
"読み方": "あしかがだいがくふぞくこうとうがっこう",
"所在位置": "栃木県"
},
"足利短期大学附属高等学校": {
"読み方": "あしかがたんきだいがくふぞくこうとうがっこう",
"所在位置": "栃木県"
},
"芦屋学園高等学校": {
"読み方": "あしやがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"飛鳥未来高等学校": {
"読み方": "あすかみらいこうとうがっこう",
"所在位置": "奈良県"
},
"あずさ第一高等学校": {
"読み方": "あずさだいいちこうとうがっこう",
"所在位置": "千葉県"
},
"厚木中央高等学校": {
"読み方": "あつぎちゅうおうこうとうがっこう",
"所在位置": "神奈川県"
},
"我孫子二階堂高等学校": {
"読み方": "あびこにかいどうこうとうがっこう",
"所在位置": "千葉県"
},
"尼崎市立尼崎高等学校": {
"読み方": "あまがさきしりつあまがさきこうとうがっこう",
"所在位置": "兵庫県"
},
"綾羽高等学校": {
"読み方": "あやはこうとうがっこう",
"所在位置": "滋賀県"
},
"荒井学園新川高等学校": {
"読み方": "あらいがくえんにいかわこうとうがっこう",
"所在位置": "富山県"
},
"有明高等学校": {
"読み方": "ありあけこうとうがっこう",
"所在位置": "熊本県"
},
"アレセイア湘南高等学校": {
"読み方": "あれせいあしょうなんこうとうがっこう",
"所在位置": "神奈川県"
},
"安城学園高等学校": {
"読み方": "あんじょうがくえんこうとうがっこう",
"所在位置": "愛知県"
},
"安城学園岡崎城西高等学校": {
"読み方": "あんじょうがくえんおかざきじょうせいこうとうがっこう",
"所在位置": "愛知県"
},
"飯田女子高等学校": {
"読み方": "いいだじょしこうとうがっこう",
"所在位置": "長野県"
},
"飯塚高等学校": {
"読み方": "いいづかこうとうがっこう",
"所在位置": "福岡県"
},
"育英高等学校": {
"読み方": "いくえいこうとうがっこう",
"所在位置": "兵庫県"
},
"育英西高等学校": {
"読み方": "いくえいにしこうとうがっこう",
"所在位置": "奈良県"
},
"池田高等学校": {
"読み方": "いけだこうとうがっこう",
"所在位置": "徳島県"
},
"穴水高等学校": {
"読み方": "あなみずこうとうがっこう",
"所在位置": "石川県"
},
"飯田高等学校": {
"読み方": "いいだこうとうがっこう",
"所在位置": "長野県"
},
"内灘高等学校": {
"読み方": "うちなだこうとうがっこう",
"所在位置": "石川県"
},
"金沢泉丘高等学校": {
"読み方": "かなざわいずみがおかこうとうがっこう",
"所在位置": "石川県"
},
"金沢向陽高等学校": {
"読み方": "かなざわこうようこうとうがっこう",
"所在位置": "石川県"
},
"金沢桜丘高等学校": {
"読み方": "かなざわさくらがおかこうとうがっこう",
"所在位置": "石川県"
},
"金沢商業高等学校": {
"読み方": "かなざわしょうぎょうこうとうがっこう",
"所在位置": "石川県"
},
"金沢辰巳丘高等学校": {
"読み方": "かなざわたつみがおかこうとうがっこう",
"所在位置": "石川県"
},
"金沢西高等学校": {
"読み方": "かなざわにしこうとうがっこう",
"所在位置": "石川県"
},
"金沢錦丘高等学校": {
"読み方": "かなざわにしきがおかこうとうがっこう",
"所在位置": "石川県"
},
"金沢二水高等学校": {
"読み方": "かなざわにすいこうとうがっこう",
"所在位置": "石川県"
},
"金沢伏見高等学校": {
"読み方": "かなざわふしみこうとうがっこう",
"所在位置": "石川県"
},
"金沢北陵高等学校": {
"読み方": "かなざわほくりょうこうとうがっこう",
"所在位置": "石川県"
},
"石川県立工業高等学校": {
"読み方": "いしかわけんりつこうぎょうこうとうがっこう",
"所在位置": "石川県"
},
"小松高等学校": {
"読み方": "こまつこうとうがっこう",
"所在位置": "愛媛県"
},
"小松工業高等学校": {
"読み方": "こまつこうぎょうこうとうがっこう",
"所在位置": "石川県"
},
"小松商業高等学校": {
"読み方": "こまつしょうぎょうこうとうがっこう",
"所在位置": "石川県"
},
"小松明峰高等学校": {
"読み方": "こまつめいほうこうとうがっこう",
"所在位置": "石川県"
},
"翠星高等学校": {
"読み方": "すいせいこうとうがっこう",
"所在位置": "石川県"
},
"大聖寺高等学校": {
"読み方": "だいしょうじこうとうがっこう",
"所在位置": "石川県"
},
"大聖寺実業高等学校": {
"読み方": "だいしょうじじつぎょうこうとうがっこう",
"所在位置": "石川県"
},
"田鶴浜高等学校": {
"読み方": "たつるはまこうとうがっこう",
"所在位置": "石川県"
},
"鶴来高等学校": {
"読み方": "つるぎこうとうがっこう",
"所在位置": "石川県"
},
"寺井高等学校": {
"読み方": "てらいこうとうがっこう",
"所在位置": "石川県"
},
"七尾高等学校": {
"読み方": "ななおこうとうがっこう",
"所在位置": "石川県"
},
"七尾東雲高等学校": {
"読み方": "ななおしののめこうとうがっこう",
"所在位置": "石川県"
},
"野々市明倫高等学校": {
"読み方": "ののいちめいりんこうとうがっこう",
"所在位置": "石川県"
},
"羽咋高等学校": {
"読み方": "はくいこうとうがっこう",
"所在位置": "石川県"
},
"羽咋工業高等学校": {
"読み方": "はくいこうぎょうこうとうがっこう",
"所在位置": "石川県"
},
"宝達高等学校": {
"読み方": "ほうだつこうとうがっこう",
"所在位置": "石川県"
},
"松任高等学校": {
"読み方": "まつとうこうとうがっこう",
"所在位置": "石川県"
},
"鹿西高等学校": {
"読み方": "ろくせいこうとうがっこう",
"所在位置": "石川県"
},
"輪島高等学校": {
"読み方": "わじまこうとうがっこう",
"所在位置": "石川県"
},
"桜坂高等学校": {
"読み方": "さくらざかこうとうがっこう",
"所在位置": "宮城県"
},
"出水市立出水商業高等学校": {
"読み方": "いずみしりついずみしょうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"出水中央高等学校": {
"読み方": "いずみちゅうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"伊勢学園高等学校": {
"読み方": "いせがくえんこうとうがっこう",
"所在位置": "三重県"
},
"伊丹市立伊丹高等学校": {
"読み方": "いたみしりついたみこうとうがっこう",
"所在位置": "兵庫県"
},
"市川高等学校": {
"読み方": "いちかわこうとうがっこう",
"所在位置": "兵庫県"
},
"一関学院高等学校": {
"読み方": "いちのせきがくいんこうとうがっこう",
"所在位置": "岩手県"
},
"一関修紅高等学校": {
"読み方": "いちのせきしゅうこうこうとうがっこう",
"所在位置": "岩手県"
},
"市原中央高等学校": {
"読み方": "いちはらちゅうおうこうとうがっこう",
"所在位置": "千葉県"
},
"伊那西高等学校": {
"読み方": "いなにしこうとうがっこう",
"所在位置": "長野県"
},
"茨城高等学校": {
"読み方": "いばらきこうとうがっこう",
"所在位置": "茨城県"
},
"茨城キリスト教学園高等学校": {
"読み方": "いばらききりすときょうがくえんこうとうがっこう",
"所在位置": "茨城県"
},
"麻生高等学校": {
"読み方": "あさおこうとうがっこう",
"所在位置": "神奈川県"
},
"石岡商業高等学校": {
"読み方": "いしおかしょうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"石岡第一高等学校": {
"読み方": "いしおかだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"石岡第二高等学校": {
"読み方": "いしおかだいにこうとうがっこう",
"所在位置": "茨城県"
},
"石下紫峰高等学校": {
"読み方": "いしげしほうこうとうがっこう",
"所在位置": "茨城県"
},
"伊奈高等学校": {
"読み方": "いなこうとうがっこう",
"所在位置": "茨城県"
},
"茨城東高等学校": {
"読み方": "いばらきひがしこうとうがっこう",
"所在位置": "茨城県"
},
"岩瀬高等学校": {
"読み方": "いわせこうとうがっこう",
"所在位置": "茨城県"
},
"牛久高等学校": {
"読み方": "うしくこうとうがっこう",
"所在位置": "茨城県"
},
"牛久栄進高等学校": {
"読み方": "うしくえいしんこうとうがっこう",
"所在位置": "茨城県"
},
"江戸崎総合高等学校": {
"読み方": "えどさきそうごうこうとうがっこう",
"所在位置": "茨城県"
},
"太田第一高等学校": {
"読み方": "おおただいいちこうとうがっこう",
"所在位置": "茨城県"
},
"太田西山高等学校": {
"読み方": "おおたせいざんこうとうがっこう",
"所在位置": "茨城県"
},
"小瀬高等学校": {
"読み方": "おせこうとうがっこう",
"所在位置": "茨城県"
},
"笠間高等学校": {
"読み方": "かさまこうとうがっこう",
"所在位置": "茨城県"
},
"鹿島高等学校": {
"読み方": "かしまこうとうがっこう",
"所在位置": "茨城県"
},
"勝田高等学校": {
"読み方": "かつたこうとうがっこう",
"所在位置": "茨城県"
},
"勝田工業高等学校": {
"読み方": "かつたこうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"神栖高等学校": {
"読み方": "かみすこうとうがっこう",
"所在位置": "茨城県"
},
"鬼怒商業高等学校": {
"読み方": "きぬしょうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"古河第一高等学校": {
"読み方": "こがだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"古河第三高等学校": {
"読み方": "こがだいさんこうとうがっこう",
"所在位置": "茨城県"
},
"古河第二高等学校": {
"読み方": "こがだいにこうとうがっこう",
"所在位置": "茨城県"
},
"境高等学校": {
"読み方": "さかいこうとうがっこう",
"所在位置": "鳥取県"
},
"佐和高等学校": {
"読み方": "さわこうとうがっこう",
"所在位置": "茨城県"
},
"下館工業高等学校": {
"読み方": "しもだてこうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"下館第一高等学校": {
"読み方": "しもだてだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"下館第二高等学校": {
"読み方": "しもだてだいにこうとうがっこう",
"所在位置": "茨城県"
},
"下妻第一高等学校": {
"読み方": "しもつまだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"下妻第二高等学校": {
"読み方": "しもつまだいにこうとうがっこう",
"所在位置": "茨城県"
},
"総和工業高等学校": {
"読み方": "そうわこうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"大子清流高等学校": {
"読み方": "だいごせいりゅうこうとうがっこう",
"所在位置": "茨城県"
},
"多賀高等学校": {
"読み方": "たがこうとうがっこう",
"所在位置": "茨城県"
},
"高萩高等学校": {
"読み方": "たかはぎこうとうがっこう",
"所在位置": "茨城県"
},
"高萩清松高等学校": {
"読み方": "たかはぎせいしょうこうとうがっこう",
"所在位置": "茨城県"
},
"竹園高等学校": {
"読み方": "たけぞのこうとうがっこう",
"所在位置": "茨城県"
},
"中央高等学校": {
"読み方": "ちゅうおうこうとうがっこう",
"所在位置": "山梨県"
},
"つくば工科高等学校": {
"読み方": "つくばこうかこうとうがっこう",
"所在位置": "茨城県"
},
"土浦工業高等学校": {
"読み方": "つちうらこうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"土浦湖北高等学校": {
"読み方": "つちうらこほくこうとうがっこう",
"所在位置": "茨城県"
},
"土浦第一高等学校": {
"読み方": "つちうらだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"土浦第三高等学校": {
"読み方": "つちうらだいさんこうとうがっこう",
"所在位置": "茨城県"
},
"土浦第二高等学校": {
"読み方": "つちうらだいにこうとうがっこう",
"所在位置": "茨城県"
},
"東海高等学校": {
"読み方": "とうかいこうとうがっこう",
"所在位置": "愛知県"
},
"友部高等学校": {
"読み方": "ともべこうとうがっこう",
"所在位置": "茨城県"
},
"取手松陽高等学校": {
"読み方": "とりでしょうようこうとうがっこう",
"所在位置": "茨城県"
},
"取手第一高等学校": {
"読み方": "とりでだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"取手第二高等学校": {
"読み方": "とりでだいにこうとうがっこう",
"所在位置": "茨城県"
},
"那珂高等学校": {
"読み方": "なかこうとうがっこう",
"所在位置": "茨城県"
},
"那珂湊高等学校": {
"読み方": "なかみなとこうとうがっこう",
"所在位置": "茨城県"
},
"並木中等教育学校 後期課程": {
"読み方": "なみきちゅうとうきょういくがっこう こうきかてい",
"所在位置": "茨城県"
},
"波崎高等学校": {
"読み方": "はさきこうとうがっこう",
"所在位置": "茨城県"
},
"波崎柳川高等学校": {
"読み方": "はさきやながわこうとうがっこう",
"所在位置": "茨城県"
},
"日立北高等学校": {
"読み方": "ひたちきたこうとうがっこう",
"所在位置": "茨城県"
},
"日立工業高等学校": {
"読み方": "ひたちこうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"日立商業高等学校": {
"読み方": "ひたちしょうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"日立第一高等学校": {
"読み方": "ひたちだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"日立第二高等学校": {
"読み方": "ひたちだいにこうとうがっこう",
"所在位置": "茨城県"
},
"藤代高等学校": {
"読み方": "ふじしろこうとうがっこう",
"所在位置": "茨城県"
},
"藤代紫水高等学校": {
"読み方": "ふじしろしすいこうとうがっこう",
"所在位置": "茨城県"
},
"鉾田第一高等学校": {
"読み方": "ほこただいいちこうとうがっこう",
"所在位置": "茨城県"
},
"鉾田第二高等学校": {
"読み方": "ほこただいにこうとうがっこう",
"所在位置": "茨城県"
},
"真壁高等学校": {
"読み方": "まかべこうとうがっこう",
"所在位置": "茨城県"
},
"水海道第一高等学校": {
"読み方": "みつかいどうだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"水海道第二高等学校": {
"読み方": "みつかいどうだいにこうとうがっこう",
"所在位置": "茨城県"
},
"水戸工業高等学校": {
"読み方": "みとこうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"水戸桜ノ牧高等学校": {
"読み方": "みとさくらのまきこうとうがっこう",
"所在位置": "茨城県"
},
"水戸商業高等学校": {
"読み方": "みとしょうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"水戸第一高等学校": {
"読み方": "みとだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"水戸第三高等学校": {
"読み方": "みとだいさんこうとうがっこう",
"所在位置": "茨城県"
},
"水戸第二高等学校": {
"読み方": "みとだいにこうとうがっこう",
"所在位置": "茨城県"
},
"水戸農業高等学校": {
"読み方": "みとのうぎょうこうとうがっこう",
"所在位置": "茨城県"
},
"水戸南高等学校": {
"読み方": "みとみなみこうとうがっこう",
"所在位置": "茨城県"
},
"緑岡高等学校": {
"読み方": "みどりおかこうとうがっこう",
"所在位置": "茨城県"
},
"守谷高等学校": {
"読み方": "もりやこうとうがっこう",
"所在位置": "茨城県"
},
"八千代高等学校": {
"読み方": "やちよこうとうがっこう",
"所在位置": "千葉県"
},
"結城第一高等学校": {
"読み方": "ゆうきだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"竜ヶ崎第一高等学校": {
"読み方": "りゅうがさきだいいちこうとうがっこう",
"所在位置": "茨城県"
},
"竜ヶ崎第二高等学校": {
"読み方": "りゅうがさきだいにこうとうがっこう",
"所在位置": "茨城県"
},
"竜ヶ崎南高等学校": {
"読み方": "りゅうがさきみなみこうとうがっこう",
"所在位置": "茨城県"
},
"指宿市立指宿商業高等学校": {
"読み方": "いぶすきしりついぶすきしょうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"今治明徳高等学校": {
"読み方": "いまばりめいとくこうとうがっこう",
"所在位置": "愛媛県"
},
"いわき秀英高等学校": {
"読み方": "いわきしゅうえいこうとうがっこう",
"所在位置": "福島県"
},
"磐城緑蔭高等学校": {
"読み方": "いわきりょくいんこうとうがっこう",
"所在位置": "福島県"
},
"岩瀬日本大学高等学校": {
"読み方": "いわせにほんだいがくこうとうがっこう",
"所在位置": "茨城県"
},
"岩田高等学校": {
"読み方": "いわたこうとうがっこう",
"所在位置": "大分県"
},
"磐田東高等学校": {
"読み方": "いわたひがしこうとうがっこう",
"所在位置": "静岡県"
},
"岩手高等学校": {
"読み方": "いわてこうとうがっこう",
"所在位置": "岩手県"
},
"花北青雲高等学校": {
"読み方": "はなきたせいうんこうとうがっこう",
"所在位置": "岩手県"
},
"一関工業高等学校": {
"読み方": "いちのせきこうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"一関第一高等学校": {
"読み方": "いちのせきだいいちこうとうがっこう",
"所在位置": "岩手県"
},
"一関第二高等学校": {
"読み方": "いちのせきだいにこうとうがっこう",
"所在位置": "岩手県"
},
"一戸高等学校": {
"読み方": "いちのへこうとうがっこう",
"所在位置": "岩手県"
},
"岩泉高等学校": {
"読み方": "いわいずみこうとうがっこう",
"所在位置": "岩手県"
},
"岩谷堂高等学校": {
"読み方": "いわやどうこうとうがっこう",
"所在位置": "岩手県"
},
"大船渡高等学校": {
"読み方": "おおふなとこうとうがっこう",
"所在位置": "岩手県"
},
"金ケ崎高等学校": {
"読み方": "かねがさきこうとうがっこう",
"所在位置": "岩手県"
},
"釜石高等学校": {
"読み方": "かまいしこうとうがっこう",
"所在位置": "岩手県"
},
"北上翔南高等学校": {
"読み方": "きたかみしょうなんこうとうがっこう",
"所在位置": "岩手県"
},
"久慈高等学校": {
"読み方": "くじこうとうがっこう",
"所在位置": "岩手県"
},
"久慈東高等学校": {
"読み方": "くじひがしこうとうがっこう",
"所在位置": "岩手県"
},
"黒沢尻北高等学校": {
"読み方": "くろさわじりきたこうとうがっこう",
"所在位置": "岩手県"
},
"黒沢尻工業高等学校": {
"読み方": "くろさわじりこうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"不来方高等学校": {
"読み方": "こずかたこうとうがっこう",
"所在位置": "岩手県"
},
"紫波総合高等学校": {
"読み方": "しわそうごうこうとうがっこう",
"所在位置": "岩手県"
},
"大東高等学校": {
"読み方": "たいとうこうとうがっこう",
"所在位置": "島根県"
},
"平舘高等学校": {
"読み方": "たいらだてこうとうがっこう",
"所在位置": "岩手県"
},
"高田高等学校": {
"読み方": "たかだこうとうがっこう",
"所在位置": "新潟県"
},
"遠野高等学校": {
"読み方": "とおのこうとうがっこう",
"所在位置": "岩手県"
},
"花巻北高等学校": {
"読み方": "はなまききたこうとうがっこう",
"所在位置": "岩手県"
},
"花巻農業高等学校": {
"読み方": "はなまきのうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"花巻南高等学校": {
"読み方": "はなまきみなみこうとうがっこう",
"所在位置": "岩手県"
},
"福岡高等学校": {
"読み方": "ふくおかこうとうがっこう",
"所在位置": "福岡県"
},
"水沢高等学校": {
"読み方": "みずさわこうとうがっこう",
"所在位置": "岩手県"
},
"水沢工業高等学校": {
"読み方": "みずさわこうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"水沢商業高等学校": {
"読み方": "みずさわしょうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"宮古高等学校": {
"読み方": "みやここうとうがっこう",
"所在位置": "沖縄県"
},
"盛岡北高等学校": {
"読み方": "もりおかきたこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡工業高等学校": {
"読み方": "もりおかこうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡商業高等学校": {
"読み方": "もりおかしょうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡第一高等学校": {
"読み方": "もりおかだいいちこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡第三高等学校": {
"読み方": "もりおかだいさんこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡第二高等学校": {
"読み方": "もりおかだいにこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡第四高等学校": {
"読み方": "もりおかだいしこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡農業高等学校": {
"読み方": "もりおかのうぎょうこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡南高等学校": {
"読み方": "もりおかみなみこうとうがっこう",
"所在位置": "岩手県"
},
"岩手女子高等学校": {
"読み方": "いわてじょしこうとうがっこう",
"所在位置": "岩手県"
},
"仁川学院高等学校": {
"読み方": "にがわがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"植草学園大学附属高等学校": {
"読み方": "うえくさがくえんだいがくふぞくこうとうがっこう",
"所在位置": "千葉県"
},
"上田西高等学校": {
"読み方": "うえだにしこうとうがっこう",
"所在位置": "長野県"
},
"鶯谷高等学校": {
"読み方": "うぐいすだにこうとうがっこう",
"所在位置": "岐阜県"
},
"宇都宮短期大学附属高等学校": {
"読み方": "うつのみやたんきだいがくふぞくこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮海星女子学院高等学校": {
"読み方": "うつのみやかいせいじょしがくいんこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮文星女子高等学校": {
"読み方": "うつのみやぶんせいじょしこうとうがっこう",
"所在位置": "栃木県"
},
"宇部鴻城高等学校": {
"読み方": "うべこうじょうこうとうがっこう",
"所在位置": "山口県"
},
"宇部フロンティア大学付属香川高等学校": {
"読み方": "うべふろんてぃあだいがくふぞくかがわこうとうがっこう",
"所在位置": "山口県"
},
"梅光学院高等学校": {
"読み方": "ばいこうがくいんこうとうがっこう",
"所在位置": "山口県"
},
"浦和明の星女子高等学校": {
"読み方": "うらわあけのほしじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和学院高等学校": {
"読み方": "うらわがくいんこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和実業学園高等学校": {
"読み方": "うらわじつぎょうがくえんこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和ルーテル学院高等学校": {
"読み方": "うらわるーてるがくいんこうとうがっこう",
"所在位置": "埼玉県"
},
"栄光学園高等学校": {
"読み方": "えいこうがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"盈進高等学校": {
"読み方": "えいしんこうとうがっこう",
"所在位置": "広島県"
},
"英数学館高等学校": {
"読み方": "えいすうがっかんこうとうがっこう",
"所在位置": "広島県"
},
"栄徳高等学校": {
"読み方": "えいとくこうとうがっこう",
"所在位置": "愛知県"
},
"AICJ高等学校": {
"読み方": "えーあいしーじぇいこうとうがっこう",
"所在位置": "広島県"
},
"エクセラン高等学校": {
"読み方": "えくせらんこうとうがっこう",
"所在位置": "長野県"
},
"江戸川学園取手高等学校": {
"読み方": "えどがわがくえんとりでこうとうがっこう",
"所在位置": "茨城県"
},
"今治北高等学校": {
"読み方": "いまばりきたこうとうがっこう",
"所在位置": "愛媛県"
},
"今治工業高等学校": {
"読み方": "いまばりこうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"今治西高等学校": {
"読み方": "いまばりにしこうとうがっこう",
"所在位置": "愛媛県"
},
"今治南高等学校": {
"読み方": "いまばりみなみこうとうがっこう",
"所在位置": "愛媛県"
},
"伊予高等学校": {
"読み方": "いよこうとうがっこう",
"所在位置": "愛媛県"
},
"伊予農業高等学校": {
"読み方": "いよのうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"宇和高等学校": {
"読み方": "うわこうとうがっこう",
"所在位置": "愛媛県"
},
"宇和島東高等学校": {
"読み方": "うわじまひがしこうとうがっこう",
"所在位置": "愛媛県"
},
"大洲高等学校": {
"読み方": "おおずこうとうがっこう",
"所在位置": "愛媛県"
},
"大洲農業高等学校": {
"読み方": "おおずのうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"上浮穴高等学校": {
"読み方": "かみうけなこうとうがっこう",
"所在位置": "愛媛県"
},
"川之石高等学校": {
"読み方": "かわのいしこうとうがっこう",
"所在位置": "愛媛県"
},
"川之江高等学校": {
"読み方": "かわのえこうとうがっこう",
"所在位置": "愛媛県"
},
"北宇和高等学校": {
"読み方": "きたうわこうとうがっこう",
"所在位置": "愛媛県"
},
"西条高等学校": {
"読み方": "さいじょうこうとうがっこう",
"所在位置": "愛媛県"
},
"丹原高等学校": {
"読み方": "たんばらこうとうがっこう",
"所在位置": "愛媛県"
},
"土居高等学校": {
"読み方": "どいこうとうがっこう",
"所在位置": "愛媛県"
},
"東温高等学校": {
"読み方": "とうおんこうとうがっこう",
"所在位置": "愛媛県"
},
"長浜高等学校": {
"読み方": "ながはまこうとうがっこう",
"所在位置": "愛媛県"
},
"新居浜工業高等学校": {
"読み方": "にいはまこうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"新居浜商業高等学校": {
"読み方": "にいはましょうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"新居浜西高等学校": {
"読み方": "にいはまにしこうとうがっこう",
"所在位置": "愛媛県"
},
"新居浜東高等学校": {
"読み方": "にいはまひがしこうとうがっこう",
"所在位置": "愛媛県"
},
"新居浜南高等学校": {
"読み方": "にいはまみなみこうとうがっこう",
"所在位置": "愛媛県"
},
"野村高等学校": {
"読み方": "のむらこうとうがっこう",
"所在位置": "愛媛県"
},
"北条高等学校": {
"読み方": "ほうじょうこうとうがっこう",
"所在位置": "兵庫県"
},
"松山北高等学校": {
"読み方": "まつやまきたこうとうがっこう",
"所在位置": "愛媛県"
},
"松山工業高等学校": {
"読み方": "まつやまこうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"松山商業高等学校": {
"読み方": "まつやましょうぎょうこうとうがっこう",
"所在位置": "愛媛県"
},
"松山中央高等学校": {
"読み方": "まつやまちゅうおうこうとうがっこう",
"所在位置": "愛媛県"
},
"松山東高等学校": {
"読み方": "まつやまひがしこうとうがっこう",
"所在位置": "愛媛県"
},
"松山南高等学校": {
"読み方": "まつやまみなみこうとうがっこう",
"所在位置": "愛媛県"
},
"三島高等学校": {
"読み方": "みしまこうとうがっこう",
"所在位置": "愛媛県"
},
"八幡浜高等学校": {
"読み方": "やわたはまこうとうがっこう",
"所在位置": "愛媛県"
},
"吉田高等学校": {
"読み方": "よしだこうとうがっこう",
"所在位置": "山梨県"
},
"愛媛大学附属高等学校": {
"読み方": "えひめだいがくふぞくこうとうがっこう",
"所在位置": "愛媛県"
},
"オイスカ浜松国際高等学校": {
"読み方": "おいすかはままつこくさいこうとうがっこう",
"所在位置": "静岡県"
},
"桜花学園高等学校": {
"読み方": "おうかがくえんこうとうがっこう",
"所在位置": "愛知県"
},
"近江高等学校": {
"読み方": "おうみこうとうがっこう",
"所在位置": "滋賀県"
},
"近江兄弟社高等学校": {
"読み方": "おうみきょうだいしゃこうとうがっこう",
"所在位置": "滋賀県"
},
"大分高等学校": {
"読み方": "おおいたこうとうがっこう",
"所在位置": "大分県"
},
"宇佐高等学校": {
"読み方": "うさこうとうがっこう",
"所在位置": "大分県"
},
"臼杵高等学校": {
"読み方": "うすきこうとうがっこう",
"所在位置": "大分県"
},
"大分上野丘高等学校": {
"読み方": "おおいたうえのがおかこうとうがっこう",
"所在位置": "大分県"
},
"大分雄城台高等学校": {
"読み方": "おおいたおぎのだいこうとうがっこう",
"所在位置": "大分県"
},
"大分工業高等学校": {
"読み方": "おおいたこうぎょうこうとうがっこう",
"所在位置": "大分県"
},
"大分商業高等学校": {
"読み方": "おおいたしょうぎょうこうとうがっこう",
"所在位置": "大分県"
},
"大分鶴崎高等学校": {
"読み方": "おおいたつるさきこうとうがっこう",
"所在位置": "大分県"
},
"大分西高等学校": {
"読み方": "おおいたにしこうとうがっこう",
"所在位置": "大分県"
},
"大分東高等学校": {
"読み方": "おおいたひがしこうとうがっこう",
"所在位置": "大分県"
},
"大分豊府高等学校": {
"読み方": "おおいたほうふこうとうがっこう",
"所在位置": "大分県"
},
"大分舞鶴高等学校": {
"読み方": "おおいたまいづるこうとうがっこう",
"所在位置": "大分県"
},
"大分南高等学校": {
"読み方": "おおいたみなみこうとうがっこう",
"所在位置": "大分県"
},
"杵築高等学校": {
"読み方": "きつきこうとうがっこう",
"所在位置": "大分県"
},
"玖珠美山高等学校": {
"読み方": "くすみやまこうとうがっこう",
"所在位置": "大分県"
},
"国東高等学校": {
"読み方": "くにさきこうとうがっこう",
"所在位置": "大分県"
},
"芸術緑丘高等学校": {
"読み方": "げいじゅつみどりがおかこうとうがっこう",
"所在位置": "大分県"
},
"佐伯鶴城高等学校": {
"読み方": "さいきかくじょうこうとうがっこう",
"所在位置": "大分県"
},
"佐伯豊南高等学校": {
"読み方": "さいきほうなんこうとうがっこう",
"所在位置": "大分県"
},
"情報科学高等学校": {
"読み方": "じょうほうかがくこうとうがっこう",
"所在位置": "島根県"
},
"竹田高等学校": {
"読み方": "たけたこうとうがっこう",
"所在位置": "大分県"
},
"津久見高等学校": {
"読み方": "つくみこうとうがっこう",
"所在位置": "大分県"
},
"鶴崎工業高等学校": {
"読み方": "つるさきこうぎょうこうとうがっこう",
"所在位置": "大分県"
},
"中津北高等学校": {
"読み方": "なかつきたこうとうがっこう",
"所在位置": "大分県"
},
"中津東高等学校": {
"読み方": "なかつひがしこうとうがっこう",
"所在位置": "大分県"
},
"中津南高等学校": {
"読み方": "なかつみなみこうとうがっこう",
"所在位置": "大分県"
},
"日田高等学校": {
"読み方": "ひたこうとうがっこう",
"所在位置": "大分県"
},
"日田三隈高等学校": {
"読み方": "ひたみくまこうとうがっこう",
"所在位置": "大分県"
},
"日田林工高等学校": {
"読み方": "ひたりんこうこうとうがっこう",
"所在位置": "大分県"
},
"別府翔青高等学校": {
"読み方": "べっぷしょうせいこうとうがっこう",
"所在位置": "大分県"
},
"別府鶴見丘高等学校": {
"読み方": "べっぷつるみがおかこうとうがっこう",
"所在位置": "大分県"
},
"由布高等学校": {
"読み方": "ゆふこうとうがっこう",
"所在位置": "大分県"
},
"大分国際情報高等学校": {
"読み方": "おおいたこくさいじょうほうこうとうがっこう",
"所在位置": "大分県"
},
"大分東明高等学校": {
"読み方": "おおいたとうめいこうとうがっこう",
"所在位置": "大分県"
},
"大垣日本大学高等学校": {
"読み方": "おおがきにほんだいがくこうとうがっこう",
"所在位置": "岐阜県"
},
"太田市立太田高等学校": {
"読み方": "おおたしりつおおたこうとうがっこう",
"所在位置": "群馬県"
},
"大多和学園 開星高等学校": {
"読み方": "おおたわがくえんかいせいこうとうがっこう",
"所在位置": "島根県"
},
"大妻嵐山高等学校": {
"読み方": "おおつまらんざんこうとうがっこう",
"所在位置": "埼玉県"
},
"鵬学園高等学校": {
"読み方": "おおとりがくえんこうとうがっこう",
"所在位置": "石川県"
},
"大西学園高等学校": {
"読み方": "おおにしがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"大宮開成高等学校": {
"読み方": "おおみやかいせいこうとうがっこう",
"所在位置": "埼玉県"
},
"大牟田高等学校": {
"読み方": "おおむたこうとうがっこう",
"所在位置": "福岡県"
},
"岡山高等学校": {
"読み方": "おかやまこうとうがっこう",
"所在位置": "岡山県"
},
"岡山学芸館高等学校": {
"読み方": "おかやまがくげいかんこうとうがっこう",
"所在位置": "岡山県"
},
"作陽学園高等学校": {
"読み方": "さくようがくえんこうとうがっこう",
"所在位置": "岡山県"
},
"岡山県高梁日新高等学校": {
"読み方": "おかやまけんたかはしにっしんこうとうがっこう",
"所在位置": "岡山県"
},
"岡山県美作高等学校": {
"読み方": "おかやまけんみまさかこうとうがっこう",
"所在位置": "岡山県"
},
"井原高等学校 北校地": {
"読み方": "いはらこうとうがっこう きたこうち",
"所在位置": "岡山県"
},
"烏城高等学校": {
"読み方": "うじょうこうとうがっこう",
"所在位置": "岡山県"
},
"岡山一宮高等学校": {
"読み方": "おかやまいちのみやこうとうがっこう",
"所在位置": "岡山県"
},
"岡山工業高等学校": {
"読み方": "おかやまこうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"岡山城東高等学校": {
"読み方": "おかやまじょうとうこうとうがっこう",
"所在位置": "岡山県"
},
"岡山操山高等学校": {
"読み方": "おかやまそうざんこうとうがっこう",
"所在位置": "岡山県"
},
"岡山大安寺中等教育学校 後期課程": {
"読み方": "おかやまだいあんじちゅうとうきょういくがっこう こうきかてい",
"所在位置": "岡山県"
},
"岡山東商業高等学校": {
"読み方": "おかやまひがししょうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"岡山芳泉高等学校": {
"読み方": "おかやまほうせんこうとうがっこう",
"所在位置": "岡山県"
},
"岡山御津高等学校": {
"読み方": "おかやまみつこうとうがっこう",
"所在位置": "岡山県"
},
"岡山南高等学校": {
"読み方": "おかやまみなみこうとうがっこう",
"所在位置": "岡山県"
},
"邑久高等学校": {
"読み方": "おくこうとうがっこう",
"所在位置": "岡山県"
},
"真庭高等学校落合校地": {
"読み方": "まにわこうとうがっこうおちあいこうち",
"所在位置": "岡山県"
},
"笠岡高等学校": {
"読み方": "かさおかこうとうがっこう",
"所在位置": "岡山県"
},
"笠岡工業高等学校": {
"読み方": "かさおかこうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"笠岡商業高等学校": {
"読み方": "かさおかしょうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"勝間田高等学校": {
"読み方": "かつまだこうとうがっこう",
"所在位置": "岡山県"
},
"勝山高等学校 勝山校地": {
"読み方": "かつやまこうとうがっこう かつやまこうち",
"所在位置": "岡山県"
},
"鴨方高等学校": {
"読み方": "かもがたこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷天城高等学校": {
"読み方": "くらしきあまきこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷工業高等学校": {
"読み方": "くらしきこうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷古城池高等学校": {
"読み方": "くらしきこじょういけこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷商業高等学校": {
"読み方": "くらしきしょうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷青陵高等学校": {
"読み方": "くらしきせいりょうこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷中央高等学校": {
"読み方": "くらしきちゅうおうこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷南高等学校": {
"読み方": "くらしきみなみこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷鷲羽高等学校": {
"読み方": "くらしきわしゅうこうとうがっこう",
"所在位置": "岡山県"
},
"興陽高等学校": {
"読み方": "こうようこうとうがっこう",
"所在位置": "岡山県"
},
"西大寺高等学校": {
"読み方": "さいだいじこうとうがっこう",
"所在位置": "岡山県"
},
"瀬戸南高等学校": {
"読み方": "せとみなみこうとうがっこう",
"所在位置": "岡山県"
},
"総社高等学校": {
"読み方": "そうじゃこうとうがっこう",
"所在位置": "岡山県"
},
"総社南高等学校": {
"読み方": "そうじゃみなみこうとうがっこう",
"所在位置": "岡山県"
},
"高梁高等学校": {
"読み方": "たかはしこうとうがっこう",
"所在位置": "岡山県"
},
"高梁城南高等学校": {
"読み方": "たかはしじょうなんこうとうがっこう",
"所在位置": "岡山県"
},
"高松農業高等学校": {
"読み方": "たかまつのうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"玉島高等学校": {
"読み方": "たましまこうとうがっこう",
"所在位置": "岡山県"
},
"玉島商業高等学校": {
"読み方": "たましましょうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"玉野高等学校": {
"読み方": "たまのこうとうがっこう",
"所在位置": "岡山県"
},
"玉野光南高等学校": {
"読み方": "たまのこうなんこうとうがっこう",
"所在位置": "岡山県"
},
"津山高等学校": {
"読み方": "つやまこうとうがっこう",
"所在位置": "岡山県"
},
"津山工業高等学校": {
"読み方": "つやまこうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"津山商業高等学校": {
"読み方": "つやましょうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"津山東高等学校": {
"読み方": "つやまひがしこうとうがっこう",
"所在位置": "岡山県"
},
"新見高等学校南校地": {
"読み方": "にいみこうとうがっこうみなみこうち",
"所在位置": "岡山県"
},
"東岡山工業高等学校": {
"読み方": "ひがしおかやまこうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"備前緑陽高等学校": {
"読み方": "びぜんりょくようこうとうがっこう",
"所在位置": "岡山県"
},
"水島工業高等学校": {
"読み方": "みずしまこうぎょうこうとうがっこう",
"所在位置": "岡山県"
},
"矢掛高等学校": {
"読み方": "やかげこうとうがっこう",
"所在位置": "岡山県"
},
"林野高等学校": {
"読み方": "はやしのこうとうがっこう",
"所在位置": "岡山県"
},
"和気閑谷高等学校": {
"読み方": "わけしずたにこうとうがっこう",
"所在位置": "岡山県"
},
"おかやま山陽高等学校": {
"読み方": "おかやまさんようこうとうがっこう",
"所在位置": "岡山県"
},
"岡山商科大学附属高等学校": {
"読み方": "おかやましょうかだいがくふぞくこうとうがっこう",
"所在位置": "岡山県"
},
"岡山市立岡山後楽館高等学校": {
"読み方": "おかやましりつおかやまこうらくかんこうとうがっこう",
"所在位置": "岡山県"
},
"岡山白陵高等学校": {
"読み方": "おかやまはくりょうこうとうがっこう",
"所在位置": "岡山県"
},
"岡山理科大学附属高等学校": {
"読み方": "おかやまりかだいがくふぞくこうとうがっこう",
"所在位置": "岡山県"
},
"岡山龍谷高等学校": {
"読み方": "おかやまりゅうこくこうとうがっこう",
"所在位置": "岡山県"
},
"沖学園高等学校": {
"読み方": "おきがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"沖縄カトリック高等学校": {
"読み方": "おきなわかとりっくこうとうがっこう",
"所在位置": "沖縄県"
},
"石川高等学校": {
"読み方": "いしかわこうとうがっこう",
"所在位置": "福島県"
},
"糸満高等学校": {
"読み方": "いとまんこうとうがっこう",
"所在位置": "沖縄県"
},
"浦添高等学校": {
"読み方": "うらそえこうとうがっこう",
"所在位置": "沖縄県"
},
"浦添工業高等学校": {
"読み方": "うらそえこうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"浦添商業高等学校": {
"読み方": "うらそえしょうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"沖縄工業高等学校": {
"読み方": "おきなわこうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"開邦高等学校": {
"読み方": "かいほうこうとうがっこう",
"所在位置": "沖縄県"
},
"嘉手納高等学校": {
"読み方": "かでなこうとうがっこう",
"所在位置": "沖縄県"
},
"北谷高等学校": {
"読み方": "ちゃたんこうとうがっこう",
"所在位置": "沖縄県"
},
"北中城高等学校": {
"読み方": "きたなかぐすくこうとうがっこう",
"所在位置": "沖縄県"
},
"北山高等学校": {
"読み方": "ほくざんこうとうがっこう",
"所在位置": "沖縄県"
},
"宜野湾高等学校": {
"読み方": "ぎのわんこうとうがっこう",
"所在位置": "沖縄県"
},
"球陽高等学校": {
"読み方": "きゅうようこうとうがっこう",
"所在位置": "沖縄県"
},
"具志川高等学校": {
"読み方": "ぐしかわこうとうがっこう",
"所在位置": "沖縄県"
},
"具志川商業高等学校": {
"読み方": "ぐしかわしょうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"向陽高等学校": {
"読み方": "こうようこうとうがっこう",
"所在位置": "和歌山県"
},
"コザ高等学校": {
"読み方": "こざこうとうがっこう",
"所在位置": "沖縄県"
},
"首里高等学校": {
"読み方": "しゅりこうとうがっこう",
"所在位置": "沖縄県"
},
"首里東高等学校": {
"読み方": "しゅりひがしこうとうがっこう",
"所在位置": "沖縄県"
},
"小禄高等学校": {
"読み方": "おろくこうとうがっこう",
"所在位置": "沖縄県"
},
"知念高等学校": {
"読み方": "ちねんこうとうがっこう",
"所在位置": "沖縄県"
},
"中部商業高等学校": {
"読み方": "ちゅうぶしょうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"中部農林高等学校": {
"読み方": "ちゅうぶのうりんこうとうがっこう",
"所在位置": "沖縄県"
},
"泊高等学校": {
"読み方": "とまりこうとうがっこう",
"所在位置": "沖縄県"
},
"豊見城高等学校": {
"読み方": "とみしろこうとうがっこう",
"所在位置": "沖縄県"
},
"豊見城南高等学校": {
"読み方": "とみしろみなみこうとうがっこう",
"所在位置": "沖縄県"
},
"名護高等学校": {
"読み方": "なごこうとうがっこう",
"所在位置": "沖縄県"
},
"名護商工高等学校": {
"読み方": "なごしょうこうこうとうがっこう",
"所在位置": "沖縄県"
},
"那覇高等学校": {
"読み方": "なはこうとうがっこう",
"所在位置": "沖縄県"
},
"那覇工業高等学校": {
"読み方": "なはこうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"那覇国際高等学校": {
"読み方": "なはこくさいこうとうがっこう",
"所在位置": "沖縄県"
},
"那覇商業高等学校": {
"読み方": "なはしょうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"那覇西高等学校": {
"読み方": "なはにしこうとうがっこう",
"所在位置": "沖縄県"
},
"南部商業高等学校": {
"読み方": "なんぶしょうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"南部農林高等学校": {
"読み方": "なんぶのうりんこうとうがっこう",
"所在位置": "沖縄県"
},
"西原高等学校": {
"読み方": "にしはらこうとうがっこう",
"所在位置": "沖縄県"
},
"南風原高等学校": {
"読み方": "はえばるこうとうがっこう",
"所在位置": "沖縄県"
},
"普天間高等学校": {
"読み方": "ふてんまこうとうがっこう",
"所在位置": "沖縄県"
},
"本部高等学校": {
"読み方": "もとぶこうとうがっこう",
"所在位置": "沖縄県"
},
"前原高等学校": {
"読み方": "まえはらこうとうがっこう",
"所在位置": "沖縄県"
},
"真和志高等学校": {
"読み方": "まわしこうとうがっこう",
"所在位置": "沖縄県"
},
"美里高等学校": {
"読み方": "みさとこうとうがっこう",
"所在位置": "沖縄県"
},
"美里工業高等学校": {
"読み方": "みさとこうぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"宮古総合実業高等学校": {
"読み方": "みやこそうごうじつぎょうこうとうがっこう",
"所在位置": "沖縄県"
},
"美来工科高等学校": {
"読み方": "みらいこうかこうとうがっこう",
"所在位置": "沖縄県"
},
"八重山高等学校": {
"読み方": "やえやまこうとうがっこう",
"所在位置": "沖縄県"
},
"陽明高等学校": {
"読み方": "ようめいこうとうがっこう",
"所在位置": "沖縄県"
},
"与勝高等学校": {
"読み方": "よかつこうとうがっこう",
"所在位置": "沖縄県"
},
"読谷高等学校": {
"読み方": "よみたんこうとうがっこう",
"所在位置": "沖縄県"
},
"沖縄尚学高等学校": {
"読み方": "おきなわしょうがくこうとうがっこう",
"所在位置": "沖縄県"
},
"尾道高等学校": {
"読み方": "おのみちこうとうがっこう",
"所在位置": "広島県"
},
"金沢龍谷高等学校": {
"読み方": "かなざわりゅうこくこうとうがっこう",
"所在位置": "石川県"
},
"折尾愛真高等学校": {
"読み方": "おりおあいしんこうとうがっこう",
"所在位置": "福岡県"
},
"開志学園高等学校": {
"読み方": "かいしがくえんこうとうがっこう",
"所在位置": "新潟県"
},
"開新高等学校": {
"読み方": "かいしんこうとうがっこう",
"所在位置": "熊本県"
},
"開智高等学校": {
"読み方": "かいちこうとうがっこう",
"所在位置": "埼玉県"
},
"大手前丸亀高等学校": {
"読み方": "おおてまえまるかめこうとうがっこう",
"所在位置": "香川県"
},
"大手前高松高等学校": {
"読み方": "おおてまえたかまつこうとうがっこう",
"所在位置": "香川県"
},
"飯山高等学校": {
"読み方": "いいやまこうとうがっこう",
"所在位置": "長野県"
},
"石田高等学校": {
"読み方": "いしだこうとうがっこう",
"所在位置": "香川県"
},
"香川中央高等学校": {
"読み方": "かがわちゅうおうこうとうがっこう",
"所在位置": "香川県"
},
"笠田高等学校": {
"読み方": "かせだこうとうがっこう",
"所在位置": "和歌山県"
},
"観音寺第一高等学校": {
"読み方": "かんおんじだいいちこうとうがっこう",
"所在位置": "香川県"
},
"観音寺総合高等学校": {
"読み方": "かんおんじそうごうこうとうがっこう",
"所在位置": "香川県"
},
"琴平高等学校": {
"読み方": "ことひらこうとうがっこう",
"所在位置": "香川県"
},
"坂出高等学校": {
"読み方": "さかいでこうとうがっこう",
"所在位置": "香川県"
},
"坂出工業高等学校": {
"読み方": "さかいでこうぎょうこうとうがっこう",
"所在位置": "香川県"
},
"坂出商業高等学校": {
"読み方": "さかいでしょうぎょうこうとうがっこう",
"所在位置": "香川県"
},
"三本松高等学校": {
"読み方": "さんぼんまつこうとうがっこう",
"所在位置": "香川県"
},
"志度高等学校": {
"読み方": "しどこうとうがっこう",
"所在位置": "香川県"
},
"善通寺第一高等学校": {
"読み方": "ぜんつうじだいいちこうとうがっこう",
"所在位置": "香川県"
},
"高瀬高等学校": {
"読み方": "たかせこうとうがっこう",
"所在位置": "香川県"
},
"高松高等学校": {
"読み方": "たかまつこうとうがっこう",
"所在位置": "香川県"
},
"高松北高等学校": {
"読み方": "たかまつきたこうとうがっこう",
"所在位置": "香川県"
},
"高松工芸高等学校": {
"読み方": "たかまつこうげいこうとうがっこう",
"所在位置": "香川県"
},
"高松桜井高等学校": {
"読み方": "たかまつさくらいこうとうがっこう",
"所在位置": "香川県"
},
"高松商業高等学校": {
"読み方": "たかまつしょうぎょうこうとうがっこう",
"所在位置": "香川県"
},
"高松西高等学校": {
"読み方": "たかまつにしこうとうがっこう",
"所在位置": "香川県"
},
"高松東高等学校": {
"読み方": "たかまつひがしこうとうがっこう",
"所在位置": "香川県"
},
"高松南高等学校": {
"読み方": "たかまつみなみこうとうがっこう",
"所在位置": "香川県"
},
"多度津高等学校": {
"読み方": "たどつこうとうがっこう",
"所在位置": "香川県"
},
"津田高等学校": {
"読み方": "つだこうとうがっこう",
"所在位置": "香川県"
},
"農業経営高等学校": {
"読み方": "のうぎょうけいえいこうとうがっこう",
"所在位置": "香川県"
},
"丸亀高等学校": {
"読み方": "まるがめこうとうがっこう",
"所在位置": "香川県"
},
"丸亀城西高等学校": {
"読み方": "まるがめじょうせいこうとうがっこう",
"所在位置": "香川県"
},
"三木高等学校": {
"読み方": "みきこうとうがっこう",
"所在位置": "兵庫県"
},
"香川誠陵高等学校": {
"読み方": "かがわせいりょうこうとうがっこう",
"所在位置": "香川県"
},
"四国学院大学香川西高等学校": {
"読み方": "しこくがくいんだいがくかがわにしこうとうがっこう",
"所在位置": "香川県"
},
"杜若高等学校": {
"読み方": "とじゃくこうとうがっこう",
"所在位置": "愛知県"
},
"津田学園高等学校": {
"読み方": "つだがくえんこうとうがっこう",
"所在位置": "三重県"
},
"鹿児島高等学校": {
"読み方": "かごしまこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島育英館高等学校": {
"読み方": "かごしまいくえいかんこうとうがっこう",
"所在位置": "鹿児島県"
},
"奄美高等学校": {
"読み方": "あまみこうとうがっこう",
"所在位置": "鹿児島県"
},
"伊佐農林高等学校": {
"読み方": "いさのうりんこうとうがっこう",
"所在位置": "鹿児島県"
},
"伊集院高等学校": {
"読み方": "いじゅういんこうとうがっこう",
"所在位置": "鹿児島県"
},
"出水高等学校": {
"読み方": "いずみこうとうがっこう",
"所在位置": "鹿児島県"
},
"市来農芸高等学校": {
"読み方": "いちきのうげいこうとうがっこう",
"所在位置": "鹿児島県"
},
"指宿高等学校": {
"読み方": "いぶすきこうとうがっこう",
"所在位置": "鹿児島県"
},
"大口高等学校": {
"読み方": "おおくちこうとうがっこう",
"所在位置": "鹿児島県"
},
"大島高等学校": {
"読み方": "おおしまこうとうがっこう",
"所在位置": "鹿児島県"
},
"開陽高等学校（通信制）": {
"読み方": "かいようこうとうがっこうつうしんせい",
"所在位置": "鹿児島県"
},
"鶴翔高等学校": {
"読み方": "かくしょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島工業高等学校": {
"読み方": "かごしまこうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島中央高等学校": {
"読み方": "かごしまちゅうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島東高等学校": {
"読み方": "かごしまひがしこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島南高等学校": {
"読み方": "かごしまみなみこうとうがっこう",
"所在位置": "鹿児島県"
},
"加治木高等学校": {
"読み方": "かじきこうとうがっこう",
"所在位置": "鹿児島県"
},
"加治木工業高等学校": {
"読み方": "かじきこうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"加世田高等学校": {
"読み方": "かせだこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿屋高等学校": {
"読み方": "かのやこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿屋工業高等学校": {
"読み方": "かのやこうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿屋農業高等学校": {
"読み方": "かのやのうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"蒲生高等学校": {
"読み方": "かもうこうとうがっこう",
"所在位置": "鹿児島県"
},
"川内高等学校": {
"読み方": "せんだいこうとうがっこう",
"所在位置": "鹿児島県"
},
"川辺高等学校": {
"読み方": "かわなべこうとうがっこう",
"所在位置": "鹿児島県"
},
"霧島高等学校": {
"読み方": "きりしまこうとうがっこう",
"所在位置": "鹿児島県"
},
"錦江湾高等学校": {
"読み方": "きんこうわんこうとうがっこう",
"所在位置": "鹿児島県"
},
"串木野高等学校": {
"読み方": "くしきのこうとうがっこう",
"所在位置": "鹿児島県"
},
"串良商業高等学校": {
"読み方": "くしらしょうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"甲南高等学校": {
"読み方": "こうなんこうとうがっこう",
"所在位置": "滋賀県"
},
"国分高等学校": {
"読み方": "こくぶんこうとうがっこう",
"所在位置": "千葉県"
},
"薩南工業高等学校": {
"読み方": "さつなんこうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"薩摩中央高等学校": {
"読み方": "さつまちゅうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"志布志高等学校": {
"読み方": "しぶしこうとうがっこう",
"所在位置": "鹿児島県"
},
"松陽高等学校": {
"読み方": "しょうようこうとうがっこう",
"所在位置": "兵庫県"
},
"川薩清修館高等学校": {
"読み方": "せんさつせいしゅうかんこうとうがっこう",
"所在位置": "鹿児島県"
},
"川内商工高等学校": {
"読み方": "せんだいしょうこうこうとうがっこう",
"所在位置": "鹿児島県"
},
"武岡台高等学校": {
"読み方": "たけおかだいこうとうがっこう",
"所在位置": "鹿児島県"
},
"種子島高等学校": {
"読み方": "たねがしまこうとうがっこう",
"所在位置": "鹿児島県"
},
"鶴丸高等学校": {
"読み方": "つるまるこうとうがっこう",
"所在位置": "鹿児島県"
},
"野田女子高等学校": {
"読み方": "のだじょしこうとうがっこう",
"所在位置": "鹿児島県"
},
"隼人工業高等学校": {
"読み方": "はやとこうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"吹上高等学校": {
"読み方": "ふきあげこうとうがっこう",
"所在位置": "鹿児島県"
},
"福山高等学校": {
"読み方": "ふくやまこうとうがっこう",
"所在位置": "鹿児島県"
},
"枕崎高等学校": {
"読み方": "まくらざきこうとうがっこう",
"所在位置": "鹿児島県"
},
"明桜館高等学校": {
"読み方": "めいおうかんこうとうがっこう",
"所在位置": "鹿児島県"
},
"屋久島高等学校": {
"読み方": "やくしまこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島実業高等学校": {
"読み方": "かごしまじつぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島純心女子高等学校": {
"読み方": "かごしまじゅんしんじょしこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島城西高等学校": {
"読み方": "かごしまじょうせいこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島情報高等学校": {
"読み方": "かごしまじょうほうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島市立鹿児島玉龍高等学校": {
"読み方": "かごしましりつかごしまぎょくりゅうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島市立鹿児島商業高等学校": {
"読み方": "かごしましりつかごしましょうぎょうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島市立鹿児島女子高等学校": {
"読み方": "かごしましりつかごしまじょしこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿児島第一高等学校": {
"読み方": "かごしまだいいちこうとうがっこう",
"所在位置": "鹿児島県"
},
"龍桜高等学校": {
"読み方": "りゅうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"橿原学院高等学校": {
"読み方": "かしはらがくいんこうとうがっこう",
"所在位置": "奈良県"
},
"鹿島学園高等学校": {
"読み方": "かしまがくえんこうとうがっこう",
"所在位置": "茨城県"
},
"柏木学園高等学校": {
"読み方": "かしわぎがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"柏市立柏高等学校": {
"読み方": "かしわしりつかしわこうとうがっこう",
"所在位置": "千葉県"
},
"日本体育大学柏高等学校": {
"読み方": "にほんたいいくだいがくかしわこうとうがっこう",
"所在位置": "千葉県"
},
"中部大学春日丘高等学校": {
"読み方": "ちゅうぶだいがくはるひがおかこうとうがっこう",
"所在位置": "愛知県"
},
"春日部共栄高等学校": {
"読み方": "かすかべきょうえいこうとうがっこう",
"所在位置": "埼玉県"
},
"霞ヶ浦高等学校": {
"読み方": "かすみがうらこうとうがっこう",
"所在位置": "茨城県"
},
"片山学園高等学校": {
"読み方": "かたやまがくえんこうとうがっこう",
"所在位置": "富山県"
},
"学校法人石川高等学校": {
"読み方": "がっこうほうじんいしかわこうとうがっこう",
"所在位置": "福島県"
},
"活水高等学校": {
"読み方": "かつすいこうとうがっこう",
"所在位置": "長崎県"
},
"加藤学園高等学校": {
"読み方": "かとうがくえんこうとうがっこう",
"所在位置": "静岡県"
},
"加藤学園暁秀高等学校": {
"読み方": "かとうがくえんぎょうしゅうこうとうがっこう",
"所在位置": "静岡県"
},
"神奈川学園高等学校": {
"読み方": "かながわがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"愛川高等学校": {
"読み方": "あいかわこうとうがっこう",
"所在位置": "神奈川県"
},
"相原高等学校": {
"読み方": "あいはらこうとうがっこう",
"所在位置": "神奈川県"
},
"旭高等学校": {
"読み方": "あさひこうとうがっこう",
"所在位置": "神奈川県"
},
"麻溝台高等学校": {
"読み方": "あさみぞだいこうとうがっこう",
"所在位置": "神奈川県"
},
"足柄高等学校": {
"読み方": "あしがらこうとうがっこう",
"所在位置": "神奈川県"
},
"麻生総合高等学校": {
"読み方": "あさおそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"厚木高等学校": {
"読み方": "あつぎこうとうがっこう",
"所在位置": "神奈川県"
},
"厚木北高等学校": {
"読み方": "あつぎきたこうとうがっこう",
"所在位置": "神奈川県"
},
"厚木商業高等学校": {
"読み方": "あつぎしょうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"厚木清南高等学校": {
"読み方": "あつぎせいなんこうとうがっこう",
"所在位置": "神奈川県"
},
"厚木西高等学校": {
"読み方": "あつぎにしこうとうがっこう",
"所在位置": "神奈川県"
},
"厚木東高等学校": {
"読み方": "あつぎひがしこうとうがっこう",
"所在位置": "神奈川県"
},
"綾瀬高等学校": {
"読み方": "あやせこうとうがっこう",
"所在位置": "神奈川県"
},
"綾瀬西高等学校": {
"読み方": "あやせにしこうとうがっこう",
"所在位置": "神奈川県"
},
"有馬高等学校": {
"読み方": "ありまこうとうがっこう",
"所在位置": "兵庫県"
},
"生田高等学校": {
"読み方": "いくたこうとうがっこう",
"所在位置": "神奈川県"
},
"生田東高等学校": {
"読み方": "いくたひがしこうとうがっこう",
"所在位置": "神奈川県"
},
"伊志田高等学校": {
"読み方": "いしだこうとうがっこう",
"所在位置": "神奈川県"
},
"伊勢原高等学校": {
"読み方": "いせはらこうとうがっこう",
"所在位置": "神奈川県"
},
"磯子工業高等学校": {
"読み方": "いそごこうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"市ヶ尾高等学校": {
"読み方": "いちがおこうとうがっこう",
"所在位置": "神奈川県"
},
"荏田高等学校": {
"読み方": "えだこうとうがっこう",
"所在位置": "神奈川県"
},
"海老名高等学校": {
"読み方": "えびなこうとうがっこう",
"所在位置": "神奈川県"
},
"大井高等学校": {
"読み方": "おおいこうとうがっこう",
"所在位置": "神奈川県"
},
"大磯高等学校": {
"読み方": "おおいそこうとうがっこう",
"所在位置": "神奈川県"
},
"小田原高等学校": {
"読み方": "おだわらこうとうがっこう",
"所在位置": "神奈川県"
},
"小田原城北工業高等学校": {
"読み方": "おだわらじょうほくこうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"小田原東高等学校": {
"読み方": "おだわらひがしこうとうがっこう",
"所在位置": "神奈川県"
},
"追浜高等学校": {
"読み方": "おっぱまこうとうがっこう",
"所在位置": "神奈川県"
},
"海洋科学高等学校": {
"読み方": "かいようかがくこうとうがっこう",
"所在位置": "神奈川県"
},
"金井高等学校": {
"読み方": "かないこうとうがっこう",
"所在位置": "神奈川県"
},
"神奈川工業高等学校": {
"読み方": "かながわこうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"神奈川総合高等学校": {
"読み方": "かながわそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"神奈川総合産業高等学校": {
"読み方": "かながわそうごうさんぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"金沢総合高等学校": {
"読み方": "かなざわそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"鎌倉高等学校": {
"読み方": "かまくらこうとうがっこう",
"所在位置": "神奈川県"
},
"釜利谷高等学校": {
"読み方": "かまりやこうとうがっこう",
"所在位置": "神奈川県"
},
"上鶴間高等学校": {
"読み方": "かみつるまこうとうがっこう",
"所在位置": "神奈川県"
},
"上溝高等学校": {
"読み方": "かみみぞこうとうがっこう",
"所在位置": "神奈川県"
},
"上溝南高等学校": {
"読み方": "かみみぞみなみこうとうがっこう",
"所在位置": "神奈川県"
},
"上矢部高等学校": {
"読み方": "かみやべこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎高等学校": {
"読み方": "かわさきこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎北高等学校": {
"読み方": "かわさききたこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎工科高等学校": {
"読み方": "かわさきこうかこうとうがっこう",
"所在位置": "神奈川県"
},
"川和高等学校": {
"読み方": "かわわこうとうがっこう",
"所在位置": "神奈川県"
},
"岸根高等学校": {
"読み方": "きしねこうとうがっこう",
"所在位置": "神奈川県"
},
"希望ケ丘高等学校": {
"読み方": "きぼうがおかこうとうがっこう",
"所在位置": "神奈川県"
},
"霧が丘高等学校": {
"読み方": "きりがおかこうとうがっこう",
"所在位置": "神奈川県"
},
"港北高等学校": {
"読み方": "こうほくこうとうがっこう",
"所在位置": "神奈川県"
},
"光陵高等学校": {
"読み方": "こうりょうこうとうがっこう",
"所在位置": "福岡県"
},
"相模原中等教育学校 後期課程": {
"読み方": "さがみはらちゅうとうきょういくがっこう こうきかてい",
"所在位置": "神奈川県"
},
"相模向陽館高等学校": {
"読み方": "さがみこうようかんこうとうがっこう",
"所在位置": "神奈川県"
},
"相模田名高等学校": {
"読み方": "さがみたなこうとうがっこう",
"所在位置": "神奈川県"
},
"相模原高等学校": {
"読み方": "さがみはらこうとうがっこう",
"所在位置": "神奈川県"
},
"相模原青陵高等学校": {
"読み方": "さがみはらせいりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"相模原総合高等学校": {
"読み方": "さがみはらそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"座間高等学校": {
"読み方": "ざまこうとうがっこう",
"所在位置": "神奈川県"
},
"座間総合高等学校": {
"読み方": "ざまそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"七里ガ浜高等学校": {
"読み方": "しちりがはまこうとうがっこう",
"所在位置": "神奈川県"
},
"商工高等学校": {
"読み方": "しょうこうこうとうがっこう",
"所在位置": "神奈川県"
},
"湘南高等学校": {
"読み方": "しょうなんこうとうがっこう",
"所在位置": "神奈川県"
},
"湘南台高等学校": {
"読み方": "しょうなんだいこうとうがっこう",
"所在位置": "神奈川県"
},
"城郷高等学校": {
"読み方": "しろさとこうとうがっこう",
"所在位置": "神奈川県"
},
"相模原城山高等学校": {
"読み方": "さがみはらしろやまこうとうがっこう",
"所在位置": "神奈川県"
},
"新栄高等学校": {
"読み方": "しんえいこうとうがっこう",
"所在位置": "神奈川県"
},
"新城高等学校": {
"読み方": "しんじょうこうとうがっこう",
"所在位置": "神奈川県"
},
"菅高等学校": {
"読み方": "すげこうとうがっこう",
"所在位置": "神奈川県"
},
"逗子高等学校": {
"読み方": "ずしこうとうがっこう",
"所在位置": "神奈川県"
},
"住吉高等学校": {
"読み方": "すみよしこうとうがっこう",
"所在位置": "神奈川県"
},
"逗葉高等学校": {
"読み方": "ずようこうとうがっこう",
"所在位置": "神奈川県"
},
"西湘高等学校": {
"読み方": "せいしょうこうとうがっこう",
"所在位置": "神奈川県"
},
"瀬谷高等学校": {
"読み方": "せやこうとうがっこう",
"所在位置": "神奈川県"
},
"瀬谷西高等学校": {
"読み方": "せやにしこうとうがっこう",
"所在位置": "神奈川県"
},
"寒川高等学校": {
"読み方": "さむかわこうとうがっこう",
"所在位置": "神奈川県"
},
"大師高等学校": {
"読み方": "だいしこうとうがっこう",
"所在位置": "神奈川県"
},
"大船高等学校": {
"読み方": "おおふなこうとうがっこう",
"所在位置": "神奈川県"
},
"大和西高等学校": {
"読み方": "やまとにしこうとうがっこう",
"所在位置": "神奈川県"
},
"田奈高等学校": {
"読み方": "たなこうとうがっこう",
"所在位置": "神奈川県"
},
"多摩高等学校": {
"読み方": "たまこうとうがっこう",
"所在位置": "神奈川県"
},
"茅ヶ崎高等学校": {
"読み方": "ちがさきこうとうがっこう",
"所在位置": "神奈川県"
},
"茅ヶ崎西浜高等学校": {
"読み方": "ちがさきにしはまこうとうがっこう",
"所在位置": "神奈川県"
},
"茅ケ崎北陵高等学校": {
"読み方": "ちがさきほくりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"中央農業高等学校": {
"読み方": "ちゅうおうのうぎょうこうとうがっこう",
"所在位置": "富山県"
},
"津久井高等学校": {
"読み方": "つくいこうとうがっこう",
"所在位置": "神奈川県"
},
"津久井浜高等学校": {
"読み方": "つくいはまこうとうがっこう",
"所在位置": "神奈川県"
},
"鶴見高等学校": {
"読み方": "つるみこうとうがっこう",
"所在位置": "神奈川県"
},
"鶴見総合高等学校": {
"読み方": "つるみそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"鶴嶺高等学校": {
"読み方": "つるみねこうとうがっこう",
"所在位置": "神奈川県"
},
"永谷高等学校": {
"読み方": "ながやこうとうがっこう",
"所在位置": "神奈川県"
},
"新羽高等学校": {
"読み方": "にっぱこうとうがっこう",
"所在位置": "神奈川県"
},
"二宮高等学校": {
"読み方": "にのみやこうとうがっこう",
"所在位置": "神奈川県"
},
"白山高等学校": {
"読み方": "はくさんこうとうがっこう",
"所在位置": "三重県"
},
"柏陽高等学校": {
"読み方": "はくようこうとうがっこう",
"所在位置": "神奈川県"
},
"橋本高等学校": {
"読み方": "はしもとこうとうがっこう",
"所在位置": "和歌山県"
},
"秦野高等学校": {
"読み方": "はだのこうとうがっこう",
"所在位置": "神奈川県"
},
"秦野総合高等学校": {
"読み方": "はだのそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"秦野曽屋高等学校": {
"読み方": "はだのそやこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜氷取沢高等学校": {
"読み方": "よこはまひとりざわこうとうがっこう",
"所在位置": "神奈川県"
},
"平塚工科高等学校": {
"読み方": "ひらつかこうかこうとうがっこう",
"所在位置": "神奈川県"
},
"平塚江南高等学校": {
"読み方": "ひらつかこうなんこうとうがっこう",
"所在位置": "神奈川県"
},
"平塚商業高等学校": {
"読み方": "ひらつかしょうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"平塚湘風高等学校": {
"読み方": "ひらつかしょうふうこうとうがっこう",
"所在位置": "神奈川県"
},
"平塚農業高等学校": {
"読み方": "ひらつかのうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"深沢高等学校": {
"読み方": "ふかさわこうとうがっこう",
"所在位置": "神奈川県"
},
"藤沢工科高等学校": {
"読み方": "ふじさわこうかこうとうがっこう",
"所在位置": "神奈川県"
},
"藤沢清流高等学校": {
"読み方": "ふじさわせいりゅうこうとうがっこう",
"所在位置": "神奈川県"
},
"藤沢総合高等学校": {
"読み方": "ふじさわそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"藤沢西高等学校": {
"読み方": "ふじさわにしこうとうがっこう",
"所在位置": "神奈川県"
},
"二俣川看護福祉高等学校": {
"読み方": "ふたまたがわかんごふくしこうとうがっこう",
"所在位置": "神奈川県"
},
"保土ヶ谷高等学校": {
"読み方": "ほどがやこうとうがっこう",
"所在位置": "神奈川県"
},
"舞岡高等学校": {
"読み方": "まいおかこうとうがっこう",
"所在位置": "神奈川県"
},
"三浦初声高等学校 入江キャンパス": {
"読み方": "みうらはっせこうとうがっこう いりえきゃんぱす",
"所在位置": "神奈川県"
},
"向の岡工業高等学校": {
"読み方": "むかいのおかこうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"元石川高等学校": {
"読み方": "もといしかわこうとうがっこう",
"所在位置": "神奈川県"
},
"弥栄高等学校": {
"読み方": "やえいこうとうがっこう",
"所在位置": "神奈川県"
},
"山北高等学校": {
"読み方": "やまきたこうとうがっこう",
"所在位置": "神奈川県"
},
"大和高等学校": {
"読み方": "やまとこうとうがっこう",
"所在位置": "神奈川県"
},
"大和東高等学校": {
"読み方": "やまとひがしこうとうがっこう",
"所在位置": "神奈川県"
},
"大和南高等学校": {
"読み方": "やまとみなみこうとうがっこう",
"所在位置": "神奈川県"
},
"百合丘高等学校": {
"読み方": "ゆりがおかこうとうがっこう",
"所在位置": "神奈川県"
},
"横須賀大津高等学校": {
"読み方": "よこすかおおつこうとうがっこう",
"所在位置": "神奈川県"
},
"横須賀工業高等学校": {
"読み方": "よこすかこうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"横須賀明光高等学校": {
"読み方": "よこすかめいこうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜桜陽高等学校": {
"読み方": "よこはまおうようこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜旭陵高等学校": {
"読み方": "よこはまきょくりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜国際高等学校": {
"読み方": "よこはまこくさいこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜栄高等学校": {
"読み方": "よこはまさかえこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜修悠館高等学校": {
"読み方": "よこはましゅうゆうかんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜翠嵐高等学校": {
"読み方": "よこはますいらんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜清陵高等学校": {
"読み方": "よこはませいりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜立野高等学校": {
"読み方": "よこはまたてのこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜南陵高等学校": {
"読み方": "よこはまなんりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜平沼高等学校": {
"読み方": "よこはまひらぬまこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜緑園高等学校": {
"読み方": "よこはまりょくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜緑ケ丘高等学校": {
"読み方": "よこはまみどりがおかこうとうがっこう",
"所在位置": "神奈川県"
},
"吉田島高等学校": {
"読み方": "よしだじまこうとうがっこう",
"所在位置": "神奈川県"
},
"神奈川大学附属高等学校": {
"読み方": "かながわだいがくふぞくこうとうがっこう",
"所在位置": "神奈川県"
},
"金沢高等学校": {
"読み方": "かなざわこうとうがっこう",
"所在位置": "石川県"
},
"金沢学院高等学校": {
"読み方": "かなざわがくいんこうとうがっこう",
"所在位置": "石川県"
},
"金沢市立工業高等学校": {
"読み方": "かなざわしりつこうぎょうこうとうがっこう",
"所在位置": "石川県"
},
"金沢大学附属高等学校": {
"読み方": "かなざわだいがくふぞくこうとうがっこう",
"所在位置": "石川県"
},
"鹿屋市立鹿屋女子高等学校": {
"読み方": "かのやしりつかのやじょしこうとうがっこう",
"所在位置": "鹿児島県"
},
"鹿屋中央高等学校": {
"読み方": "かのやちゅうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"鎌倉学園高等学校": {
"読み方": "かまくらがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"鎌倉女学院高等学校": {
"読み方": "かまくらじょがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"鎌倉女子大学高等部": {
"読み方": "かまくらじょしだいがくこうとうぶ",
"所在位置": "神奈川県"
},
"神村学園高等部": {
"読み方": "かみむらがくえんこうとうぶ",
"所在位置": "鹿児島県"
},
"加茂暁星高等学校": {
"読み方": "かもぎょうせいこうとうがっこう",
"所在位置": "新潟県"
},
"カリタス女子高等学校": {
"読み方": "かりたすじょしこうとうがっこう",
"所在位置": "神奈川県"
},
"川越市立川越高等学校": {
"読み方": "かわごえしりつかわごえこうとうがっこう",
"所在位置": "埼玉県"
},
"川越東高等学校": {
"読み方": "かわごえひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"川崎市立川崎高等学校": {
"読み方": "かわさきしりつかわさきこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎市立川崎総合科学高等学校": {
"読み方": "かわさきしりつかわさきそうごうかがくこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎市立幸高等学校": {
"読み方": "かわさきしりつさいわいこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎市立高津高等学校": {
"読み方": "かわさきしりつたかつこうとうがっこう",
"所在位置": "神奈川県"
},
"川崎市立橘高等学校": {
"読み方": "かわさきしりつたちばなこうとうがっこう",
"所在位置": "神奈川県"
},
"関西高等学校": {
"読み方": "かんぜいこうとうがっこう",
"所在位置": "岡山県"
},
"関西中央高等学校": {
"読み方": "かんさいちゅうおうこうとうがっこう",
"所在位置": "奈良県"
},
"関西学院高等部": {
"読み方": "かんせいがくいんこうとうぶ",
"所在位置": "兵庫県"
},
"関東学院高等学校": {
"読み方": "かんとうがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"関東学院六浦高等学校": {
"読み方": "かんとうがくいんむつうらこうとうがっこう",
"所在位置": "神奈川県"
},
"関東学園大学附属高等学校": {
"読み方": "かんとうがくえんだいがくふぞくこうとうがっこう",
"所在位置": "群馬県"
},
"函嶺白百合学園高等学校": {
"読み方": "かんれいしらゆりがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"菊華高等学校": {
"読み方": "きくかこうとうがっこう",
"所在位置": "愛知県"
},
"菊池女子高等学校": {
"読み方": "きくちじょしこうとうがっこう",
"所在位置": "熊本県"
},
"木更津総合高等学校": {
"読み方": "きさらづそうごうこうとうがっこう",
"所在位置": "千葉県"
},
"北鎌倉女子学園高等学校": {
"読み方": "きたかまくらじょしがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"北九州市立高等学校": {
"読み方": "きたきゅうしゅうしりつこうとうがっこう",
"所在位置": "福岡県"
},
"吉備高原学園高等学校": {
"読み方": "きびこうげんがくえんこうとうがっこう",
"所在位置": "岡山県"
},
"揖斐高等学校": {
"読み方": "いびこうとうがっこう",
"所在位置": "岐阜県"
},
"恵那高等学校": {
"読み方": "えなこうとうがっこう",
"所在位置": "岐阜県"
},
"恵那農業高等学校": {
"読み方": "えなのうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"恵那南高等学校": {
"読み方": "えなみなみこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣北高等学校": {
"読み方": "おおがききたこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣工業高等学校": {
"読み方": "おおがきこうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣桜高等学校": {
"読み方": "おおがきさくらこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣商業高等学校": {
"読み方": "おおがきしょうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣西高等学校": {
"読み方": "おおがきにしこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣東高等学校": {
"読み方": "おおがきひがしこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣南高等学校": {
"読み方": "おおがきみなみこうとうがっこう",
"所在位置": "岐阜県"
},
"大垣養老高等学校": {
"読み方": "おおがきようろうこうとうがっこう",
"所在位置": "岐阜県"
},
"海津明誠高等学校": {
"読み方": "かいづめいせいこうとうがっこう",
"所在位置": "岐阜県"
},
"各務原高等学校": {
"読み方": "かかみはらこうとうがっこう",
"所在位置": "岐阜県"
},
"各務原西高等学校": {
"読み方": "かかみがはらにしこうとうがっこう",
"所在位置": "岐阜県"
},
"可児高等学校": {
"読み方": "かにこうとうがっこう",
"所在位置": "岐阜県"
},
"可児工業高等学校": {
"読み方": "かにこうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"加納高等学校": {
"読み方": "かのうこうとうがっこう",
"所在位置": "岐阜県"
},
"加茂高等学校": {
"読み方": "かもこうとうがっこう",
"所在位置": "新潟県"
},
"加茂農林高等学校": {
"読み方": "かものうりんこうとうがっこう",
"所在位置": "新潟県"
},
"華陽フロンティア高等学校": {
"読み方": "かようふろんてぃあこうとうがっこう",
"所在位置": "岐阜県"
},
"岐山高等学校": {
"読み方": "ぎざんこうとうがっこう",
"所在位置": "岐阜県"
},
"岐南工業高等学校": {
"読み方": "ぎなんこうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜高等学校": {
"読み方": "ぎふこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜各務野高等学校": {
"読み方": "ぎふかかみのこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜北高等学校": {
"読み方": "ぎふきたこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜工業高等学校": {
"読み方": "ぎふこうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜商業高等学校": {
"読み方": "ぎふしょうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜城北高等学校": {
"読み方": "ぎふじょうほくこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜総合学園高等学校": {
"読み方": "ぎふそうごうがくえんこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜農林高等学校": {
"読み方": "ぎふのうりんこうとうがっこう",
"所在位置": "岐阜県"
},
"郡上高等学校": {
"読み方": "ぐじょうこうとうがっこう",
"所在位置": "岐阜県"
},
"郡上北高等学校": {
"読み方": "ぐじょうきたこうとうがっこう",
"所在位置": "岐阜県"
},
"関高等学校": {
"読み方": "せきこうとうがっこう",
"所在位置": "岐阜県"
},
"関有知高等学校": {
"読み方": "せきうちこうとうがっこう",
"所在位置": "岐阜県"
},
"武義高等学校": {
"読み方": "むぎこうとうがっこう",
"所在位置": "岐阜県"
},
"多治見高等学校": {
"読み方": "たじみこうとうがっこう",
"所在位置": "岐阜県"
},
"多治見北高等学校": {
"読み方": "たじみきたこうとうがっこう",
"所在位置": "岐阜県"
},
"多治見工業高等学校": {
"読み方": "たじみこうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"土岐紅陵高等学校": {
"読み方": "ときこうりょうこうとうがっこう",
"所在位置": "岐阜県"
},
"土岐商業高等学校": {
"読み方": "ときしょうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"東濃実業高等学校": {
"読み方": "とうのうじつぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"東濃フロンティア高等学校": {
"読み方": "とうのうふろんてぃあこうとうがっこう",
"所在位置": "岐阜県"
},
"中津高等学校": {
"読み方": "なかつこうとうがっこう",
"所在位置": "岐阜県"
},
"中津川工業高等学校": {
"読み方": "なかつがわこうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"中津商業高等学校": {
"読み方": "なかつしょうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"長良高等学校": {
"読み方": "ながらこうとうがっこう",
"所在位置": "岐阜県"
},
"羽島高等学校": {
"読み方": "はしまこうとうがっこう",
"所在位置": "岐阜県"
},
"羽島北高等学校": {
"読み方": "はしまきたこうとうがっこう",
"所在位置": "岐阜県"
},
"斐太高等学校": {
"読み方": "ひだこうとうがっこう",
"所在位置": "岐阜県"
},
"飛騨高山高等学校": {
"読み方": "ひだたかやまこうとうがっこう",
"所在位置": "岐阜県"
},
"不破高等学校": {
"読み方": "ふわこうとうがっこう",
"所在位置": "岐阜県"
},
"益田清風高等学校": {
"読み方": "ましたせいふうこうとうがっこう",
"所在位置": "岐阜県"
},
"瑞浪高等学校": {
"読み方": "みずなみこうとうがっこう",
"所在位置": "岐阜県"
},
"本巣松陽高等学校": {
"読み方": "もとすしょうようこうとうがっこう",
"所在位置": "岐阜県"
},
"八百津高等学校": {
"読み方": "やおつこうとうがっこう",
"所在位置": "岐阜県"
},
"吉城高等学校": {
"読み方": "よしきこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜女子高等学校": {
"読み方": "ぎふじょしこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜市立岐阜商業高等学校": {
"読み方": "ぎふしりつぎふしょうぎょうこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜聖徳学園高等学校": {
"読み方": "ぎふしょうとくがくえんこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜第一高等学校": {
"読み方": "ぎふだいいちこうとうがっこう",
"所在位置": "岐阜県"
},
"岐阜東高等学校": {
"読み方": "ぎふひがしこうとうがっこう",
"所在位置": "岐阜県"
},
"希望が丘高等学校": {
"読み方": "きぼうがおかこうとうがっこう",
"所在位置": "福岡県"
},
"九州学院高等学校": {
"読み方": "きゅうしゅうがくいんこうとうがっこう",
"所在位置": "熊本県"
},
"九州国際大学付属高等学校": {
"読み方": "きゅうしゅうこくさいだいがくふぞくこうとうがっこう",
"所在位置": "福岡県"
},
"九州産業大学付属九州高等学校": {
"読み方": "きゅうしゅうさんぎょうだいがくふぞくきゅうしゅうこうとうがっこう",
"所在位置": "福岡県"
},
"九州産業大学付属九州産業高等学校": {
"読み方": "きゅうしゅうさんぎょうだいがくふぞくきゅうしゅうさんぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"九州文化学園高等学校": {
"読み方": "きゅうしゅうぶんかがくえんこうとうがっこう",
"所在位置": "長崎県"
},
"共愛学園高等学校": {
"読み方": "きょうあいがくえんこうとうがっこう",
"所在位置": "群馬県"
},
"享栄高等学校": {
"読み方": "きょうえいこうとうがっこう",
"所在位置": "愛知県"
},
"暁星国際高等学校": {
"読み方": "ぎょうせいこくさいこうとうがっこう",
"所在位置": "千葉県"
},
"協和学院水沢第一高等学校": {
"読み方": "きょうわがくいんみずさわだいいちこうとうがっこう",
"所在位置": "岩手県"
},
"霧島市立国分中央高等学校": {
"読み方": "きりしましりつこくぶちゅうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"基督教独立学園高等学校": {
"読み方": "きりすときょうどくりつがくえんこうとうがっこう",
"所在位置": "山形県"
},
"桐生市立商業高等学校": {
"読み方": "きりゅうしりつしょうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"桐生第一高等学校": {
"読み方": "きりうだいいちこうとうがっこう",
"所在位置": "群馬県"
},
"銀河学院高等学校": {
"読み方": "ぎんががくいんこうとうがっこう",
"所在位置": "広島県"
},
"近畿大学附属新宮高等学校": {
"読み方": "きんきだいがくふぞくしんぐうこうとうがっこう",
"所在位置": "和歌山県"
},
"近畿大学附属豊岡高等学校": {
"読み方": "きんきだいがくふぞくとよおかこうとうがっこう",
"所在位置": "兵庫県"
},
"近畿大学附属広島高等学校 東広島校": {
"読み方": "きんきだいがくふぞくひろしまこうとうがっこう ひがしひろしまこう",
"所在位置": "広島県"
},
"近畿大学附属福岡高等学校": {
"読み方": "きんきだいがくふぞくふくおかこうとうがっこう",
"所在位置": "福岡県"
},
"近畿大学附属広島高等学校 福山校": {
"読み方": "きんきだいがくふぞくひろしまこうとうがっこう ふくやまこう",
"所在位置": "広島県"
},
"近畿大学附属和歌山高等学校": {
"読み方": "きんきだいがくふぞくわかやまこうとうがっこう",
"所在位置": "和歌山県"
},
"金城学院高等学校": {
"読み方": "きんじょうがくいんこうとうがっこう",
"所在位置": "愛知県"
},
"鵠沼高等学校": {
"読み方": "くげぬまこうとうがっこう",
"所在位置": "神奈川県"
},
"九里学園高等学校": {
"読み方": "くのりがくえんこうとうがっこう",
"所在位置": "山形県"
},
"熊本学園大学付属高等学校": {
"読み方": "くまもとがくえんだいがくふぞくこうとうがっこう",
"所在位置": "熊本県"
},
"芦北高等学校": {
"読み方": "あしきたこうとうがっこう",
"所在位置": "熊本県"
},
"阿蘇中央高等学校 阿蘇校舎": {
"読み方": "あそちゅうおうこうとうがっこう あそこうしゃ",
"所在位置": "熊本県"
},
"天草高等学校": {
"読み方": "あまくさこうとうがっこう",
"所在位置": "熊本県"
},
"岱志高等学校": {
"読み方": "たいしこうとうがっこう",
"所在位置": "熊本県"
},
"宇土高等学校": {
"読み方": "うとこうとうがっこう",
"所在位置": "熊本県"
},
"大津高等学校": {
"読み方": "おおつこうとうがっこう",
"所在位置": "滋賀県"
},
"小川工業高等学校": {
"読み方": "おがわこうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"鹿本高等学校": {
"読み方": "かもとこうとうがっこう",
"所在位置": "熊本県"
},
"鹿本商工高等学校": {
"読み方": "かもとしょうこうこうとうがっこう",
"所在位置": "熊本県"
},
"鹿本農業高等学校": {
"読み方": "かもとのうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"菊池高等学校": {
"読み方": "きくちこうとうがっこう",
"所在位置": "熊本県"
},
"菊池農業高等学校": {
"読み方": "きくちのうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"球磨工業高等学校": {
"読み方": "くまこうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"熊本高等学校": {
"読み方": "くまもとこうとうがっこう",
"所在位置": "熊本県"
},
"熊本北高等学校": {
"読み方": "くまもときたこうとうがっこう",
"所在位置": "熊本県"
},
"熊本工業高等学校": {
"読み方": "くまもとこうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"熊本商業高等学校": {
"読み方": "くまもとしょうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"熊本西高等学校": {
"読み方": "くまもとにしこうとうがっこう",
"所在位置": "熊本県"
},
"熊本農業高等学校": {
"読み方": "くまもとのうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"翔陽高等学校": {
"読み方": "しょうようこうとうがっこう",
"所在位置": "熊本県"
},
"済々黌高等学校": {
"読み方": "せいせいこうこうとうがっこう",
"所在位置": "熊本県"
},
"第一高等学校": {
"読み方": "だいいちこうとうがっこう",
"所在位置": "熊本県"
},
"第二高等学校": {
"読み方": "だいにこうとうがっこう",
"所在位置": "熊本県"
},
"玉名高等学校": {
"読み方": "たまなこうとうがっこう",
"所在位置": "熊本県"
},
"玉名工業高等学校": {
"読み方": "たまなこうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"東稜高等学校": {
"読み方": "とうりょうこうとうがっこう",
"所在位置": "熊本県"
},
"人吉高等学校": {
"読み方": "ひとよしこうとうがっこう",
"所在位置": "熊本県"
},
"北稜高等学校": {
"読み方": "ほくりょうこうとうがっこう",
"所在位置": "熊本県"
},
"松橋高等学校": {
"読み方": "まつばせこうとうがっこう",
"所在位置": "熊本県"
},
"水俣高等学校": {
"読み方": "みなまたこうとうがっこう",
"所在位置": "熊本県"
},
"御船高等学校": {
"読み方": "みふねこうとうがっこう",
"所在位置": "熊本県"
},
"八代高等学校": {
"読み方": "やつしろこうとうがっこう",
"所在位置": "熊本県"
},
"八代工業高等学校": {
"読み方": "やつしろこうぎょうこうとうがっこう",
"所在位置": "熊本県"
},
"八代東高等学校": {
"読み方": "やつしろひがしこうとうがっこう",
"所在位置": "熊本県"
},
"八代清流高等学校": {
"読み方": "やつしろせいりゅうこうとうがっこう",
"所在位置": "熊本県"
},
"天草拓心高等学校本渡校舎": {
"読み方": "あまくさたくしんこうとうがっこうほんどこうしゃ",
"所在位置": "熊本県"
},
"熊本国府高等学校": {
"読み方": "くまもとこくふこうとうがっこう",
"所在位置": "熊本県"
},
"熊本市立千原台高等学校": {
"読み方": "くまもとしりつちはらだいこうとうがっこう",
"所在位置": "熊本県"
},
"熊本市立必由館高等学校": {
"読み方": "くまもとしりつひつゆかんこうとうがっこう",
"所在位置": "熊本県"
},
"熊本中央高等学校": {
"読み方": "くまもとちゅうおうこうとうがっこう",
"所在位置": "熊本県"
},
"熊本信愛女学院高等学校": {
"読み方": "くまもとしんあいじょがくいんこうとうがっこう",
"所在位置": "熊本県"
},
"熊本マリスト学園高等学校": {
"読み方": "くまもとまりすとがくえんこうとうがっこう",
"所在位置": "熊本県"
},
"公文国際学園高等部": {
"読み方": "くもんこくさいがくえんこうとうぶ",
"所在位置": "神奈川県"
},
"倉敷高等学校": {
"読み方": "くらしきこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷市立倉敷翔南高等学校": {
"読み方": "くらしきしりつくらしきしょうなんこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷市立真備陵南高等学校": {
"読み方": "くらしきしりつまびりょうなんこうとうがっこう",
"所在位置": "岡山県"
},
"倉敷翠松高等学校": {
"読み方": "くらしきすいしょうこうとうがっこう",
"所在位置": "岡山県"
},
"久留米学園高等学校": {
"読み方": "くるめがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"久留米市立久留米商業高等学校": {
"読み方": "くるめしりつくるめしょうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"久留米市立南筑高等学校": {
"読み方": "くるめしりつなんちくこうとうがっこう",
"所在位置": "福岡県"
},
"久留米信愛高等学校": {
"読み方": "くるめしんあいこうとうがっこう",
"所在位置": "福岡県"
},
"久留米大学附設高等学校": {
"読み方": "くるめだいがくふせつこうとうがっこう",
"所在位置": "福岡県"
},
"呉青山高等学校": {
"読み方": "くれあおやまこうとうがっこう",
"所在位置": "広島県"
},
"呉市立呉高等学校": {
"読み方": "くれしりつくれこうとうがっこう",
"所在位置": "広島県"
},
"呉港高等学校": {
"読み方": "ごこうこうとうがっこう",
"所在位置": "広島県"
},
"安中総合学園高等学校": {
"読み方": "あんなかそうごうがくえんこうとうがっこう",
"所在位置": "群馬県"
},
"伊勢崎高等学校": {
"読み方": "いせさきこうとうがっこう",
"所在位置": "群馬県"
},
"伊勢崎工業高等学校": {
"読み方": "いせさきこうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"伊勢崎興陽高等学校": {
"読み方": "いせさきこうようこうとうがっこう",
"所在位置": "群馬県"
},
"伊勢崎商業高等学校": {
"読み方": "いせさきしょうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"伊勢崎清明高等学校": {
"読み方": "いせさきせいめいこうとうがっこう",
"所在位置": "群馬県"
},
"板倉高等学校": {
"読み方": "いたくらこうとうがっこう",
"所在位置": "群馬県"
},
"大泉高等学校": {
"読み方": "おおいずみこうとうがっこう",
"所在位置": "群馬県"
},
"太田高等学校": {
"読み方": "おおたこうとうがっこう",
"所在位置": "群馬県"
},
"太田工業高等学校": {
"読み方": "おおたこうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"太田女子高等学校": {
"読み方": "おおたじょしこうとうがっこう",
"所在位置": "群馬県"
},
"太田東高等学校": {
"読み方": "おおたひがしこうとうがっこう",
"所在位置": "群馬県"
},
"太田フレックス高等学校": {
"読み方": "おおたふれっくすこうとうがっこう",
"所在位置": "群馬県"
},
"大間々高等学校": {
"読み方": "おおままこうとうがっこう",
"所在位置": "群馬県"
},
"尾瀬高等学校": {
"読み方": "おぜこうとうがっこう",
"所在位置": "群馬県"
},
"桐生高等学校": {
"読み方": "きりゅうこうとうがっこう",
"所在位置": "群馬県"
},
"桐生工業高等学校": {
"読み方": "きりゅうこうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"渋川高等学校": {
"読み方": "しぶかわこうとうがっこう",
"所在位置": "群馬県"
},
"渋川工業高等学校": {
"読み方": "しぶかわこうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"渋川女子高等学校": {
"読み方": "しぶかわじょしこうとうがっこう",
"所在位置": "群馬県"
},
"渋川青翠高等学校": {
"読み方": "しぶかわせいすいこうとうがっこう",
"所在位置": "群馬県"
},
"勢多農林高等学校": {
"読み方": "せたのうりんこうとうがっこう",
"所在位置": "群馬県"
},
"高崎高等学校": {
"読み方": "たかさきこうとうがっこう",
"所在位置": "群馬県"
},
"高崎北高等学校": {
"読み方": "たかさききたこうとうがっこう",
"所在位置": "群馬県"
},
"高崎工業高等学校": {
"読み方": "たかさきこうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"高崎商業高等学校": {
"読み方": "たかさきしょうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"高崎女子高等学校": {
"読み方": "たかさきじょしこうとうがっこう",
"所在位置": "群馬県"
},
"高崎東高等学校": {
"読み方": "たかさきひがしこうとうがっこう",
"所在位置": "群馬県"
},
"館林高等学校": {
"読み方": "たてばやしこうとうがっこう",
"所在位置": "群馬県"
},
"館林商工高等学校": {
"読み方": "たてばやししょうこうこうとうがっこう",
"所在位置": "群馬県"
},
"館林女子高等学校": {
"読み方": "たてばやしじょしこうとうがっこう",
"所在位置": "群馬県"
},
"富岡高等学校": {
"読み方": "とみおかこうとうがっこう",
"所在位置": "群馬県"
},
"西邑楽高等学校": {
"読み方": "にしおうらこうとうがっこう",
"所在位置": "群馬県"
},
"新田暁高等学校": {
"読み方": "にったあかつきこうとうがっこう",
"所在位置": "群馬県"
},
"沼田高等学校": {
"読み方": "ぬまたこうとうがっこう",
"所在位置": "群馬県"
},
"沼田女子高等学校": {
"読み方": "ぬまたじょしこうとうがっこう",
"所在位置": "群馬県"
},
"榛名高等学校": {
"読み方": "はるなこうとうがっこう",
"所在位置": "群馬県"
},
"藤岡北高等学校": {
"読み方": "ふじおかきたこうとうがっこう",
"所在位置": "群馬県"
},
"藤岡中央高等学校": {
"読み方": "ふじおかちゅうおうこうとうがっこう",
"所在位置": "群馬県"
},
"前橋高等学校": {
"読み方": "まえばしこうとうがっこう",
"所在位置": "群馬県"
},
"前橋工業高等学校": {
"読み方": "まえばしこうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"前橋商業高等学校": {
"読み方": "まえばししょうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"前橋女子高等学校": {
"読み方": "まえばしじょしこうとうがっこう",
"所在位置": "群馬県"
},
"前橋清陵高等学校": {
"読み方": "まえばしせいりょうこうとうがっこう",
"所在位置": "群馬県"
},
"前橋西高等学校": {
"読み方": "まえばしにしこうとうがっこう",
"所在位置": "群馬県"
},
"前橋東高等学校": {
"読み方": "まえばしひがしこうとうがっこう",
"所在位置": "群馬県"
},
"前橋南高等学校": {
"読み方": "まえばしみなみこうとうがっこう",
"所在位置": "群馬県"
},
"万場高等学校": {
"読み方": "まんばこうとうがっこう",
"所在位置": "群馬県"
},
"吉井高等学校": {
"読み方": "よしいこうとうがっこう",
"所在位置": "群馬県"
},
"利根実業高等学校": {
"読み方": "とねじつぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"敬愛高等学校": {
"読み方": "けいあいこうとうがっこう",
"所在位置": "福岡県"
},
"敬愛学園高等学校": {
"読み方": "けいあいがくえんこうとうがっこう",
"所在位置": "千葉県"
},
"敬愛大学八日市場高等学校": {
"読み方": "けいあいだいがくようかいちばこうとうがっこう",
"所在位置": "千葉県"
},
"慶應義塾高等学校": {
"読み方": "けいおうぎじゅくこうとうがっこう",
"所在位置": "神奈川県"
},
"慶應義塾志木高等学校": {
"読み方": "けいおうぎじゅくしきこうとうがっこう",
"所在位置": "埼玉県"
},
"慶應義塾湘南藤沢高等部": {
"読み方": "けいおうぎじゅくしょうなんふじさわこうとうぶ",
"所在位置": "神奈川県"
},
"啓新高等学校": {
"読み方": "けいしんこうとうがっこう",
"所在位置": "福井県"
},
"慶進高等学校": {
"読み方": "けいしんこうとうがっこう",
"所在位置": "山口県"
},
"慶成高等学校": {
"読み方": "けいせいこうとうがっこう",
"所在位置": "福岡県"
},
"慶誠高等学校": {
"読み方": "けいせいこうとうがっこう",
"所在位置": "熊本県"
},
"瓊浦高等学校": {
"読み方": "けいほこうとうがっこう",
"所在位置": "長崎県"
},
"啓明学院高等学校": {
"読み方": "けいめいがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"啓明学館高等学校": {
"読み方": "けいめいがっかんこうとうがっこう",
"所在位置": "愛知県"
},
"敬和学園高等学校": {
"読み方": "けいわがくえんこうとうがっこう",
"所在位置": "新潟県"
},
"賢明女子学院高等学校": {
"読み方": "けんめいじょしがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"皇學館高等学校": {
"読み方": "こうがっかんこうとうがっこう",
"所在位置": "三重県"
},
"甲子園学院高等学校": {
"読み方": "こうしえんがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"向上高等学校": {
"読み方": "こうじょうこうとうがっこう",
"所在位置": "神奈川県"
},
"興譲館高等学校": {
"読み方": "こうじょうかんこうとうがっこう",
"所在位置": "岡山県"
},
"浜松学院高等学校": {
"読み方": "はままつがくいんこうとうがっこう",
"所在位置": "静岡県"
},
"八戸学院光星高等学校": {
"読み方": "はちのへがくいんこうせいこうとうがっこう",
"所在位置": "青森県"
},
"光泉カトリック高等学校": {
"読み方": "こうせんかとりっくこうとうがっこう",
"所在位置": "滋賀県"
},
"高知高等学校": {
"読み方": "こうちこうとうがっこう",
"所在位置": "高知県"
},
"高知学芸高等学校": {
"読み方": "こうちがくげいこうとうがっこう",
"所在位置": "高知県"
},
"安芸高等学校": {
"読み方": "あきこうとうがっこう",
"所在位置": "広島県"
},
"伊野商業高等学校": {
"読み方": "いのしょうぎょうこうとうがっこう",
"所在位置": "高知県"
},
"岡豊高等学校": {
"読み方": "おこうこうとうがっこう",
"所在位置": "高知県"
},
"窪川高等学校": {
"読み方": "くぼかわこうとうがっこう",
"所在位置": "高知県"
},
"高知小津高等学校": {
"読み方": "こうちおづこうとうがっこう",
"所在位置": "高知県"
},
"高知追手前高等学校": {
"読み方": "こうちおうてまえこうとうがっこう",
"所在位置": "高知県"
},
"高知工業高等学校": {
"読み方": "こうちこうぎょうこうとうがっこう",
"所在位置": "高知県"
},
"高知国際高等学校": {
"読み方": "こうちにしこうとうがっこう",
"所在位置": "高知県"
},
"高知農業高等学校": {
"読み方": "こうちのうぎょうこうとうがっこう",
"所在位置": "高知県"
},
"高知東高等学校": {
"読み方": "こうちひがしこうとうがっこう",
"所在位置": "高知県"
},
"高知丸の内高等学校": {
"読み方": "こうちまるのうちこうとうがっこう",
"所在位置": "高知県"
},
"高知南高等学校": {
"読み方": "こうちみなみこうとうがっこう",
"所在位置": "高知県"
},
"清水高等学校": {
"読み方": "しみずこうとうがっこう",
"所在位置": "千葉県"
},
"宿毛工業高等学校": {
"読み方": "すくもこうぎょうこうとうがっこう",
"所在位置": "高知県"
},
"春野高等学校": {
"読み方": "はるのこうとうがっこう",
"所在位置": "高知県"
},
"山田高等学校": {
"読み方": "やまだこうとうがっこう",
"所在位置": "高知県"
},
"高知市立高知商業高等学校": {
"読み方": "こうちしりつこうちしょうぎょうこうとうがっこう",
"所在位置": "高知県"
},
"高知中央高等学校": {
"読み方": "こうちちゅうおうこうとうがっこう",
"所在位置": "高知県"
},
"高朋高等学校": {
"読み方": "こうほうこうとうがっこう",
"所在位置": "富山県"
},
"興南高等学校": {
"読み方": "こうなんこうとうがっこう",
"所在位置": "沖縄県"
},
"江南義塾盛岡高等学校": {
"読み方": "こうなんぎじゅくもりおかこうとうがっこう",
"所在位置": "岩手県"
},
"甲南女子高等学校": {
"読み方": "こうなんじょしこうとうがっこう",
"所在位置": "兵庫県"
},
"江の川学園 石見智翠館高等学校": {
"読み方": "ごうのかわがくえんいわみちすいかんこうとうがっこう",
"所在位置": "島根県"
},
"国府台女子学院高等部": {
"読み方": "こうのだいじょしがくいんこうとうぶ",
"所在位置": "千葉県"
},
"幸福の科学学園高等学校": {
"読み方": "こうふくのかがくがくえんこうとうがっこう",
"所在位置": "栃木県"
},
"甲府市立甲府商業高等学校": {
"読み方": "こうふしりつこうふしょうぎょうこうとうがっこう",
"所在位置": "山梨県"
},
"甲斐清和高等学校": {
"読み方": "かいせいかこうとうがっこう",
"所在位置": "山梨県"
},
"神戸海星女子学院高等学校": {
"読み方": "こうべかいせいじょしがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸学院大学附属高等学校": {
"読み方": "こうべがくいんだいがくふぞくこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸弘陵学園高等学校": {
"読み方": "こうべこうりょうがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸国際大学附属高等学校": {
"読み方": "こうべこくさいだいがくふぞくこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸女学院高等学部": {
"読み方": "こうべじょがくいんこうとうがくぶ",
"所在位置": "兵庫県"
},
"神戸市立科学技術高等学校": {
"読み方": "こうべしりつかがくぎじゅつこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸市立葺合高等学校": {
"読み方": "こうべしりつふきあいこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸市立摩耶兵庫高等学校": {
"読み方": "こうべしりつまやひょうごこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸市立六甲アイランド高等学校": {
"読み方": "こうべしりつろっこうあいらんどこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸星城高等学校": {
"読み方": "こうべせいじょうこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸第一高等学校": {
"読み方": "こうべだいいちこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸常盤女子高等学校": {
"読み方": "こうべときわじょしこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸野田高等学校": {
"読み方": "こうべのだこうとうがっこう",
"所在位置": "兵庫県"
},
"彩星工科高等学校": {
"読み方": "さいせいこうかこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸山手女子高等学校": {
"読み方": "こうべやまてじょしこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸龍谷高等学校": {
"読み方": "こうべりゅうこくこうとうがっこう",
"所在位置": "兵庫県"
},
"英理女子学院高等学校": {
"読み方": "えいりじょしがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"光明学園相模原高等学校": {
"読み方": "こうみょうがくえんさがみはらこうとうがっこう",
"所在位置": "神奈川県"
},
"高野山高等学校": {
"読み方": "こうやさんこうとうがっこう",
"所在位置": "和歌山県"
},
"甲陽学院高等学校": {
"読み方": "こうようがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"広陵高等学校": {
"読み方": "こうりょうこうとうがっこう",
"所在位置": "広島県"
},
"高稜高等学校": {
"読み方": "こうりょうこうとうがっこう",
"所在位置": "福岡県"
},
"郡山女子大学附属高等学校": {
"読み方": "こおりやまじょしだいがくふぞくこうとうがっこう",
"所在位置": "福島県"
},
"國學院大學栃木高等学校": {
"読み方": "こくがくいんだいがくとちぎこうとうがっこう",
"所在位置": "栃木県"
},
"国際学院高等学校": {
"読み方": "こくさいがくいんこうとうがっこう",
"所在位置": "埼玉県"
},
"五所川原商業高等学校": {
"読み方": "ごしょがわらしょうぎょうこうとうがっこう",
"所在位置": "青森県"
},
"五所川原第一高等学校": {
"読み方": "ごしょがわらだいいちこうとうがっこう",
"所在位置": "青森県"
},
"御殿場西高等学校": {
"読み方": "ごてんばにしこうとうがっこう",
"所在位置": "静岡県"
},
"小林聖心女子学院高等学校": {
"読み方": "おばやしせいしんじょしがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"小松大谷高等学校": {
"読み方": "こまつおおたにこうとうがっこう",
"所在位置": "石川県"
},
"小松市立高等学校": {
"読み方": "こまつしりつこうとうがっこう",
"所在位置": "石川県"
},
"叡明高等学校": {
"読み方": "えいめいこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和麗明高等学校": {
"読み方": "うらわれいめいこうとうがっこう",
"所在位置": "埼玉県"
},
"金光学園高等学校": {
"読み方": "こんこうがくえんこうとうがっこう",
"所在位置": "岡山県"
},
"西海学園高等学校": {
"読み方": "さいかいがくえんこうとうがっこう",
"所在位置": "長崎県"
},
"川口北高等学校": {
"読み方": "かわぐちきたこうとうがっこう",
"所在位置": "埼玉県"
},
"上尾高等学校": {
"読み方": "あげおこうとうがっこう",
"所在位置": "埼玉県"
},
"上尾鷹の台高等学校": {
"読み方": "あげおたかのだいこうとうがっこう",
"所在位置": "埼玉県"
},
"上尾橘高等学校": {
"読み方": "あげおたちばなこうとうがっこう",
"所在位置": "埼玉県"
},
"上尾南高等学校": {
"読み方": "あげおみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"朝霞高等学校": {
"読み方": "あさかこうとうがっこう",
"所在位置": "埼玉県"
},
"朝霞西高等学校": {
"読み方": "あさかにしこうとうがっこう",
"所在位置": "埼玉県"
},
"いずみ高等学校": {
"読み方": "いずみこうとうがっこう",
"所在位置": "埼玉県"
},
"伊奈学園総合高等学校": {
"読み方": "いながくえんそうごうこうとうがっこう",
"所在位置": "埼玉県"
},
"入間向陽高等学校": {
"読み方": "いるまこうようこうとうがっこう",
"所在位置": "埼玉県"
},
"岩槻高等学校": {
"読み方": "いわつきこうとうがっこう",
"所在位置": "埼玉県"
},
"岩槻商業高等学校": {
"読み方": "いわつきしょうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"岩槻北陵高等学校": {
"読み方": "いわつきほくりょうこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和高等学校": {
"読み方": "うらわこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和北高等学校": {
"読み方": "うらわきたこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和工業高等学校": {
"読み方": "うらわこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和商業高等学校": {
"読み方": "うらわしょうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和第一女子高等学校": {
"読み方": "うらわだいいちじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和西高等学校": {
"読み方": "うらわにしこうとうがっこう",
"所在位置": "埼玉県"
},
"浦和東高等学校": {
"読み方": "うらわひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"ふじみ野高等学校": {
"読み方": "ふじみのこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮高等学校": {
"読み方": "おおみやこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮工業高等学校": {
"読み方": "おおみやこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮光陵高等学校": {
"読み方": "おおみやこうりょうこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮商業高等学校": {
"読み方": "おおみやしょうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮中央高等学校（通信制）": {
"読み方": "おおみやちゅうおうこうとうがっこう（つうしんせい）",
"所在位置": "埼玉県"
},
"大宮東高等学校": {
"読み方": "おおみやひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮南高等学校": {
"読み方": "おおみやみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"大宮武蔵野高等学校": {
"読み方": "おおみやむさしのこうとうがっこう",
"所在位置": "埼玉県"
},
"小鹿野高等学校": {
"読み方": "おがのこうとうがっこう",
"所在位置": "埼玉県"
},
"小川高等学校": {
"読み方": "おがわこうとうがっこう",
"所在位置": "埼玉県"
},
"桶川高等学校": {
"読み方": "おけがわこうとうがっこう",
"所在位置": "埼玉県"
},
"桶川西高等学校": {
"読み方": "おけがわにしこうとうがっこう",
"所在位置": "埼玉県"
},
"越生高等学校": {
"読み方": "おごせこうとうがっこう",
"所在位置": "埼玉県"
},
"春日部高等学校": {
"読み方": "かすかべこうとうがっこう",
"所在位置": "埼玉県"
},
"春日部工業高等学校": {
"読み方": "かすかべこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"春日部女子高等学校": {
"読み方": "かすかべじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"春日部東高等学校": {
"読み方": "かすかべひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"川口高等学校": {
"読み方": "かわぐちこうとうがっこう",
"所在位置": "埼玉県"
},
"川口工業高等学校": {
"読み方": "かわぐちこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"川口青陵高等学校": {
"読み方": "かわぐちせいりょうこうとうがっこう",
"所在位置": "埼玉県"
},
"川口東高等学校": {
"読み方": "かわぐちひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"川越高等学校": {
"読み方": "かわごえこうとうがっこう",
"所在位置": "三重県"
},
"川越工業高等学校": {
"読み方": "かわごえこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"川越女子高等学校": {
"読み方": "かわごえじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"川越総合高等学校": {
"読み方": "かわごえそうごうこうとうがっこう",
"所在位置": "埼玉県"
},
"川越西高等学校": {
"読み方": "かわごえにしこうとうがっこう",
"所在位置": "埼玉県"
},
"川越初雁高等学校": {
"読み方": "かわごえはつかりこうとうがっこう",
"所在位置": "埼玉県"
},
"川越南高等学校": {
"読み方": "かわごえみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"北本高等学校": {
"読み方": "きたもとこうとうがっこう",
"所在位置": "埼玉県"
},
"久喜高等学校": {
"読み方": "くきこうとうがっこう",
"所在位置": "埼玉県"
},
"久喜工業高等学校": {
"読み方": "くきこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"久喜北陽高等学校": {
"読み方": "くきほくようこうとうがっこう",
"所在位置": "埼玉県"
},
"熊谷高等学校": {
"読み方": "くまがやこうとうがっこう",
"所在位置": "埼玉県"
},
"熊谷工業高等学校": {
"読み方": "くまがやこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"熊谷商業高等学校": {
"読み方": "くまがやしょうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"熊谷女子高等学校": {
"読み方": "くまがやじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"熊谷西高等学校": {
"読み方": "くまがやにしこうとうがっこう",
"所在位置": "埼玉県"
},
"熊谷農業高等学校": {
"読み方": "くまがやのうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"栗橋北彩高等学校": {
"読み方": "くりはしほくさいこうとうがっこう",
"所在位置": "埼玉県"
},
"芸術総合高等学校": {
"読み方": "げいじゅつそうごうこうとうがっこう",
"所在位置": "埼玉県"
},
"鴻巣高等学校": {
"読み方": "こうのすこうとうがっこう",
"所在位置": "埼玉県"
},
"鴻巣女子高等学校": {
"読み方": "こうのすじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"越ヶ谷高等学校": {
"読み方": "こしがやこうとうがっこう",
"所在位置": "埼玉県"
},
"越谷北高等学校": {
"読み方": "こしがやきたこうとうがっこう",
"所在位置": "埼玉県"
},
"越谷総合技術高等学校": {
"読み方": "こしがやそうごうぎじゅつこうとうがっこう",
"所在位置": "埼玉県"
},
"越谷西高等学校": {
"読み方": "こしがやにしこうとうがっこう",
"所在位置": "埼玉県"
},
"越谷東高等学校": {
"読み方": "こしがやひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"越谷南高等学校": {
"読み方": "こしがやみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"児玉高等学校": {
"読み方": "こだまこうとうがっこう",
"所在位置": "埼玉県"
},
"児玉白楊高等学校": {
"読み方": "こだまはくようこうとうがっこう",
"所在位置": "埼玉県"
},
"坂戸高等学校": {
"読み方": "さかどこうとうがっこう",
"所在位置": "埼玉県"
},
"坂戸西高等学校": {
"読み方": "さかどにしこうとうがっこう",
"所在位置": "埼玉県"
},
"幸手桜高等学校": {
"読み方": "さってさくらこうとうがっこう",
"所在位置": "埼玉県"
},
"狭山経済高等学校": {
"読み方": "さやまけいざいこうとうがっこう",
"所在位置": "埼玉県"
},
"狭山工業高等学校": {
"読み方": "さやまこうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"狭山清陵高等学校": {
"読み方": "さやませいりょうこうとうがっこう",
"所在位置": "埼玉県"
},
"狭山緑陽高等学校": {
"読み方": "さやまりょくようこうとうがっこう",
"所在位置": "埼玉県"
},
"志木高等学校": {
"読み方": "しきこうとうがっこう",
"所在位置": "埼玉県"
},
"庄和高等学校": {
"読み方": "しょうわこうとうがっこう",
"所在位置": "埼玉県"
},
"白岡高等学校": {
"読み方": "しらおかこうとうがっこう",
"所在位置": "埼玉県"
},
"進修館高等学校": {
"読み方": "しんしゅうかんこうとうがっこう",
"所在位置": "埼玉県"
},
"杉戸高等学校": {
"読み方": "すぎとこうとうがっこう",
"所在位置": "埼玉県"
},
"杉戸農業高等学校": {
"読み方": "すぎとのうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"誠和福祉高等学校": {
"読み方": "せいわふくしこうとうがっこう",
"所在位置": "埼玉県"
},
"草加高等学校": {
"読み方": "そうかこうとうがっこう",
"所在位置": "埼玉県"
},
"草加西高等学校": {
"読み方": "そうかにしこうとうがっこう",
"所在位置": "埼玉県"
},
"草加東高等学校": {
"読み方": "そうかひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"草加南高等学校": {
"読み方": "そうかみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"秩父高等学校": {
"読み方": "ちちぶこうとうがっこう",
"所在位置": "埼玉県"
},
"秩父農工科学高等学校": {
"読み方": "ちちぶのうこうかがくこうとうがっこう",
"所在位置": "埼玉県"
},
"鶴ヶ島清風高等学校": {
"読み方": "つるがしませいふうこうとうがっこう",
"所在位置": "埼玉県"
},
"常盤高等学校": {
"読み方": "ときわこうとうがっこう",
"所在位置": "埼玉県"
},
"所沢高等学校": {
"読み方": "ところざわこうとうがっこう",
"所在位置": "埼玉県"
},
"所沢北高等学校": {
"読み方": "ところざわきたこうとうがっこう",
"所在位置": "埼玉県"
},
"所沢商業高等学校": {
"読み方": "ところざわしょうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"所沢中央高等学校": {
"読み方": "ところざわちゅうおうこうとうがっこう",
"所在位置": "埼玉県"
},
"所沢西高等学校": {
"読み方": "ところざわにしこうとうがっこう",
"所在位置": "埼玉県"
},
"戸田翔陽高等学校": {
"読み方": "とだしょうようこうとうがっこう",
"所在位置": "埼玉県"
},
"豊岡高等学校": {
"読み方": "とよおかこうとうがっこう",
"所在位置": "兵庫県"
},
"滑川総合高等学校": {
"読み方": "なめがわそうごうこうとうがっこう",
"所在位置": "埼玉県"
},
"南稜高等学校": {
"読み方": "なんりょうこうとうがっこう",
"所在位置": "埼玉県"
},
"新座高等学校": {
"読み方": "にいざこうとうがっこう",
"所在位置": "埼玉県"
},
"新座総合技術高等学校": {
"読み方": "にいざそうごうぎじゅつこうとうがっこう",
"所在位置": "埼玉県"
},
"新座柳瀬高等学校": {
"読み方": "にいざやなせこうとうがっこう",
"所在位置": "埼玉県"
},
"蓮田松韻高等学校": {
"読み方": "はすだしょういんこうとうがっこう",
"所在位置": "埼玉県"
},
"鳩ヶ谷高等学校": {
"読み方": "はとがやこうとうがっこう",
"所在位置": "埼玉県"
},
"鳩山高等学校": {
"読み方": "はとやまこうとうがっこう",
"所在位置": "埼玉県"
},
"羽生高等学校": {
"読み方": "はにゅうこうとうがっこう",
"所在位置": "埼玉県"
},
"羽生実業高等学校": {
"読み方": "はにゅうじつぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"羽生第一高等学校": {
"読み方": "はにゅうだいいちこうとうがっこう",
"所在位置": "埼玉県"
},
"飯能高等学校": {
"読み方": "はんのうこうとうがっこう",
"所在位置": "埼玉県"
},
"日高高等学校": {
"読み方": "ひだかこうとうがっこう",
"所在位置": "和歌山県"
},
"深谷高等学校": {
"読み方": "ふかやこうとうがっこう",
"所在位置": "埼玉県"
},
"深谷商業高等学校": {
"読み方": "ふかやしょうぎょうこうとうがっこう",
"所在位置": "埼玉県"
},
"深谷第一高等学校": {
"読み方": "ふかやだいいちこうとうがっこう",
"所在位置": "埼玉県"
},
"吹上秋桜高等学校": {
"読み方": "ふきあげしゅうおうこうとうがっこう",
"所在位置": "埼玉県"
},
"富士見高等学校": {
"読み方": "ふじみこうとうがっこう",
"所在位置": "長野県"
},
"不動岡高等学校": {
"読み方": "ふどうおかこうとうがっこう",
"所在位置": "埼玉県"
},
"本庄高等学校": {
"読み方": "ほんじょうこうとうがっこう",
"所在位置": "宮崎県"
},
"松伏高等学校": {
"読み方": "まつぶしこうとうがっこう",
"所在位置": "埼玉県"
},
"松山高等学校": {
"読み方": "まつやまこうとうがっこう",
"所在位置": "埼玉県"
},
"松山女子高等学校": {
"読み方": "まつやまじょしこうとうがっこう",
"所在位置": "埼玉県"
},
"三郷高等学校": {
"読み方": "みさとこうとうがっこう",
"所在位置": "埼玉県"
},
"三郷北高等学校": {
"読み方": "みさときたこうとうがっこう",
"所在位置": "埼玉県"
},
"三郷工業技術高等学校": {
"読み方": "みさとこうぎょうぎじゅつこうとうがっこう",
"所在位置": "埼玉県"
},
"皆野高等学校": {
"読み方": "みなのこうとうがっこう",
"所在位置": "埼玉県"
},
"宮代高等学校": {
"読み方": "みやしろこうとうがっこう",
"所在位置": "埼玉県"
},
"妻沼高等学校": {
"読み方": "めぬまこうとうがっこう",
"所在位置": "埼玉県"
},
"八潮高等学校": {
"読み方": "やしおこうとうがっこう",
"所在位置": "埼玉県"
},
"八潮南高等学校": {
"読み方": "やしおみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"吉川美南高等学校": {
"読み方": "よしかわみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"与野高等学校": {
"読み方": "よのこうとうがっこう",
"所在位置": "埼玉県"
},
"寄居城北高等学校": {
"読み方": "よりいじょうほくこうとうがっこう",
"所在位置": "埼玉県"
},
"和光高等学校": {
"読み方": "わこうこうとうがっこう",
"所在位置": "埼玉県"
},
"和光国際高等学校": {
"読み方": "わこうこくさいこうとうがっこう",
"所在位置": "埼玉県"
},
"鷲宮高等学校": {
"読み方": "わしのみやこうとうがっこう",
"所在位置": "埼玉県"
},
"蕨高等学校": {
"読み方": "わらびこうとうがっこう",
"所在位置": "埼玉県"
},
"埼玉栄高等学校": {
"読み方": "さいたまさかえこうとうがっこう",
"所在位置": "埼玉県"
},
"さいたま市立浦和高等学校": {
"読み方": "さいたましりつうらわこうとうがっこう",
"所在位置": "埼玉県"
},
"さいたま市立浦和南高等学校": {
"読み方": "さいたましりつうらわみなみこうとうがっこう",
"所在位置": "埼玉県"
},
"さいたま市立大宮北高等学校": {
"読み方": "さいたましりつおおみやきたこうとうがっこう",
"所在位置": "埼玉県"
},
"埼玉平成高等学校": {
"読み方": "さいたまへいせいこうとうがっこう",
"所在位置": "埼玉県"
},
"済美高等学校": {
"読み方": "さいびこうとうがっこう",
"所在位置": "愛媛県"
},
"山形明正高等学校": {
"読み方": "やまがためいせいこうとうがっこう",
"所在位置": "山形県"
},
"坂出第一高等学校": {
"読み方": "さかいでだいいちこうとうがっこう",
"所在位置": "香川県"
},
"栄北高等学校": {
"読み方": "さかえきたこうとうがっこう",
"所在位置": "埼玉県"
},
"栄東高等学校": {
"読み方": "さかえひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"佐賀学園高等学校": {
"読み方": "さががくえんこうとうがっこう",
"所在位置": "佐賀県"
},
"有田工業高等学校": {
"読み方": "ありたこうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"伊万里高等学校": {
"読み方": "いまりこうとうがっこう",
"所在位置": "佐賀県"
},
"伊万里実業高等学校商業キャンパス": {
"読み方": "いまりじつぎょうこうとうがっこうしょうぎょうきゃんぱす",
"所在位置": "佐賀県"
},
"牛津高等学校": {
"読み方": "うしづこうとうがっこう",
"所在位置": "佐賀県"
},
"嬉野高等学校 嬉野校舎（総合学科キャンパス）": {
"読み方": "うれしのこうとうがっこう うれしのこうしゃ（そうごうがっかきゃんぱす）",
"所在位置": "佐賀県"
},
"鹿島高等学校 赤門学舎": {
"読み方": "かしまこうとうがっこう あかもんがくしゃ",
"所在位置": "佐賀県"
},
"鹿島高等学校 大手門学舎": {
"読み方": "かしまこうとうがっこう おおてもんがくしゃ",
"所在位置": "佐賀県"
},
"唐津工業高等学校": {
"読み方": "からつこうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"唐津商業高等学校": {
"読み方": "からつしょうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"唐津西高等学校": {
"読み方": "からつにしこうとうがっこう",
"所在位置": "佐賀県"
},
"唐津東高等学校": {
"読み方": "からつひがしこうとうがっこう",
"所在位置": "佐賀県"
},
"唐津南高等学校": {
"読み方": "からつみなみこうとうがっこう",
"所在位置": "佐賀県"
},
"神埼高等学校": {
"読み方": "かんざきこうとうがっこう",
"所在位置": "佐賀県"
},
"神埼清明高等学校": {
"読み方": "かんざきせいめいこうとうがっこう",
"所在位置": "佐賀県"
},
"厳木高等学校": {
"読み方": "きゅうらぎこうとうがっこう",
"所在位置": "佐賀県"
},
"高志館高等学校": {
"読み方": "こうしかんこうとうがっこう",
"所在位置": "佐賀県"
},
"小城高等学校": {
"読み方": "おぎこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀北高等学校": {
"読み方": "さがきたこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀工業高等学校": {
"読み方": "さがこうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀商業高等学校": {
"読み方": "さがしょうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀西高等学校": {
"読み方": "さがにしこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀農業高等学校": {
"読み方": "さがのうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀東高等学校": {
"読み方": "さがひがしこうとうがっこう",
"所在位置": "佐賀県"
},
"多久高等学校": {
"読み方": "たくこうとうがっこう",
"所在位置": "佐賀県"
},
"武雄高等学校": {
"読み方": "たけおこうとうがっこう",
"所在位置": "佐賀県"
},
"致遠館高等学校": {
"読み方": "ちえんかんこうとうがっこう",
"所在位置": "佐賀県"
},
"鳥栖高等学校": {
"読み方": "とすこうとうがっこう",
"所在位置": "佐賀県"
},
"鳥栖工業高等学校": {
"読み方": "とすこうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"鳥栖商業高等学校": {
"読み方": "とすしょうぎょうこうとうがっこう",
"所在位置": "佐賀県"
},
"三養基高等学校": {
"読み方": "みやきこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀女子短期大学付属佐賀女子高等学校": {
"読み方": "さがじょしたんきだいがくふぞくさがじょしこうとうがっこう",
"所在位置": "佐賀県"
},
"佐賀清和高等学校": {
"読み方": "さがせいわこうとうがっこう",
"所在位置": "佐賀県"
},
"酒田南高等学校": {
"読み方": "さかたみなみこうとうがっこう",
"所在位置": "山形県"
},
"相模女子大学高等部": {
"読み方": "さがみじょしだいがくこうとうぶ",
"所在位置": "神奈川県"
},
"龍谷高等学校": {
"読み方": "りゅうこくこうとうがっこう",
"所在位置": "佐賀県"
},
"作新学院高等学校": {
"読み方": "さくしんがくいんこうとうがっこう",
"所在位置": "栃木県"
},
"佐久長聖高等学校": {
"読み方": "さくちょうせいこうとうがっこう",
"所在位置": "長野県"
},
"さくら国際高等学校": {
"読み方": "さくらこくさいこうとうがっこう",
"所在位置": "長野県"
},
"桜の聖母学院高等学校": {
"読み方": "さくらのせいぼがくいんこうとうがっこう",
"所在位置": "福島県"
},
"桜林高等学校": {
"読み方": "おうりんこうとうがっこう",
"所在位置": "千葉県"
},
"佐野清澄高等学校": {
"読み方": "さのきよすみこうとうがっこう",
"所在位置": "栃木県"
},
"佐野日本大学高等学校": {
"読み方": "さのにほんだいがくこうとうがっこう",
"所在位置": "栃木県"
},
"サビエル高等学校": {
"読み方": "さびえるこうとうがっこう",
"所在位置": "山口県"
},
"狭山ヶ丘高等学校": {
"読み方": "さやまがおかこうとうがっこう",
"所在位置": "埼玉県"
},
"サレジオ学院高等学校": {
"読み方": "されじおがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"山村学園高等学校": {
"読み方": "やまむらがくえんこうとうがっこう",
"所在位置": "埼玉県"
},
"山村国際高等学校": {
"読み方": "やまむらこくさいこうとうがっこう",
"所在位置": "埼玉県"
},
"山陽女学園高等部": {
"読み方": "さんようじょがくえんこうとうぶ",
"所在位置": "広島県"
},
"山陽学園高等学校": {
"読み方": "さんようがくえんこうとうがっこう",
"所在位置": "岡山県"
},
"滋賀学園高等学校": {
"読み方": "しががくえんこうとうがっこう",
"所在位置": "滋賀県"
},
"志学館高等部": {
"読み方": "しがくかんこうとうぶ",
"所在位置": "千葉県"
},
"志學館高等部": {
"読み方": "しがくかんこうとうぶ",
"所在位置": "鹿児島県"
},
"石山高等学校": {
"読み方": "いしやまこうとうがっこう",
"所在位置": "滋賀県"
},
"安曇川高等学校": {
"読み方": "あどがわこうとうがっこう",
"所在位置": "滋賀県"
},
"伊香高等学校": {
"読み方": "いかこうとうがっこう",
"所在位置": "滋賀県"
},
"石部高等学校": {
"読み方": "いしべこうとうがっこう",
"所在位置": "滋賀県"
},
"伊吹高等学校": {
"読み方": "いぶきこうとうがっこう",
"所在位置": "滋賀県"
},
"大津商業高等学校": {
"読み方": "おおつしょうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"大津清陵高等学校": {
"読み方": "おおつせいりょうこうとうがっこう",
"所在位置": "滋賀県"
},
"堅田高等学校": {
"読み方": "かたたこうとうがっこう",
"所在位置": "滋賀県"
},
"北大津高等学校": {
"読み方": "きたおおつこうとうがっこう",
"所在位置": "滋賀県"
},
"草津高等学校": {
"読み方": "くさつこうとうがっこう",
"所在位置": "滋賀県"
},
"草津東高等学校": {
"読み方": "くさつひがしこうとうがっこう",
"所在位置": "滋賀県"
},
"甲西高等学校": {
"読み方": "こうせいこうとうがっこう",
"所在位置": "滋賀県"
},
"国際情報高等学校": {
"読み方": "こくさいじょうほうこうとうがっこう",
"所在位置": "新潟県"
},
"湖南農業高等学校": {
"読み方": "こなんのうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"河瀬高等学校": {
"読み方": "かわせこうとうがっこう",
"所在位置": "滋賀県"
},
"信楽高等学校": {
"読み方": "しがらきこうとうがっこう",
"所在位置": "滋賀県"
},
"膳所高等学校": {
"読み方": "ぜぜこうとうがっこう",
"所在位置": "滋賀県"
},
"瀬田工業高等学校": {
"読み方": "せたこうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"高島高等学校": {
"読み方": "たかしまこうとうがっこう",
"所在位置": "滋賀県"
},
"玉川高等学校": {
"読み方": "たまがわこうとうがっこう",
"所在位置": "滋賀県"
},
"虎姫高等学校": {
"読み方": "とらひめこうとうがっこう",
"所在位置": "滋賀県"
},
"長浜北高等学校": {
"読み方": "ながはまきたこうとうがっこう",
"所在位置": "滋賀県"
},
"長浜農業高等学校": {
"読み方": "ながはまのうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"長浜北星高等学校": {
"読み方": "ながはまほくせいこうとうがっこう",
"所在位置": "滋賀県"
},
"能登川高等学校": {
"読み方": "のとがわこうとうがっこう",
"所在位置": "滋賀県"
},
"東大津高等学校": {
"読み方": "ひがしおおつこうとうがっこう",
"所在位置": "滋賀県"
},
"彦根工業高等学校": {
"読み方": "ひこねこうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"彦根翔西館高等学校": {
"読み方": "ひこねしょうせいかんこうとうがっこう",
"所在位置": "滋賀県"
},
"彦根東高等学校": {
"読み方": "ひこねひがしこうとうがっこう",
"所在位置": "滋賀県"
},
"日野高等学校": {
"読み方": "ひのこうとうがっこう",
"所在位置": "滋賀県"
},
"米原高等学校": {
"読み方": "まいばらこうとうがっこう",
"所在位置": "滋賀県"
},
"水口高等学校": {
"読み方": "みなくちこうとうがっこう",
"所在位置": "滋賀県"
},
"水口東高等学校": {
"読み方": "みなくちひがしこうとうがっこう",
"所在位置": "滋賀県"
},
"守山北高等学校": {
"読み方": "もりやまきたこうとうがっこう",
"所在位置": "滋賀県"
},
"八幡高等学校": {
"読み方": "やはたこうとうがっこう",
"所在位置": "福岡県"
},
"八幡工業高等学校": {
"読み方": "はちまんこうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"八幡商業高等学校": {
"読み方": "はちまんしょうぎょうこうとうがっこう",
"所在位置": "滋賀県"
},
"八日市高等学校": {
"読み方": "ようかいちこうとうがっこう",
"所在位置": "滋賀県"
},
"八日市南高等学校": {
"読み方": "ようかいちみなみこうとうがっこう",
"所在位置": "滋賀県"
},
"栗東高等学校": {
"読み方": "りっとうこうとうがっこう",
"所在位置": "滋賀県"
},
"滋賀短期大学附属高等学校": {
"読み方": "しがたんきだいがくふぞくこうとうがっこう",
"所在位置": "滋賀県"
},
"至学館高等学校": {
"読み方": "しがくかんこうとうがっこう",
"所在位置": "愛知県"
},
"静岡英和女学院高等学校": {
"読み方": "しずおかえいわじょがくいんこうとうがっこう",
"所在位置": "静岡県"
},
"静岡学園高等学校": {
"読み方": "しずおかがくえんこうとうがっこう",
"所在位置": "静岡県"
},
"静岡北高等学校": {
"読み方": "しずおかきたこうとうがっこう",
"所在位置": "静岡県"
},
"静岡県富士見高等学校": {
"読み方": "しずおかけんふじみこうとうがっこう",
"所在位置": "静岡県"
},
"熱海高等学校": {
"読み方": "あたみこうとうがっこう",
"所在位置": "静岡県"
},
"新居高等学校": {
"読み方": "あらいこうとうがっこう",
"所在位置": "静岡県"
},
"池新田高等学校": {
"読み方": "いけしんでんこうとうがっこう",
"所在位置": "静岡県"
},
"伊豆総合高等学校": {
"読み方": "いずそうごうこうとうがっこう",
"所在位置": "静岡県"
},
"伊豆中央高等学校": {
"読み方": "いずちゅうおうこうとうがっこう",
"所在位置": "静岡県"
},
"磐田北高等学校": {
"読み方": "いわたきたこうとうがっこう",
"所在位置": "静岡県"
},
"磐田西高等学校": {
"読み方": "いわたにしこうとうがっこう",
"所在位置": "静岡県"
},
"磐田農業高等学校": {
"読み方": "いわたのうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"磐田南高等学校": {
"読み方": "いわたみなみこうとうがっこう",
"所在位置": "静岡県"
},
"清流館高等学校": {
"読み方": "せいりゅうかんこうとうがっこう",
"所在位置": "静岡県"
},
"小笠高等学校": {
"読み方": "おがさこうとうがっこう",
"所在位置": "静岡県"
},
"科学技術高等学校": {
"読み方": "かがくぎじゅつこうとうがっこう",
"所在位置": "福井県"
},
"掛川工業高等学校": {
"読み方": "かけがわこうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"掛川西高等学校": {
"読み方": "かけがわにしこうとうがっこう",
"所在位置": "静岡県"
},
"掛川東高等学校": {
"読み方": "かけがわひがしこうとうがっこう",
"所在位置": "静岡県"
},
"金谷高等学校": {
"読み方": "かなやこうとうがっこう",
"所在位置": "静岡県"
},
"川根高等学校": {
"読み方": "かわねこうとうがっこう",
"所在位置": "静岡県"
},
"湖西高等学校": {
"読み方": "こさいこうとうがっこう",
"所在位置": "静岡県"
},
"御殿場高等学校": {
"読み方": "ごてんばこうとうがっこう",
"所在位置": "静岡県"
},
"御殿場南高等学校": {
"読み方": "ごてんばみなみこうとうがっこう",
"所在位置": "静岡県"
},
"小山高等学校": {
"読み方": "おやまこうとうがっこう",
"所在位置": "栃木県"
},
"相良高等学校": {
"読み方": "さがらこうとうがっこう",
"所在位置": "静岡県"
},
"静岡高等学校": {
"読み方": "しずおかこうとうがっこう",
"所在位置": "静岡県"
},
"静岡商業高等学校": {
"読み方": "しずおかしょうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"静岡城北高等学校": {
"読み方": "しずおかじょうほくこうとうがっこう",
"所在位置": "静岡県"
},
"静岡中央高等学校": {
"読み方": "しずおかちゅうおうこうとうがっこう",
"所在位置": "静岡県"
},
"静岡西高等学校": {
"読み方": "しずおかにしこうとうがっこう",
"所在位置": "静岡県"
},
"静岡東高等学校": {
"読み方": "しずおかひがしこうとうがっこう",
"所在位置": "静岡県"
},
"島田高等学校": {
"読み方": "しまだこうとうがっこう",
"所在位置": "静岡県"
},
"島田工業高等学校": {
"読み方": "しまだこうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"島田商業高等学校": {
"読み方": "しまだしょうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"清水西高等学校": {
"読み方": "しみずにしこうとうがっこう",
"所在位置": "静岡県"
},
"清水東高等学校": {
"読み方": "しみずひがしこうとうがっこう",
"所在位置": "静岡県"
},
"下田高等学校": {
"読み方": "しもだこうとうがっこう",
"所在位置": "静岡県"
},
"天竜高等学校二俣校舎": {
"読み方": "てんりゅうこうとうがっこうふたまたこうしゃ",
"所在位置": "静岡県"
},
"遠江総合高等学校": {
"読み方": "とおとうみそうごうこうとうがっこう",
"所在位置": "静岡県"
},
"韮山高等学校": {
"読み方": "にらやまこうとうがっこう",
"所在位置": "静岡県"
},
"沼津工業高等学校": {
"読み方": "ぬまづこうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"沼津商業高等学校": {
"読み方": "ぬまづしょうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"沼津城北高等学校": {
"読み方": "ぬまづじょうほくこうとうがっこう",
"所在位置": "静岡県"
},
"沼津西高等学校": {
"読み方": "ぬまづにしこうとうがっこう",
"所在位置": "静岡県"
},
"沼津東高等学校": {
"読み方": "ぬまづひがしこうとうがっこう",
"所在位置": "静岡県"
},
"榛原高等学校": {
"読み方": "はいばらこうとうがっこう",
"所在位置": "静岡県"
},
"浜北西高等学校": {
"読み方": "はまきたにしこうとうがっこう",
"所在位置": "静岡県"
},
"浜名高等学校": {
"読み方": "はまなこうとうがっこう",
"所在位置": "静岡県"
},
"浜松江之島高等学校": {
"読み方": "はままつえのしまこうとうがっこう",
"所在位置": "静岡県"
},
"浜松大平台高等学校": {
"読み方": "はままつおおひらだいこうとうがっこう",
"所在位置": "静岡県"
},
"浜松北高等学校": {
"読み方": "はままつきたこうとうがっこう",
"所在位置": "静岡県"
},
"浜松工業高等学校": {
"読み方": "はままつこうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"浜松湖東高等学校": {
"読み方": "はままつことうこうとうがっこう",
"所在位置": "静岡県"
},
"浜松湖南高等学校": {
"読み方": "はままつこなんこうとうがっこう",
"所在位置": "静岡県"
},
"浜松城北工業高等学校": {
"読み方": "はままつじょうほくこうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"浜松商業高等学校": {
"読み方": "はままつしょうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"浜松東高等学校": {
"読み方": "はままつひがしこうとうがっこう",
"所在位置": "静岡県"
},
"浜松南高等学校": {
"読み方": "はままつみなみこうとうがっこう",
"所在位置": "静岡県"
},
"袋井高等学校": {
"読み方": "ふくろいこうとうがっこう",
"所在位置": "静岡県"
},
"袋井商業高等学校": {
"読み方": "ふくろいしょうぎょうこうとうがっこう",
"所在位置": "静岡県"
},
"富士高等学校": {
"読み方": "ふじこうとうがっこう",
"所在位置": "静岡県"
},
"藤枝北高等学校": {
"読み方": "ふじえだきたこうとうがっこう",
"所在位置": "静岡県"
},
"藤枝西高等学校": {
"読み方": "ふじえだにしこうとうがっこう",
"所在位置": "静岡県"
},
"藤枝東高等学校": {
"読み方": "ふじえだひがしこうとうがっこう",
"所在位置": "静岡県"
},
"富士宮北高等学校": {
"読み方": "ふじのみやきたこうとうがっこう",
"所在位置": "静岡県"
},
"富士宮西高等学校": {
"読み方": "ふじのみやにしこうとうがっこう",
"所在位置": "静岡県"
},
"富士宮東高等学校": {
"読み方": "ふじのみやひがしこうとうがっこう",
"所在位置": "静岡県"
},
"富岳館高等学校": {
"読み方": "ふがくかんこうとうがっこう",
"所在位置": "静岡県"
},
"富士東高等学校": {
"読み方": "ふじひがしこうとうがっこう",
"所在位置": "静岡県"
},
"三島北高等学校": {
"読み方": "みしまきたこうとうがっこう",
"所在位置": "静岡県"
},
"三島長陵高等学校": {
"読み方": "みしまちょうりょうこうとうがっこう",
"所在位置": "静岡県"
},
"三島南高等学校": {
"読み方": "みしまみなみこうとうがっこう",
"所在位置": "静岡県"
},
"焼津水産高等学校": {
"読み方": "やいづすいさんこうとうがっこう",
"所在位置": "静岡県"
},
"焼津中央高等学校": {
"読み方": "やいづちゅうおうこうとうがっこう",
"所在位置": "静岡県"
},
"吉原高等学校": {
"読み方": "よしわらこうとうがっこう",
"所在位置": "静岡県"
},
"静岡女子高等学校": {
"読み方": "しずおかじょしこうとうがっこう",
"所在位置": "静岡県"
},
"静岡市立高等学校": {
"読み方": "しずおかしりつこうとうがっこう",
"所在位置": "静岡県"
},
"清水桜が丘高等学校": {
"読み方": "しみずさくらがおかこうとうがっこう",
"所在位置": "静岡県"
},
"静岡聖光学院高等学校": {
"読み方": "しずおかせいこうがくいんこうとうがっこう",
"所在位置": "静岡県"
},
"静岡大成高等学校": {
"読み方": "しずおかたいせいこうとうがっこう",
"所在位置": "静岡県"
},
"静岡雙葉高等学校": {
"読み方": "しずおかふたばこうとうがっこう",
"所在位置": "静岡県"
},
"信濃むつみ高等学校": {
"読み方": "しなのむつみこうとうがっこう",
"所在位置": "長野県"
},
"芝浦工業大学柏高等学校": {
"読み方": "しばうらこうぎょうだいがくかしわこうとうがっこう",
"所在位置": "千葉県"
},
"柴田学園高等学校": {
"読み方": "しばたがくえんこうとうがっこう",
"所在位置": "青森県"
},
"新発田中央高等学校": {
"読み方": "しばたちゅうおうこうとうがっこう",
"所在位置": "新潟県"
},
"渋谷教育学園幕張高等学校": {
"読み方": "しぶやきょういくがくえんまくはりこうとうがっこう",
"所在位置": "千葉県"
},
"島田樟誠高等学校": {
"読み方": "しまだしょうせいこうとうがっこう",
"所在位置": "静岡県"
},
"出雲高等学校": {
"読み方": "いずもこうとうがっこう",
"所在位置": "島根県"
},
"出雲工業高等学校": {
"読み方": "いずもこうぎょうこうとうがっこう",
"所在位置": "島根県"
},
"出雲商業高等学校": {
"読み方": "いずもしょうぎょうこうとうがっこう",
"所在位置": "島根県"
},
"出雲農林高等学校": {
"読み方": "いずものうりんこうとうがっこう",
"所在位置": "島根県"
},
"大田高等学校": {
"読み方": "おおだこうとうがっこう",
"所在位置": "島根県"
},
"島根中央高等学校": {
"読み方": "しまねちゅうおうこうとうがっこう",
"所在位置": "島根県"
},
"宍道高等学校": {
"読み方": "しんじこうとうがっこう",
"所在位置": "島根県"
},
"大社高等学校": {
"読み方": "たいしゃこうとうがっこう",
"所在位置": "島根県"
},
"津和野高等学校": {
"読み方": "つわのこうとうがっこう",
"所在位置": "島根県"
},
"邇摩高等学校": {
"読み方": "にまこうとうがっこう",
"所在位置": "島根県"
},
"浜田高等学校": {
"読み方": "はまだこうとうがっこう",
"所在位置": "島根県"
},
"浜田水産高等学校": {
"読み方": "はまだすいさんこうとうがっこう",
"所在位置": "島根県"
},
"平田高等学校": {
"読み方": "ひらたこうとうがっこう",
"所在位置": "島根県"
},
"益田高等学校": {
"読み方": "ますだこうとうがっこう",
"所在位置": "島根県"
},
"益田翔陽高等学校": {
"読み方": "ますだしょうようこうとうがっこう",
"所在位置": "島根県"
},
"松江北高等学校": {
"読み方": "まつえきたこうとうがっこう",
"所在位置": "島根県"
},
"松江商業高等学校": {
"読み方": "まつえしょうぎょうこうとうがっこう",
"所在位置": "島根県"
},
"松江農林高等学校": {
"読み方": "まつえのうりんこうとうがっこう",
"所在位置": "島根県"
},
"松江東高等学校": {
"読み方": "まつえひがしこうとうがっこう",
"所在位置": "島根県"
},
"松江南高等学校": {
"読み方": "まつえみなみこうとうがっこう",
"所在位置": "島根県"
},
"三刀屋高等学校": {
"読み方": "みとやこうとうがっこう",
"所在位置": "島根県"
},
"矢上高等学校": {
"読み方": "やかみこうとうがっこう",
"所在位置": "島根県"
},
"安来高等学校": {
"読み方": "やすぎこうとうがっこう",
"所在位置": "島根県"
},
"横田高等学校": {
"読み方": "よこたこうとうがっこう",
"所在位置": "島根県"
},
"島原中央高等学校": {
"読み方": "しまばらちゅうおうこうとうがっこう",
"所在位置": "長崎県"
},
"清水ヶ丘高等学校": {
"読み方": "しみずがおかこうとうがっこう",
"所在位置": "広島県"
},
"清水国際高等学校": {
"読み方": "しみずこくさいこうとうがっこう",
"所在位置": "静岡県"
},
"下関市立下関商業高等学校": {
"読み方": "しものせきしりつしものせきしょうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"自由ケ丘高等学校": {
"読み方": "じゆうがおかこうとうがっこう",
"所在位置": "福岡県"
},
"秀岳館高等学校": {
"読み方": "しゅうがくかんこうとうがっこう",
"所在位置": "熊本県"
},
"就実高等学校": {
"読み方": "しゅうじつこうとうがっこう",
"所在位置": "岡山県"
},
"修道高等学校": {
"読み方": "しゅうどうこうとうがっこう",
"所在位置": "広島県"
},
"自由の森学園高等学校": {
"読み方": "じゆうのもりがくえんこうとうがっこう",
"所在位置": "埼玉県"
},
"修文学院高等学校": {
"読み方": "しゅうぶんがくいんこうとうがっこう",
"所在位置": "愛知県"
},
"秀明八千代高等学校": {
"読み方": "しゅうめいやちよこうとうがっこう",
"所在位置": "千葉県"
},
"夙川高等学校": {
"読み方": "しゅくがわこうとうがっこう",
"所在位置": "兵庫県"
},
"淑徳与野高等学校": {
"読み方": "しゅくとくよのこうとうがっこう",
"所在位置": "埼玉県"
},
"樹徳高等学校": {
"読み方": "じゅとくこうとうがっこう",
"所在位置": "群馬県"
},
"純真高等学校": {
"読み方": "じゅんしんこうとうがっこう",
"所在位置": "福岡県"
},
"淳心学院高等学校": {
"読み方": "じゅんしんがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"純心女子高等学校": {
"読み方": "じゅんしんじょしこうとうがっこう",
"所在位置": "長崎県"
},
"松韻学園福島高等学校": {
"読み方": "しょういんがくえんふくしまこうとうがっこう",
"所在位置": "福島県"
},
"上越高等学校": {
"読み方": "じょうえつこうとうがっこう",
"所在位置": "新潟県"
},
"尚絅高等学校": {
"読み方": "しょうけいこうとうがっこう",
"所在位置": "熊本県"
},
"尚絅学院高等学校": {
"読み方": "しょうけいがくいんこうとうがっこう",
"所在位置": "宮城県"
},
"城西大学付属川越高等学校": {
"読み方": "じょうさいだいがくふぞくかわごえこうとうがっこう",
"所在位置": "埼玉県"
},
"尚志館高等学校": {
"読み方": "しょうしかんこうとうがっこう",
"所在位置": "鹿児島県"
},
"常総学院高等学校": {
"読み方": "じょうそうがくいんこうとうがっこう",
"所在位置": "茨城県"
},
"正智深谷高等学校": {
"読み方": "しょうちふかやこうとうがっこう",
"所在位置": "埼玉県"
},
"松徳学院高等学校": {
"読み方": "しょうとくがくいんこうとうがっこう",
"所在位置": "島根県"
},
"樟南高等学校": {
"読み方": "しょうなんこうとうがっこう",
"所在位置": "鹿児島県"
},
"湘南学院高等学校": {
"読み方": "しょうなんがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"湘南学園高等学校": {
"読み方": "しょうなんがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"湘南工科大学附属高等学校": {
"読み方": "しょうなんこうかだいがくふぞくこうとうがっこう",
"所在位置": "神奈川県"
},
"城南静岡高等学校": {
"読み方": "じょうなんしずおかこうとうがっこう",
"所在位置": "静岡県"
},
"湘南白百合学園高等学校": {
"読み方": "しょうなんしらゆりがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"樟南第二高等学校": {
"読み方": "しょうなんだいにこうとうがっこう",
"所在位置": "鹿児島県"
},
"松柏学院倉吉北高等学校": {
"読み方": "しょうはくがくいんくらよしきたこうとうがっこう",
"所在位置": "鳥取県"
},
"松風塾高等学校": {
"読み方": "しょうふうじゅくこうとうがっこう",
"所在位置": "青森県"
},
"昌平高等学校": {
"読み方": "しょうへいこうとうがっこう",
"所在位置": "埼玉県"
},
"昭和学院高等学校": {
"読み方": "しょうわがくいんこうとうがっこう",
"所在位置": "千葉県"
},
"昭和学院秀英高等学校": {
"読み方": "しょうわがくいんしゅうえいこうとうがっこう",
"所在位置": "千葉県"
},
"昭和学園高等学校": {
"読み方": "しょうわがくえんこうとうがっこう",
"所在位置": "大分県"
},
"昭和薬科大学附属高等学校": {
"読み方": "しょうわやっかだいがくふぞくこうとうがっこう",
"所在位置": "沖縄県"
},
"如水館高等学校": {
"読み方": "じょすいかんこうとうがっこう",
"所在位置": "広島県"
},
"城北埼玉高等学校": {
"読み方": "じょうほくさいたまこうとうがっこう",
"所在位置": "埼玉県"
},
"仁愛高等学校": {
"読み方": "じんあいこうとうがっこう",
"所在位置": "福島県"
},
"仁愛女子高等学校": {
"読み方": "じんあいじょしこうとうがっこう",
"所在位置": "福井県"
},
"神港学園高等学校": {
"読み方": "しんこうがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"新庄東高等学校": {
"読み方": "しんじょうひがしこうとうがっこう",
"所在位置": "山形県"
},
"尽誠学園高等学校": {
"読み方": "じんせいがくえんこうとうがっこう",
"所在位置": "香川県"
},
"真颯館高等学校": {
"読み方": "しんそうかんこうとうがっこう",
"所在位置": "福岡県"
},
"新田高等学校": {
"読み方": "にったこうとうがっこう",
"所在位置": "愛媛県"
},
"進徳学園進徳女子高等学校": {
"読み方": "しんとくがくえんしんとくじょしこうとうがっこう",
"所在位置": "広島県"
},
"親和女子高等学校": {
"読み方": "しんわじょしこうとうがっこう",
"所在位置": "兵庫県"
},
"杉森高等学校": {
"読み方": "すぎもりこうとうがっこう",
"所在位置": "福岡県"
},
"椙山女学園高等学校": {
"読み方": "すぎやまじょがくえんこうとうがっこう",
"所在位置": "愛知県"
},
"逗子開成高等学校": {
"読み方": "ずしかいせいこうとうがっこう",
"所在位置": "神奈川県"
},
"鈴鹿高等学校": {
"読み方": "すずかこうとうがっこう",
"所在位置": "三重県"
},
"広島修道大学ひろしま協創高等学校": {
"読み方": "ひろしましゅうどうだいがくひろしまきょうそうこうとうがっこう",
"所在位置": "広島県"
},
"須磨学園高等学校": {
"読み方": "すまがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"兵庫大学附属須磨ノ浦高等学校": {
"読み方": "ひょうごだいがくふぞくすまのうらこうとうがっこう",
"所在位置": "兵庫県"
},
"駿台甲府高等学校": {
"読み方": "すんだいこうふこうとうがっこう",
"所在位置": "山梨県"
},
"聖ウルスラ学院英智高等学校": {
"読み方": "せいうるすらがくいんえいちこうとうがっこう",
"所在位置": "宮城県"
},
"青雲高等学校": {
"読み方": "せいうんこうとうがっこう",
"所在位置": "兵庫県"
},
"誠英高等学校": {
"読み方": "せいえいこうとうがっこう",
"所在位置": "山口県"
},
"精華女子高等学校": {
"読み方": "せいかじょしこうとうがっこう",
"所在位置": "福岡県"
},
"聖カタリナ学園高等学校": {
"読み方": "せいかたりながくえんこうとうがっこう",
"所在位置": "愛媛県"
},
"聖カピタニオ女子高等学校": {
"読み方": "せいかぴたにおじょしこうとうがっこう",
"所在位置": "愛知県"
},
"聖光高等学校": {
"読み方": "せいこうこうとうがっこう",
"所在位置": "山口県"
},
"生光学園高等学校": {
"読み方": "せいこうがくえんこうとうがっこう",
"所在位置": "徳島県"
},
"星槎高等学校": {
"読み方": "せいさこうとうがっこう",
"所在位置": "神奈川県"
},
"誠修高等学校": {
"読み方": "せいしゅうこうとうがっこう",
"所在位置": "福岡県"
},
"星城高等学校": {
"読み方": "せいじょうこうとうがっこう",
"所在位置": "愛知県"
},
"誠信高等学校": {
"読み方": "せいしんこうとうがっこう",
"所在位置": "愛知県"
},
"聖心ウルスラ学園高等学校": {
"読み方": "せいしんうるすらがくえんこうとうがっこう",
"所在位置": "宮崎県"
},
"清真学園高等学校": {
"読み方": "せいしんがくえんこうとうがっこう",
"所在位置": "茨城県"
},
"聖セシリア女子高等学校": {
"読み方": "せいせしりあじょしこうとうがっこう",
"所在位置": "神奈川県"
},
"清泉女学院高等学校": {
"読み方": "せいせんじょがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"光英VERITAS高等学校": {
"読み方": "せいとくだいがくふぞくじょしこうとうがっこう",
"所在位置": "千葉県"
},
"聖徳大学附属取手聖徳女子高等学校": {
"読み方": "せいとくだいがくふぞくとりでせいとくじょしこうとうがっこう",
"所在位置": "茨城県"
},
"聖ドミニコ学院高等学校": {
"読み方": "せいどみにこがくいんこうとうがっこう",
"所在位置": "宮城県"
},
"西南学院高等学校": {
"読み方": "せいなんがくいんこうとうがっこう",
"所在位置": "福岡県"
},
"西南女学院高等学校": {
"読み方": "せいなんじょがくいんこうとうがっこう",
"所在位置": "福岡県"
},
"西武学園文理高等学校": {
"読み方": "せいぶがくえんぶんりこうとうがっこう",
"所在位置": "埼玉県"
},
"西武台高等学校": {
"読み方": "せいぶだいこうとうがっこう",
"所在位置": "埼玉県"
},
"西武台千葉高等学校": {
"読み方": "せいぶだいちばこうとうがっこう",
"所在位置": "千葉県"
},
"聖望学園高等学校": {
"読み方": "せいぼうがくえんこうとうがっこう",
"所在位置": "埼玉県"
},
"聖マリア女学院高等学校": {
"読み方": "せいまりあじょがくいんこうとうがっこう",
"所在位置": "岐阜県"
},
"青藍泰斗高等学校": {
"読み方": "せいらんたいとこうとうがっこう",
"所在位置": "栃木県"
},
"星稜高等学校": {
"読み方": "せいりょうこうとうがっこう",
"所在位置": "石川県"
},
"星陵高等学校": {
"読み方": "せいりょうこうとうがっこう",
"所在位置": "兵庫県"
},
"星琳高等学校": {
"読み方": "せいりんこうとうがっこう",
"所在位置": "福岡県"
},
"清林館高等学校": {
"読み方": "せいりんかんこうとうがっこう",
"所在位置": "愛知県"
},
"聖霊高等学校": {
"読み方": "せいれいこうとうがっこう",
"所在位置": "愛知県"
},
"聖隷クリストファー高等学校": {
"読み方": "せいれいくりすとふぁーこうとうがっこう",
"所在位置": "静岡県"
},
"聖霊女子短期大学付属高等学校": {
"読み方": "せいれいじょしたんきだいがくふぞくこうとうがっこう",
"所在位置": "秋田県"
},
"聖和学院高等学校": {
"読み方": "せいわがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"聖和学園高等学校": {
"読み方": "せいわがくえんこうとうがっこう",
"所在位置": "宮城県"
},
"聖和女子学院高等学校": {
"読み方": "せいわじょしがくいんこうとうがっこう",
"所在位置": "長崎県"
},
"関市立関商工高等学校": {
"読み方": "せきしりつせきしょうこうこうとうがっこう",
"所在位置": "岐阜県"
},
"関根学園高等学校": {
"読み方": "せきねがくえんこうとうがっこう",
"所在位置": "新潟県"
},
"瀬戸内高等学校": {
"読み方": "せとうちこうとうがっこう",
"所在位置": "広島県"
},
"広島桜が丘高等学校": {
"読み方": "ひろしまさくらがおかこうとうがっこう",
"所在位置": "広島県"
},
"専修大学北上高等学校": {
"読み方": "せんしゅうだいがくきたかみこうとうがっこう",
"所在位置": "岩手県"
},
"専修大学熊本玉名高等学校": {
"読み方": "せんしゅうだいがくくまもとたまなこうとうがっこう",
"所在位置": "熊本県"
},
"専修大学松戸高等学校": {
"読み方": "せんしゅうだいがくまつどこうとうがっこう",
"所在位置": "千葉県"
},
"洗足学園高等学校": {
"読み方": "せんぞくがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"仙台育英学園高等学校": {
"読み方": "せんだいいくえいがくえんこうとうがっこう",
"所在位置": "宮城県"
},
"仙台白百合学園高等学校": {
"読み方": "せんだいしらゆりがくえんこうとうがっこう",
"所在位置": "宮城県"
},
"仙台市立仙台高等学校": {
"読み方": "せんだいしりつせんだいこうとうがっこう",
"所在位置": "宮城県"
},
"仙台市立仙台工業高等学校": {
"読み方": "せんだいしりつせんだいこうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"仙台市立仙台商業高等学校": {
"読み方": "せんだいしりつせんだいしょうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"仙台市立仙台大志高等学校": {
"読み方": "せんだいしりつせんだいたいしこうとうがっこう",
"所在位置": "宮城県"
},
"セントヨゼフ女子学園高等学校": {
"読み方": "せんとよぜふじょしがくえんこうとうがっこう",
"所在位置": "三重県"
},
"創志学園高等学校": {
"読み方": "そうしがくえんこうとうがっこう",
"所在位置": "岡山県"
},
"捜真女学校高等学部": {
"読み方": "そうしんじょがっこうこうとうがくぶ",
"所在位置": "神奈川県"
},
"創成館高等学校": {
"読み方": "そうせいかんこうとうがっこう",
"所在位置": "長崎県"
},
"崇徳高等学校": {
"読み方": "そうとくこうとうがっこう",
"所在位置": "広島県"
},
"相洋高等学校": {
"読み方": "そうようこうとうがっこう",
"所在位置": "神奈川県"
},
"園田学園高等学校": {
"読み方": "そのだがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"第一薬科大学付属高等学校": {
"読み方": "だいいちやっかだいがくふぞくこうとうがっこう",
"所在位置": "福岡県"
},
"上智福岡高等学校": {
"読み方": "じょうちふくおかこうとうがっこう",
"所在位置": "福岡県"
},
"大成女子高等学校": {
"読み方": "たいせいじょしこうとうがっこう",
"所在位置": "茨城県"
},
"大同大学大同高等学校": {
"読み方": "だいどうだいがくだいどうこうとうがっこう",
"所在位置": "愛知県"
},
"高岡向陵高等学校": {
"読み方": "たかおかこうりょうこうとうがっこう",
"所在位置": "富山県"
},
"高岡第一高等学校": {
"読み方": "たかおかだいいちこうとうがっこう",
"所在位置": "富山県"
},
"高岡龍谷高等学校": {
"読み方": "たかおかりゅうこくこうとうがっこう",
"所在位置": "富山県"
},
"高川学園高等学校": {
"読み方": "たかがわがくえんこうとうがっこう",
"所在位置": "山口県"
},
"高崎経済大学附属高等学校": {
"読み方": "たかさきけいざいだいがくふぞくこうとうがっこう",
"所在位置": "群馬県"
},
"高崎健康福祉大学高崎高等学校": {
"読み方": "たかさきけんこうふくしだいがくたかさきこうとうがっこう",
"所在位置": "群馬県"
},
"高崎商科大学附属高等学校": {
"読み方": "たかさきしょうかだいがくふぞくこうとうがっこう",
"所在位置": "群馬県"
},
"尚志学園尚志高等学校": {
"読み方": "しょうしこうとうがっこう",
"所在位置": "福島県"
},
"高松第一高等学校": {
"読み方": "たかまつだいいちこうとうがっこう",
"所在位置": "香川県"
},
"高松中央高等学校": {
"読み方": "たかまつちゅうおうこうとうがっこう",
"所在位置": "香川県"
},
"高水高等学校": {
"読み方": "たかみずこうとうがっこう",
"所在位置": "山口県"
},
"高山西高等学校": {
"読み方": "たかやまにしこうとうがっこう",
"所在位置": "岐阜県"
},
"滝高等学校": {
"読み方": "たきこうとうがっこう",
"所在位置": "愛知県"
},
"滝川高等学校": {
"読み方": "たきがわこうとうがっこう",
"所在位置": "兵庫県"
},
"滝川第二高等学校": {
"読み方": "たきがわだいにこうとうがっこう",
"所在位置": "兵庫県"
},
"拓殖大学紅陵高等学校": {
"読み方": "たくしょくだいがくこうりょうこうとうがっこう",
"所在位置": "千葉県"
},
"武田高等学校": {
"読み方": "たけだこうとうがっこう",
"所在位置": "広島県"
},
"広島文教大学附属高等学校": {
"読み方": "ひろしまぶんきょうだいがくふぞくこうとうがっこう",
"所在位置": "広島県"
},
"竹田南高等学校": {
"読み方": "たけたみなみこうとうがっこう",
"所在位置": "大分県"
},
"多治見西高等学校": {
"読み方": "たじみにしこうとうがっこう",
"所在位置": "岐阜県"
},
"橘学苑高等学校": {
"読み方": "たちばながくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"立花学園高等学校": {
"読み方": "たちばながくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"玉名女子高等学校": {
"読み方": "たまなじょしこうとうがっこう",
"所在位置": "熊本県"
},
"玉野商工高等学校": {
"読み方": "たまのしょうこうこうとうがっこう",
"所在位置": "岡山県"
},
"筑陽学園高等学校": {
"読み方": "ちくようがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"千葉学園高等学校": {
"読み方": "ちばがくえんこうとうがっこう",
"所在位置": "青森県"
},
"千葉学芸高等学校": {
"読み方": "ちばがくげいこうとうがっこう",
"所在位置": "千葉県"
},
"千葉敬愛高等学校": {
"読み方": "ちばけいあいこうとうがっこう",
"所在位置": "千葉県"
},
"千葉経済大学附属高等学校": {
"読み方": "ちばけいざいだいがくふぞくこうとうがっこう",
"所在位置": "千葉県"
},
"旭農業高等学校": {
"読み方": "あさひのうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"姉崎高等学校": {
"読み方": "あねさきこうとうがっこう",
"所在位置": "千葉県"
},
"我孫子高等学校": {
"読み方": "あびここうとうがっこう",
"所在位置": "千葉県"
},
"安房高等学校": {
"読み方": "あわこうとうがっこう",
"所在位置": "千葉県"
},
"安房拓心高等学校": {
"読み方": "あわたくしんこうとうがっこう",
"所在位置": "千葉県"
},
"泉高等学校": {
"読み方": "いずみこうとうがっこう",
"所在位置": "宮城県"
},
"磯辺高等学校": {
"読み方": "いそべこうとうがっこう",
"所在位置": "千葉県"
},
"市川工業高等学校": {
"読み方": "いちかわこうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"市川昴高等学校": {
"読み方": "いちかわすばるこうとうがっこう",
"所在位置": "千葉県"
},
"市川東高等学校": {
"読み方": "いちかわひがしこうとうがっこう",
"所在位置": "千葉県"
},
"市川南高等学校": {
"読み方": "いちかわみなみこうとうがっこう",
"所在位置": "千葉県"
},
"市原高等学校": {
"読み方": "いちはらこうとうがっこう",
"所在位置": "千葉県"
},
"市原緑高等学校": {
"読み方": "いちはらみどりこうとうがっこう",
"所在位置": "千葉県"
},
"市原八幡高等学校": {
"読み方": "いちはらやわたこうとうがっこう",
"所在位置": "千葉県"
},
"印旛明誠高等学校": {
"読み方": "いんばめいせいこうとうがっこう",
"所在位置": "千葉県"
},
"浦安高等学校": {
"読み方": "うらやすこうとうがっこう",
"所在位置": "千葉県"
},
"浦安南高等学校": {
"読み方": "うらやすみなみこうとうがっこう",
"所在位置": "千葉県"
},
"生浜高等学校": {
"読み方": "おいはまこうとうがっこう",
"所在位置": "千葉県"
},
"大多喜高等学校": {
"読み方": "おおたきこうとうがっこう",
"所在位置": "千葉県"
},
"大原高等学校": {
"読み方": "おおはらこうとうがっこう",
"所在位置": "千葉県"
},
"小見川高等学校": {
"読み方": "おみがわこうとうがっこう",
"所在位置": "千葉県"
},
"柏高等学校": {
"読み方": "かしわこうとうがっこう",
"所在位置": "千葉県"
},
"柏井高等学校": {
"読み方": "かしわいこうとうがっこう",
"所在位置": "千葉県"
},
"柏中央高等学校": {
"読み方": "かしわちゅうおうこうとうがっこう",
"所在位置": "千葉県"
},
"柏の葉高等学校": {
"読み方": "かしわのはこうとうがっこう",
"所在位置": "千葉県"
},
"柏南高等学校": {
"読み方": "かしわみなみこうとうがっこう",
"所在位置": "千葉県"
},
"鎌ヶ谷高等学校": {
"読み方": "かまがやこうとうがっこう",
"所在位置": "千葉県"
},
"鎌ヶ谷西高等学校": {
"読み方": "かまがやにしこうとうがっこう",
"所在位置": "千葉県"
},
"木更津高等学校": {
"読み方": "きさらづこうとうがっこう",
"所在位置": "千葉県"
},
"木更津東高等学校": {
"読み方": "きさらづひがしこうとうがっこう",
"所在位置": "千葉県"
},
"君津高等学校": {
"読み方": "きみつこうとうがっこう",
"所在位置": "千葉県"
},
"君津商業高等学校": {
"読み方": "きみつしょうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"行徳高等学校": {
"読み方": "ぎょうとくこうとうがっこう",
"所在位置": "千葉県"
},
"九十九里高等学校": {
"読み方": "くじゅうくりこうとうがっこう",
"所在位置": "千葉県"
},
"京葉高等学校": {
"読み方": "けいようこうとうがっこう",
"所在位置": "千葉県"
},
"京葉工業高等学校": {
"読み方": "けいようこうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"検見川高等学校": {
"読み方": "けみがわこうとうがっこう",
"所在位置": "千葉県"
},
"国府台高等学校": {
"読み方": "こうのだいこうとうがっこう",
"所在位置": "千葉県"
},
"小金高等学校": {
"読み方": "こがねこうとうがっこう",
"所在位置": "千葉県"
},
"犢橋高等学校": {
"読み方": "こてはしこうとうがっこう",
"所在位置": "千葉県"
},
"佐倉高等学校": {
"読み方": "さくらこうとうがっこう",
"所在位置": "千葉県"
},
"佐倉西高等学校": {
"読み方": "さくらにしこうとうがっこう",
"所在位置": "千葉県"
},
"佐倉東高等学校": {
"読み方": "さくらひがしこうとうがっこう",
"所在位置": "千葉県"
},
"佐倉南高等学校": {
"読み方": "さくらみなみこうとうがっこう",
"所在位置": "千葉県"
},
"佐原高等学校": {
"読み方": "さわらこうとうがっこう",
"所在位置": "千葉県"
},
"佐原白楊高等学校": {
"読み方": "さわらはくようこうとうがっこう",
"所在位置": "千葉県"
},
"沼南高等学校": {
"読み方": "しょうなんこうとうがっこう",
"所在位置": "千葉県"
},
"沼南高柳高等学校": {
"読み方": "しょうなんたかやなぎこうとうがっこう",
"所在位置": "千葉県"
},
"白井高等学校": {
"読み方": "しろいこうとうがっこう",
"所在位置": "千葉県"
},
"関宿高等学校": {
"読み方": "せきやどこうとうがっこう",
"所在位置": "千葉県"
},
"匝瑳高等学校": {
"読み方": "そうさこうとうがっこう",
"所在位置": "千葉県"
},
"袖ヶ浦高等学校": {
"読み方": "そでがうらこうとうがっこう",
"所在位置": "千葉県"
},
"大網高等学校": {
"読み方": "おおあみこうとうがっこう",
"所在位置": "千葉県"
},
"多古高等学校": {
"読み方": "たここうとうがっこう",
"所在位置": "千葉県"
},
"館山総合高等学校": {
"読み方": "たてやまそうごうこうとうがっこう",
"所在位置": "千葉県"
},
"千城台高等学校": {
"読み方": "ちしろだいこうとうがっこう",
"所在位置": "千葉県"
},
"千葉高等学校": {
"読み方": "ちばこうとうがっこう",
"所在位置": "千葉県"
},
"千葉北高等学校": {
"読み方": "ちばきたこうとうがっこう",
"所在位置": "千葉県"
},
"千葉工業高等学校": {
"読み方": "ちばこうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"千葉商業高等学校": {
"読み方": "ちばしょうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"千葉女子高等学校": {
"読み方": "ちばじょしこうとうがっこう",
"所在位置": "千葉県"
},
"千葉西高等学校": {
"読み方": "ちばにしこうとうがっこう",
"所在位置": "千葉県"
},
"千葉東高等学校": {
"読み方": "ちばひがしこうとうがっこう",
"所在位置": "千葉県"
},
"千葉南高等学校": {
"読み方": "ちばみなみこうとうがっこう",
"所在位置": "千葉県"
},
"銚子高等学校": {
"読み方": "ちょうしこうとうがっこう",
"所在位置": "千葉県"
},
"銚子商業高等学校": {
"読み方": "ちょうししょうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"長生高等学校": {
"読み方": "ちょうせいこうとうがっこう",
"所在位置": "千葉県"
},
"津田沼高等学校": {
"読み方": "つだぬまこうとうがっこう",
"所在位置": "千葉県"
},
"東金高等学校": {
"読み方": "とうがねこうとうがっこう",
"所在位置": "千葉県"
},
"東金商業高等学校": {
"読み方": "とうがねしょうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"東総工業高等学校": {
"読み方": "とうそうこうぎょうこうとうがっこう",
"所在位置": "千葉県"
},
"土気高等学校": {
"読み方": "とけこうとうがっこう",
"所在位置": "千葉県"
},
"富里高等学校": {
"読み方": "とみさとこうとうがっこう",
"所在位置": "千葉県"
},
"長狭高等学校": {
"読み方": "ながさこうとうがっこう",
"所在位置": "千葉県"
},
"流山高等学校": {
"読み方": "ながれやまこうとうがっこう",
"所在位置": "千葉県"
},
"流山おおたかの森高等学校": {
"読み方": "ながれやまおおたかのもりこうとうがっこう",
"所在位置": "千葉県"
},
"流山北高等学校": {
"読み方": "ながれやまきたこうとうがっこう",
"所在位置": "千葉県"
},
"流山南高等学校": {
"読み方": "ながれやまみなみこうとうがっこう",
"所在位置": "千葉県"
},
"成田北高等学校": {
"読み方": "なりたきたこうとうがっこう",
"所在位置": "千葉県"
},
"成田国際高等学校": {
"読み方": "なりたこくさいこうとうがっこう",
"所在位置": "千葉県"
},
"成田西陵高等学校": {
"読み方": "なりたせいりょうこうとうがっこう",
"所在位置": "千葉県"
},
"成東高等学校": {
"読み方": "なるとうこうとうがっこう",
"所在位置": "千葉県"
},
"野田中央高等学校": {
"読み方": "のだちゅうおうこうとうがっこう",
"所在位置": "千葉県"
},
"柏陵高等学校": {
"読み方": "はくりょうこうとうがっこう",
"所在位置": "福岡県"
},
"東葛飾高等学校": {
"読み方": "ひがしかつしかこうとうがっこう",
"所在位置": "千葉県"
},
"我孫子東高等学校": {
"読み方": "あびこひがしこうとうがっこう",
"所在位置": "千葉県"
},
"船橋高等学校": {
"読み方": "ふなばしこうとうがっこう",
"所在位置": "千葉県"
},
"船橋北高等学校": {
"読み方": "ふなばしきたこうとうがっこう",
"所在位置": "千葉県"
},
"船橋啓明高等学校": {
"読み方": "ふなばしけいめいこうとうがっこう",
"所在位置": "千葉県"
},
"船橋古和釜高等学校": {
"読み方": "ふなばしこわがまこうとうがっこう",
"所在位置": "千葉県"
},
"船橋芝山高等学校": {
"読み方": "ふなばししばやまこうとうがっこう",
"所在位置": "千葉県"
},
"船橋豊富高等学校": {
"読み方": "ふなばしとよとみこうとうがっこう",
"所在位置": "千葉県"
},
"船橋東高等学校": {
"読み方": "ふなばしひがしこうとうがっこう",
"所在位置": "千葉県"
},
"船橋二和高等学校": {
"読み方": "ふなばしふたわこうとうがっこう",
"所在位置": "千葉県"
},
"船橋法典高等学校": {
"読み方": "ふなばしほうでんこうとうがっこう",
"所在位置": "千葉県"
},
"幕張総合高等学校": {
"読み方": "まくはりそうごうこうとうがっこう",
"所在位置": "千葉県"
},
"松尾高等学校": {
"読み方": "まつおこうとうがっこう",
"所在位置": "千葉県"
},
"松戸高等学校": {
"読み方": "まつどこうとうがっこう",
"所在位置": "千葉県"
},
"松戸向陽高等学校": {
"読み方": "まつどこうようこうとうがっこう",
"所在位置": "千葉県"
},
"松戸国際高等学校": {
"読み方": "まつどこくさいこうとうがっこう",
"所在位置": "千葉県"
},
"松戸馬橋高等学校": {
"読み方": "まつどまばしこうとうがっこう",
"所在位置": "千葉県"
},
"松戸南高等学校": {
"読み方": "まつどみなみこうとうがっこう",
"所在位置": "千葉県"
},
"松戸六実高等学校": {
"読み方": "まつどむつみこうとうがっこう",
"所在位置": "千葉県"
},
"実籾高等学校": {
"読み方": "みもみこうとうがっこう",
"所在位置": "千葉県"
},
"茂原高等学校": {
"読み方": "もばらこうとうがっこう",
"所在位置": "千葉県"
},
"茂原樟陽高等学校": {
"読み方": "もばらしょうようこうとうがっこう",
"所在位置": "千葉県"
},
"薬園台高等学校": {
"読み方": "やくえんだいこうとうがっこう",
"所在位置": "千葉県"
},
"八街高等学校": {
"読み方": "やちまたこうとうがっこう",
"所在位置": "千葉県"
},
"八千代西高等学校": {
"読み方": "やちよにしこうとうがっこう",
"所在位置": "千葉県"
},
"八千代東高等学校": {
"読み方": "やちよひがしこうとうがっこう",
"所在位置": "千葉県"
},
"四街道高等学校": {
"読み方": "よつかいどうこうとうがっこう",
"所在位置": "千葉県"
},
"四街道北高等学校": {
"読み方": "よつかいどうきたこうとうがっこう",
"所在位置": "千葉県"
},
"若松高等学校": {
"読み方": "わかまつこうとうがっこう",
"所在位置": "福岡県"
},
"翔凜高等学校": {
"読み方": "しょうりんこうとうがっこう",
"所在位置": "千葉県"
},
"千葉商科大学付属高等学校": {
"読み方": "ちばしょうかだいがくふぞくこうとうがっこう",
"所在位置": "千葉県"
},
"千葉市立稲毛高等学校": {
"読み方": "ちばしりついなげこうとうがっこう",
"所在位置": "千葉県"
},
"千葉市立千葉高等学校": {
"読み方": "ちばしりつちばこうとうがっこう",
"所在位置": "千葉県"
},
"千葉聖心高等学校": {
"読み方": "ちばせいしんこうとうがっこう",
"所在位置": "千葉県"
},
"千葉日本大学第一高等学校": {
"読み方": "ちばにほんだいがくだいいちこうとうがっこう",
"所在位置": "千葉県"
},
"千葉英和高等学校": {
"読み方": "ちばえいわこうとうがっこう",
"所在位置": "千葉県"
},
"千葉萌陽高等学校": {
"読み方": "ちばほうようこうとうがっこう",
"所在位置": "千葉県"
},
"千葉明徳高等学校": {
"読み方": "ちばめいとくこうとうがっこう",
"所在位置": "千葉県"
},
"千葉黎明高等学校": {
"読み方": "ちばれいめいこうとうがっこう",
"所在位置": "千葉県"
},
"智辯学園高等学校": {
"読み方": "ちべんがくえんこうとうがっこう",
"所在位置": "奈良県"
},
"智辯学園奈良カレッジ高等部": {
"読み方": "ちべんがくえんならかれっじこうとうぶ",
"所在位置": "奈良県"
},
"智辯学園和歌山高等学校": {
"読み方": "ちべんがくえんわかやまこうとうがっこう",
"所在位置": "和歌山県"
},
"中央学院高等学校": {
"読み方": "ちゅうおうがくいんこうとうがっこう",
"所在位置": "千葉県"
},
"中央大学附属横浜高等学校": {
"読み方": "ちゅうおうだいがくふぞくよこはまこうとうがっこう",
"所在位置": "神奈川県"
},
"中京高等学校": {
"読み方": "ちゅうきょうこうとうがっこう",
"所在位置": "岐阜県"
},
"中京大学附属中京高等学校": {
"読み方": "ちゅうきょうだいがくふぞくちゅうきょうこうとうがっこう",
"所在位置": "愛知県"
},
"中部大学第一高等学校": {
"読み方": "ちゅうぶだいがくだいいちこうとうがっこう",
"所在位置": "愛知県"
},
"銚子市立銚子高等学校": {
"読み方": "ちょうししりつちょうしこうとうがっこう",
"所在位置": "千葉県"
},
"鎮西高等学校": {
"読み方": "ちんぜいこうとうがっこう",
"所在位置": "熊本県"
},
"鎮西学院高等学校": {
"読み方": "ちんぜいがくいんこうとうがっこう",
"所在位置": "長崎県"
},
"筑紫女学園高等学校": {
"読み方": "ちくしじょがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"筑紫台高等学校": {
"読み方": "ちくしだいこうとうがっこう",
"所在位置": "福岡県"
},
"つくば開成高等学校": {
"読み方": "つくばかいせいこうとうがっこう",
"所在位置": "茨城県"
},
"つくば国際大学高等学校": {
"読み方": "つくばこくさいだいがくこうとうがっこう",
"所在位置": "茨城県"
},
"つくば国際大学東風高等学校": {
"読み方": "つくばこくさいだいがくはるかぜこうとうがっこう",
"所在位置": "茨城県"
},
"つくば秀英高等学校": {
"読み方": "つくばしゅうえいこうとうがっこう",
"所在位置": "茨城県"
},
"筑波大学附属坂戸高等学校": {
"読み方": "つくばだいがくふぞくさかどこうとうがっこう",
"所在位置": "埼玉県"
},
"黄柳野高等学校": {
"読み方": "つげのこうとうがっこう",
"所在位置": "愛知県"
},
"土浦日本大学高等学校": {
"読み方": "つちうらにほんだいがくこうとうがっこう",
"所在位置": "茨城県"
},
"鶴岡東高等学校": {
"読み方": "つるおかひがしこうとうがっこう",
"所在位置": "山形県"
},
"敦賀気比高等学校": {
"読み方": "つるがけひこうとうがっこう",
"所在位置": "福井県"
},
"鶴見大学附属高等学校": {
"読み方": "つるみだいがくふぞくこうとうがっこう",
"所在位置": "神奈川県"
},
"帝京安積高等学校": {
"読み方": "ていきょうあさかこうとうがっこう",
"所在位置": "福島県"
},
"帝京大学可児高等学校": {
"読み方": "ていきょうだいがくかにこうとうがっこう",
"所在位置": "岐阜県"
},
"帝京第五高等学校": {
"読み方": "ていきょうだいごこうとうがっこう",
"所在位置": "愛媛県"
},
"帝京第三高等学校": {
"読み方": "ていきょうだいさんこうとうがっこう",
"所在位置": "山梨県"
},
"帝京長岡高等学校": {
"読み方": "ていきょうながおかこうとうがっこう",
"所在位置": "新潟県"
},
"帝塚山高等学校": {
"読み方": "てづかやまこうとうがっこう",
"所在位置": "奈良県"
},
"天理高等学校": {
"読み方": "てんりこうとうがっこう",
"所在位置": "奈良県"
},
"藤蔭高等学校": {
"読み方": "とういんこうとうがっこう",
"所在位置": "大分県"
},
"桐蔭学園高等学校": {
"読み方": "とういんがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"東奥学園高等学校": {
"読み方": "とうおうがくえんこうとうがっこう",
"所在位置": "青森県"
},
"東奥義塾高等学校": {
"読み方": "とうおうぎじゅくこうとうがっこう",
"所在位置": "青森県"
},
"東海学園高等学校": {
"読み方": "とうかいがくえんこうとうがっこう",
"所在位置": "愛知県"
},
"東海大学付属甲府高等学校": {
"読み方": "とうかいだいがくふぞくこうふこうとうがっこう",
"所在位置": "山梨県"
},
"東海大学付属浦安高等学校": {
"読み方": "とうかいだいがくふぞくうらやすこうとうがっこう",
"所在位置": "千葉県"
},
"東海大学付属相模高等学校": {
"読み方": "とうかいだいがくふぞくさがみこうとうがっこう",
"所在位置": "神奈川県"
},
"東海大学付属静岡翔洋高等学校": {
"読み方": "とうかいだいがくふぞくしずおかしょうようこうとうがっこう",
"所在位置": "静岡県"
},
"東海大学付属福岡高等学校": {
"読み方": "とうかいだいがくふぞくふくおかこうとうがっこう",
"所在位置": "福岡県"
},
"東海大学付属諏訪高等学校": {
"読み方": "とうかいだいがくふぞくすわこうとうがっこう",
"所在位置": "長野県"
},
"東海大学付属熊本星翔高等学校": {
"読み方": "とうかいだいがくふぞくくまもとせいしょうこうとうがっこう",
"所在位置": "熊本県"
},
"東海大学付属市原望洋高等学校": {
"読み方": "とうかいだいがくふぞくいちはらぼうようこうとうがっこう",
"所在位置": "千葉県"
},
"東海大学山形高等学校": {
"読み方": "とうかいだいがくやまがたこうとうがっこう",
"所在位置": "山形県"
},
"東京学館高等学校": {
"読み方": "とうきょうがっかんこうとうがっこう",
"所在位置": "千葉県"
},
"東京学館浦安高等学校": {
"読み方": "とうきょうがっかんうらやすこうとうがっこう",
"所在位置": "千葉県"
},
"東京学館新潟高等学校": {
"読み方": "とうきょうがっかんにいがたこうとうがっこう",
"所在位置": "新潟県"
},
"東京学館船橋高等学校": {
"読み方": "とうきょうがっかんふなばしこうとうがっこう",
"所在位置": "千葉県"
},
"東京成徳大学深谷高等学校": {
"読み方": "とうきょうせいとくだいがくふかやこうとうがっこう",
"所在位置": "埼玉県"
},
"東京都市大学塩尻高等学校": {
"読み方": "とうきょうとしだいがくしおじりこうとうがっこう",
"所在位置": "長野県"
},
"東京農業大学第三高等学校": {
"読み方": "とうきょうのうぎょうだいがくだいさんこうとうがっこう",
"所在位置": "埼玉県"
},
"東京農業大学第二高等学校": {
"読み方": "とうきょうのうぎょうだいがくだいにこうとうがっこう",
"所在位置": "群馬県"
},
"桐光学園高等学校": {
"読み方": "とうこうがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"東大寺学園高等学校": {
"読み方": "とうだいじがくえんこうとうがっこう",
"所在位置": "奈良県"
},
"東邦高等学校": {
"読み方": "とうほうこうとうがっこう",
"所在位置": "愛知県"
},
"同朋高等学校": {
"読み方": "どうほうこうとうがっこう",
"所在位置": "愛知県"
},
"東邦大学付属東邦高等学校": {
"読み方": "とうほうだいがくふぞくとうほうこうとうがっこう",
"所在位置": "千葉県"
},
"東北高等学校": {
"読み方": "とうほくこうとうがっこう",
"所在位置": "宮城県"
},
"東北学院高等学校": {
"読み方": "とうほくがくいんこうとうがっこう",
"所在位置": "宮城県"
},
"東北学院榴ヶ岡高等学校": {
"読み方": "とうほくがくいんつつじがおかこうとうがっこう",
"所在位置": "宮城県"
},
"仙台城南高等学校": {
"読み方": "せんだいじょうなんこうとうがっこう",
"所在位置": "宮城県"
},
"東北生活文化大学高等学校": {
"読み方": "とうほくせいかつぶんかだいがくこうとうがっこう",
"所在位置": "宮城県"
},
"東明館高等学校": {
"読み方": "とうめいかんこうとうがっこう",
"所在位置": "佐賀県"
},
"桐陽高等学校": {
"読み方": "とうようこうとうがっこう",
"所在位置": "静岡県"
},
"東葉高等学校": {
"読み方": "とうようこうとうがっこう",
"所在位置": "千葉県"
},
"東洋大学附属牛久高等学校": {
"読み方": "とうようだいがくふぞくうしくこうとうがっこう",
"所在位置": "茨城県"
},
"東洋大学附属姫路高等学校": {
"読み方": "とうようだいがくふぞくひめじこうとうがっこう",
"所在位置": "兵庫県"
},
"藤嶺学園藤沢高等学校": {
"読み方": "とうれいがくえんふじさわこうとうがっこう",
"所在位置": "神奈川県"
},
"常磐高等学校": {
"読み方": "ときわこうとうがっこう",
"所在位置": "群馬県"
},
"常盤木学園高等学校": {
"読み方": "ときわぎがくえんこうとうがっこう",
"所在位置": "宮城県"
},
"常磐大学高等学校": {
"読み方": "ときわだいがくこうとうがっこう",
"所在位置": "茨城県"
},
"川島高等学校": {
"読み方": "かわしまこうとうがっこう",
"所在位置": "徳島県"
},
"脇町高等学校": {
"読み方": "わきまちこうとうがっこう",
"所在位置": "徳島県"
},
"阿波高等学校": {
"読み方": "あわこうとうがっこう",
"所在位置": "徳島県"
},
"海部高等学校": {
"読み方": "かいふこうとうがっこう",
"所在位置": "徳島県"
},
"阿波西高等学校": {
"読み方": "あわにしこうとうがっこう",
"所在位置": "徳島県"
},
"板野高等学校": {
"読み方": "いたのこうとうがっこう",
"所在位置": "徳島県"
},
"小松島高等学校": {
"読み方": "こまつしまこうとうがっこう",
"所在位置": "徳島県"
},
"小松島西高等学校": {
"読み方": "こまつしまにしこうとうがっこう",
"所在位置": "徳島県"
},
"つるぎ高等学校": {
"読み方": "つるぎこうとうがっこう",
"所在位置": "徳島県"
},
"城西高等学校": {
"読み方": "じょうせいこうとうがっこう",
"所在位置": "徳島県"
},
"城東高等学校": {
"読み方": "じょうとうこうとうがっこう",
"所在位置": "徳島県"
},
"城ノ内高等学校": {
"読み方": "じょうのうちこうとうがっこう",
"所在位置": "徳島県"
},
"城北高等学校": {
"読み方": "じょうほくこうとうがっこう",
"所在位置": "熊本県"
},
"城南高等学校": {
"読み方": "じょうなんこうとうがっこう",
"所在位置": "福岡県"
},
"池田高等学校辻校": {
"読み方": "いけだこうとうがっこうつじこう",
"所在位置": "徳島県"
},
"徳島科学技術高等学校": {
"読み方": "とくしまかがくぎじゅつこうとうがっこう",
"所在位置": "徳島県"
},
"徳島北高等学校": {
"読み方": "とくしまきたこうとうがっこう",
"所在位置": "徳島県"
},
"徳島商業高等学校": {
"読み方": "とくしましょうぎょうこうとうがっこう",
"所在位置": "徳島県"
},
"富岡西高等学校": {
"読み方": "とみおかにしこうとうがっこう",
"所在位置": "徳島県"
},
"富岡東高等学校": {
"読み方": "とみおかひがしこうとうがっこう",
"所在位置": "徳島県"
},
"鳴門高等学校": {
"読み方": "なるとこうとうがっこう",
"所在位置": "徳島県"
},
"名西高等学校": {
"読み方": "みょうざいこうとうがっこう",
"所在位置": "徳島県"
},
"徳島市立高等学校": {
"読み方": "とくしましりつこうとうがっこう",
"所在位置": "徳島県"
},
"徳島文理高等学校": {
"読み方": "とくしまぶんりこうとうがっこう",
"所在位置": "徳島県"
},
"徳風高等学校": {
"読み方": "とくふうこうとうがっこう",
"所在位置": "三重県"
},
"常葉大学附属常葉高等学校": {
"読み方": "とこはだいがくふぞくとこはこうとうがっこう",
"所在位置": "静岡県"
},
"常葉大学附属菊川高等学校": {
"読み方": "とこはだいがくふぞくきくかわこうとうがっこう",
"所在位置": "静岡県"
},
"常葉大学附属橘高等学校": {
"読み方": "とこはだいがくふぞくたちばなこうとうがっこう",
"所在位置": "静岡県"
},
"土佐高等学校": {
"読み方": "とさこうとうがっこう",
"所在位置": "高知県"
},
"土佐塾高等学校": {
"読み方": "とさじゅくこうとうがっこう",
"所在位置": "高知県"
},
"土佐女子高等学校": {
"読み方": "とさじょしこうとうがっこう",
"所在位置": "高知県"
},
"足利高等学校": {
"読み方": "あしかがこうとうがっこう",
"所在位置": "栃木県"
},
"足利工業高等学校": {
"読み方": "あしかがこうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"足利清風高等学校": {
"読み方": "あしかがせいふうこうとうがっこう",
"所在位置": "栃木県"
},
"足利南高等学校": {
"読み方": "あしかがみなみこうとうがっこう",
"所在位置": "栃木県"
},
"石橋高等学校": {
"読み方": "いしばしこうとうがっこう",
"所在位置": "栃木県"
},
"今市高等学校": {
"読み方": "いまいちこうとうがっこう",
"所在位置": "栃木県"
},
"今市工業高等学校": {
"読み方": "いまいちこうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮高等学校": {
"読み方": "うつのみやこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮北高等学校": {
"読み方": "うつのみやきたこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮工業高等学校": {
"読み方": "うつのみやこうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮商業高等学校": {
"読み方": "うつのみやしょうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮女子高等学校": {
"読み方": "うつのみやじょしこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮清陵高等学校": {
"読み方": "うつのみやせいりょうこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮中央高等学校": {
"読み方": "うつのみやちゅうおうこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮白楊高等学校": {
"読み方": "うつのみやはくようこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮東高等学校": {
"読み方": "うつのみやひがしこうとうがっこう",
"所在位置": "栃木県"
},
"宇都宮南高等学校": {
"読み方": "うつのみやみなみこうとうがっこう",
"所在位置": "栃木県"
},
"大田原高等学校": {
"読み方": "おおたわらこうとうがっこう",
"所在位置": "栃木県"
},
"大田原女子高等学校": {
"読み方": "おおたわらじょしこうとうがっこう",
"所在位置": "栃木県"
},
"学悠館高等学校": {
"読み方": "がくゆうかんこうとうがっこう",
"所在位置": "栃木県"
},
"鹿沼高等学校": {
"読み方": "かぬまこうとうがっこう",
"所在位置": "栃木県"
},
"鹿沼商工高等学校": {
"読み方": "かぬましょうこうこうとうがっこう",
"所在位置": "栃木県"
},
"鹿沼東高等学校": {
"読み方": "かぬまひがしこうとうがっこう",
"所在位置": "栃木県"
},
"鹿沼南高等学校": {
"読み方": "かぬまみなみこうとうがっこう",
"所在位置": "栃木県"
},
"上三川高等学校": {
"読み方": "かみのかわこうとうがっこう",
"所在位置": "栃木県"
},
"烏山高等学校": {
"読み方": "からすやまこうとうがっこう",
"所在位置": "栃木県"
},
"黒磯高等学校": {
"読み方": "くろいそこうとうがっこう",
"所在位置": "栃木県"
},
"黒磯南高等学校": {
"読み方": "くろいそみなみこうとうがっこう",
"所在位置": "栃木県"
},
"黒羽高等学校": {
"読み方": "くろばねこうとうがっこう",
"所在位置": "栃木県"
},
"小山北桜高等学校": {
"読み方": "おやまほくおうこうとうがっこう",
"所在位置": "栃木県"
},
"小山城南高等学校": {
"読み方": "おやまじょうなんこうとうがっこう",
"所在位置": "栃木県"
},
"小山西高等学校": {
"読み方": "おやまにしこうとうがっこう",
"所在位置": "栃木県"
},
"小山南高等学校": {
"読み方": "おやまみなみこうとうがっこう",
"所在位置": "栃木県"
},
"さくら清修高等学校": {
"読み方": "さくらせいしゅうこうとうがっこう",
"所在位置": "栃木県"
},
"佐野高等学校": {
"読み方": "さのこうとうがっこう",
"所在位置": "栃木県"
},
"佐野松桜高等学校": {
"読み方": "さのしょうおうこうとうがっこう",
"所在位置": "栃木県"
},
"佐野東高等学校": {
"読み方": "さのひがしこうとうがっこう",
"所在位置": "栃木県"
},
"高根沢高等学校": {
"読み方": "たかねざわこうとうがっこう",
"所在位置": "栃木県"
},
"栃木高等学校": {
"読み方": "とちぎこうとうがっこう",
"所在位置": "栃木県"
},
"栃木工業高等学校": {
"読み方": "とちぎこうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"栃木商業高等学校": {
"読み方": "とちぎしょうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"栃木翔南高等学校": {
"読み方": "とちぎしょうなんこうとうがっこう",
"所在位置": "栃木県"
},
"栃木女子高等学校": {
"読み方": "とちぎじょしこうとうがっこう",
"所在位置": "栃木県"
},
"栃木農業高等学校": {
"読み方": "とちぎのうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"那須清峰高等学校": {
"読み方": "なすせいほうこうとうがっこう",
"所在位置": "栃木県"
},
"那須拓陽高等学校": {
"読み方": "なすたくようこうとうがっこう",
"所在位置": "栃木県"
},
"日光明峰高等学校": {
"読み方": "にっこうめいほうこうとうがっこう",
"所在位置": "栃木県"
},
"益子芳星高等学校": {
"読み方": "ましこほうせいこうとうがっこう",
"所在位置": "栃木県"
},
"壬生高等学校": {
"読み方": "みぶこうとうがっこう",
"所在位置": "栃木県"
},
"真岡高等学校": {
"読み方": "もおかこうとうがっこう",
"所在位置": "栃木県"
},
"真岡工業高等学校": {
"読み方": "もおかこうぎょうこうとうがっこう",
"所在位置": "栃木県"
},
"真岡女子高等学校": {
"読み方": "もおかじょしこうとうがっこう",
"所在位置": "栃木県"
},
"真岡北陵高等学校": {
"読み方": "もおかほくりょうこうとうがっこう",
"所在位置": "栃木県"
},
"茂木高等学校": {
"読み方": "もてぎこうとうがっこう",
"所在位置": "栃木県"
},
"矢板高等学校": {
"読み方": "やいたこうとうがっこう",
"所在位置": "栃木県"
},
"矢板東高等学校": {
"読み方": "やいたひがしこうとうがっこう",
"所在位置": "栃木県"
},
"獨協埼玉高等学校": {
"読み方": "どっきょうさいたまちゅうがくこうとうがっこう",
"所在位置": "埼玉県"
},
"鳥取家政学園鳥取敬愛高等学校": {
"読み方": "とっとりかせいがくえんとっとりけいあいこうとうがっこう",
"所在位置": "鳥取県"
},
"青谷高等学校": {
"読み方": "あおやこうとうがっこう",
"所在位置": "鳥取県"
},
"岩美高等学校": {
"読み方": "いわみこうとうがっこう",
"所在位置": "鳥取県"
},
"倉吉総合産業高等学校": {
"読み方": "くらよしそうごうさんぎょうこうとうがっこう",
"所在位置": "鳥取県"
},
"倉吉西高等学校": {
"読み方": "くらよしにしこうとうがっこう",
"所在位置": "鳥取県"
},
"倉吉農業高等学校": {
"読み方": "くらよしのうぎょうこうとうがっこう",
"所在位置": "鳥取県"
},
"倉吉東高等学校": {
"読み方": "くらよしひがしこうとうがっこう",
"所在位置": "鳥取県"
},
"境港総合技術高等学校": {
"読み方": "さかいみなとそうごうぎじゅつこうとうがっこう",
"所在位置": "鳥取県"
},
"鳥取工業高等学校": {
"読み方": "とっとりこうぎょうこうとうがっこう",
"所在位置": "鳥取県"
},
"鳥取湖陵高等学校": {
"読み方": "とっとりこりょうこうとうがっこう",
"所在位置": "鳥取県"
},
"鳥取商業高等学校": {
"読み方": "とっとりしょうぎょうこうとうがっこう",
"所在位置": "鳥取県"
},
"鳥取中央育英高等学校": {
"読み方": "とっとりちゅうおういくえいこうとうがっこう",
"所在位置": "鳥取県"
},
"鳥取西高等学校": {
"読み方": "とっとりにしこうとうがっこう",
"所在位置": "鳥取県"
},
"鳥取東高等学校": {
"読み方": "とっとりひがしこうとうがっこう",
"所在位置": "鳥取県"
},
"八頭高等学校": {
"読み方": "やずこうとうがっこう",
"所在位置": "鳥取県"
},
"米子高等学校": {
"読み方": "よなごこうとうがっこう",
"所在位置": "鳥取県"
},
"米子工業高等学校": {
"読み方": "よなごこうぎょうこうとうがっこう",
"所在位置": "鳥取県"
},
"米子西高等学校": {
"読み方": "よなごにしこうとうがっこう",
"所在位置": "鳥取県"
},
"米子東高等学校": {
"読み方": "よなごひがしこうとうがっこう",
"所在位置": "鳥取県"
},
"米子南高等学校": {
"読み方": "よなごみなみこうとうがっこう",
"所在位置": "鳥取県"
},
"利根沼田学校組合立利根商業高等学校": {
"読み方": "とねしょうぎょうこうとうがっこう",
"所在位置": "群馬県"
},
"富田高等学校": {
"読み方": "とみたこうとうがっこう",
"所在位置": "岐阜県"
},
"石動高等学校": {
"読み方": "いするぎこうとうがっこう",
"所在位置": "富山県"
},
"魚津高等学校": {
"読み方": "うおづこうとうがっこう",
"所在位置": "富山県"
},
"魚津工業高等学校": {
"読み方": "うおづこうぎょうこうとうがっこう",
"所在位置": "富山県"
},
"雄山高等学校": {
"読み方": "おやまこうとうがっこう",
"所在位置": "富山県"
},
"上市高等学校": {
"読み方": "かみいちこうとうがっこう",
"所在位置": "富山県"
},
"呉羽高等学校": {
"読み方": "くれはこうとうがっこう",
"所在位置": "富山県"
},
"小杉高等学校": {
"読み方": "こすぎこうとうがっこう",
"所在位置": "富山県"
},
"桜井高等学校": {
"読み方": "さくらいこうとうがっこう",
"所在位置": "奈良県"
},
"志貴野高等学校": {
"読み方": "しきのこうとうがっこう",
"所在位置": "富山県"
},
"新湊高等学校": {
"読み方": "しんみなとこうとうがっこう",
"所在位置": "富山県"
},
"大門高等学校": {
"読み方": "だいもんこうとうがっこう",
"所在位置": "広島県"
},
"高岡高等学校": {
"読み方": "たかおかこうとうがっこう",
"所在位置": "富山県"
},
"高岡工芸高等学校": {
"読み方": "たかおかこうげいこうとうがっこう",
"所在位置": "富山県"
},
"高岡商業高等学校": {
"読み方": "たかおかしょうぎょうこうとうがっこう",
"所在位置": "富山県"
},
"高岡南高等学校": {
"読み方": "たかおかみなみこうとうがっこう",
"所在位置": "富山県"
},
"砺波高等学校": {
"読み方": "となみこうとうがっこう",
"所在位置": "富山県"
},
"富山高等学校": {
"読み方": "とやまこうとうがっこう",
"所在位置": "富山県"
},
"富山いずみ高等学校": {
"読み方": "とやまいずみこうとうがっこう",
"所在位置": "富山県"
},
"富山工業高等学校": {
"読み方": "とやまこうぎょうこうとうがっこう",
"所在位置": "富山県"
},
"富山商業高等学校": {
"読み方": "とやましょうぎょうこうとうがっこう",
"所在位置": "富山県"
},
"富山中部高等学校": {
"読み方": "とやまちゅうぶこうとうがっこう",
"所在位置": "富山県"
},
"富山西高等学校": {
"読み方": "とやまにしこうとうがっこう",
"所在位置": "富山県"
},
"富山東高等学校": {
"読み方": "とやまひがしこうとうがっこう",
"所在位置": "富山県"
},
"富山北部高等学校": {
"読み方": "とやまほくぶこうとうがっこう",
"所在位置": "富山県"
},
"富山南高等学校": {
"読み方": "とやまみなみこうとうがっこう",
"所在位置": "富山県"
},
"滑川高等学校": {
"読み方": "なめりかわこうとうがっこう",
"所在位置": "富山県"
},
"南砺福野高等学校": {
"読み方": "なんとふくのこうとうがっこう",
"所在位置": "富山県"
},
"入善高等学校": {
"読み方": "にゅうぜんこうとうがっこう",
"所在位置": "富山県"
},
"氷見高等学校": {
"読み方": "ひみこうとうがっこう",
"所在位置": "富山県"
},
"伏木高等学校": {
"読み方": "ふしきこうとうがっこう",
"所在位置": "富山県"
},
"八尾高等学校": {
"読み方": "やつおこうとうがっこう",
"所在位置": "富山県"
},
"雄峰高等学校（通信制）": {
"読み方": "ゆうほうこうごうかっこう（つうしんせい）",
"所在位置": "富山県"
},
"富山国際大学付属高等学校": {
"読み方": "とやまこくさいだいがくふぞくこうとうがっこう",
"所在位置": "富山県"
},
"富山第一高等学校": {
"読み方": "とやまだいいちこうとうがっこう",
"所在位置": "富山県"
},
"豊川高等学校": {
"読み方": "とよかわこうとうがっこう",
"所在位置": "愛知県"
},
"豊田大谷高等学校": {
"読み方": "とよたおおたにこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋市立豊橋高等学校": {
"読み方": "とよはししりつとよはしこうとうがっこう",
"所在位置": "愛知県"
},
"豊橋中央高等学校": {
"読み方": "とよはしちゅうおうこうとうがっこう",
"所在位置": "愛知県"
},
"福岡女子商業高等学校": {
"読み方": "ふくおかじょししょうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"中越高等学校": {
"読み方": "ちゅうえつこうとうがっこう",
"所在位置": "新潟県"
},
"長崎玉成高等学校": {
"読み方": "ながさきぎょくせいこうとうがっこう",
"所在位置": "長崎県"
},
"壱岐高等学校": {
"読み方": "いきこうとうがっこう",
"所在位置": "長崎県"
},
"諫早高等学校": {
"読み方": "いさはやこうとうがっこう",
"所在位置": "長崎県"
},
"諫早商業高等学校": {
"読み方": "いさはやしょうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"諫早農業高等学校": {
"読み方": "いさはやのうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"諫早東高等学校": {
"読み方": "いさはやひがしこうとうがっこう",
"所在位置": "長崎県"
},
"大村高等学校": {
"読み方": "おおむらこうとうがっこう",
"所在位置": "長崎県"
},
"大村工業高等学校": {
"読み方": "おおむらこうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"大村城南高等学校": {
"読み方": "おおむらじょうなんこうとうがっこう",
"所在位置": "長崎県"
},
"上五島高等学校": {
"読み方": "かみごとうこうとうがっこう",
"所在位置": "長崎県"
},
"川棚高等学校": {
"読み方": "かわたなこうとうがっこう",
"所在位置": "長崎県"
},
"口加高等学校": {
"読み方": "こうかこうとうがっこう",
"所在位置": "長崎県"
},
"五島高等学校": {
"読み方": "ごとうこうとうがっこう",
"所在位置": "長崎県"
},
"五島海陽高等学校": {
"読み方": "ごとうかいようこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保北高等学校": {
"読み方": "させぼきたこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保工業高等学校": {
"読み方": "させぼこうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保商業高等学校": {
"読み方": "させぼしょうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保中央高等学校": {
"読み方": "させぼちゅうおうこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保東翔高等学校": {
"読み方": "させぼとうしょうこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保西高等学校": {
"読み方": "させぼにしこうとうがっこう",
"所在位置": "長崎県"
},
"佐世保南高等学校": {
"読み方": "させぼみなみこうとうがっこう",
"所在位置": "長崎県"
},
"鹿町工業高等学校": {
"読み方": "しかまちこうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"島原高等学校": {
"読み方": "しまばらこうとうがっこう",
"所在位置": "長崎県"
},
"島原工業高等学校": {
"読み方": "しまばらこうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"島原商業高等学校": {
"読み方": "しまばらしょうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"清峰高等学校": {
"読み方": "せいほうこうとうがっこう",
"所在位置": "長崎県"
},
"西陵高等学校": {
"読み方": "せいりょうこうとうがっこう",
"所在位置": "長崎県"
},
"対馬高等学校": {
"読み方": "つしまこうとうがっこう",
"所在位置": "長崎県"
},
"長崎鶴洋高等学校": {
"読み方": "ながさきかくようこうとうがっこう",
"所在位置": "長崎県"
},
"長崎北高等学校": {
"読み方": "ながさききたこうとうがっこう",
"所在位置": "長崎県"
},
"長崎工業高等学校": {
"読み方": "ながさきこうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"長崎西高等学校": {
"読み方": "ながさきにしこうとうがっこう",
"所在位置": "長崎県"
},
"長崎東高等学校": {
"読み方": "ながさきひがしこうとうがっこう",
"所在位置": "長崎県"
},
"長崎北陽台高等学校": {
"読み方": "ながさきほくようだいこうとうがっこう",
"所在位置": "長崎県"
},
"長崎南高等学校": {
"読み方": "ながさきみなみこうとうがっこう",
"所在位置": "長崎県"
},
"長崎明誠高等学校": {
"読み方": "ながさきめいせいこうとうがっこう",
"所在位置": "長崎県"
},
"鳴滝高等学校": {
"読み方": "なるたきこうとうがっこう",
"所在位置": "長崎県"
},
"波佐見高等学校": {
"読み方": "はさみこうとうがっこう",
"所在位置": "長崎県"
},
"平戸高等学校": {
"読み方": "ひらどこうとうがっこう",
"所在位置": "長崎県"
},
"猶興館高等学校": {
"読み方": "ゆうこうかんこうとうがっこう",
"所在位置": "長崎県"
},
"長崎女子高等学校": {
"読み方": "ながさきじょしこうとうがっこう",
"所在位置": "長崎県"
},
"長崎女子商業高等学校": {
"読み方": "ながさきじょししょうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"長崎市立長崎商業高等学校": {
"読み方": "ながさきしりつながさきしょうぎょうこうとうがっこう",
"所在位置": "長崎県"
},
"長崎日本大学高等学校": {
"読み方": "ながさきにほんだいがくこうとうがっこう",
"所在位置": "長崎県"
},
"長崎南山高等学校": {
"読み方": "ながさきなんざんこうとうがっこう",
"所在位置": "長崎県"
},
"永島学園 出雲西高等学校": {
"読み方": "ながしまがくえんいずもにしこうとうがっこう",
"所在位置": "島根県"
},
"明科高等学校": {
"読み方": "あかしなこうとうがっこう",
"所在位置": "長野県"
},
"赤穂高等学校": {
"読み方": "あこうこうとうがっこう",
"所在位置": "兵庫県"
},
"梓川高等学校": {
"読み方": "あずさがわこうとうがっこう",
"所在位置": "長野県"
},
"阿南高等学校": {
"読み方": "あなんこうとうがっこう",
"所在位置": "長野県"
},
"飯田OIDE長姫高等学校": {
"読み方": "いいだおーあいでぃーいーおさひめこうとうがっこう",
"所在位置": "長野県"
},
"飯田風越高等学校": {
"読み方": "いいだふうえつこうとうがっこう",
"所在位置": "長野県"
},
"池田工業高等学校": {
"読み方": "いけだこうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"伊那北高等学校": {
"読み方": "いなきたこうとうがっこう",
"所在位置": "長野県"
},
"伊那弥生ヶ丘高等学校": {
"読み方": "いなやよいがおかこうとうがっこう",
"所在位置": "長野県"
},
"岩村田高等学校": {
"読み方": "いわむらだこうとうがっこう",
"所在位置": "長野県"
},
"上田高等学校": {
"読み方": "うえだこうとうがっこう",
"所在位置": "長野県"
},
"上田千曲高等学校": {
"読み方": "うえだちくまこうとうがっこう",
"所在位置": "長野県"
},
"上田染谷丘高等学校": {
"読み方": "うえだそめやおかこうとうがっこう",
"所在位置": "長野県"
},
"上田東高等学校": {
"読み方": "うえだひがしこうとうがっこう",
"所在位置": "長野県"
},
"小海高等学校": {
"読み方": "おうみこうとうがっこう",
"所在位置": "長野県"
},
"大町岳陽高等学校": {
"読み方": "おおまちがくようこうとうがっこう",
"所在位置": "長野県"
},
"岡谷工業高等学校": {
"読み方": "おかやこうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"岡谷東高等学校": {
"読み方": "おかやひがしこうとうがっこう",
"所在位置": "長野県"
},
"岡谷南高等学校": {
"読み方": "おかやみなみこうとうがっこう",
"所在位置": "長野県"
},
"下伊那農業高等学校": {
"読み方": "しもいなのうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"下諏訪向陽高等学校": {
"読み方": "しもすわこうようこうとうがっこう",
"所在位置": "長野県"
},
"上伊那農業高等学校": {
"読み方": "かみいなのうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"木曽青峰高等学校": {
"読み方": "きそせいほうこうとうがっこう",
"所在位置": "長野県"
},
"佐久平総合技術高等学校（浅間キャンパス）": {
"読み方": "さくだいらそうごうぎじゅつこうとうがっこうあさまきゃんぱす",
"所在位置": "長野県"
},
"駒ヶ根工業高等学校": {
"読み方": "こまがねこうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"小諸高等学校": {
"読み方": "こもろこうとうがっこう",
"所在位置": "長野県"
},
"小諸商業高等学校": {
"読み方": "こもろしょうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"坂城高等学校": {
"読み方": "さかきこうとうがっこう",
"所在位置": "長野県"
},
"更級農業高等学校": {
"読み方": "さらしなのうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"塩尻志学館高等学校": {
"読み方": "しおじりしがくかんこうとうがっこう",
"所在位置": "長野県"
},
"篠ノ井高等学校": {
"読み方": "しののいこうとうがっこう",
"所在位置": "長野県"
},
"須坂高等学校": {
"読み方": "すざかこうとうがっこう",
"所在位置": "長野県"
},
"須坂創成高等学校 須園キャンパス": {
"読み方": "すざかそうせいこうとうがっこう すえんきゃんぱす",
"所在位置": "長野県"
},
"須坂創成高等学校 須商キャンパス": {
"読み方": "すざかそうせいこうとうがっこう すしょうきゃんぱす",
"所在位置": "長野県"
},
"須坂東高等学校": {
"読み方": "すざかひがしこうとうがっこう",
"所在位置": "長野県"
},
"諏訪実業高等学校": {
"読み方": "すわじつぎょうこうとうがっこう",
"所在位置": "長野県"
},
"諏訪清陵高等学校": {
"読み方": "すわせいりょうこうとうがっこう",
"所在位置": "長野県"
},
"諏訪二葉高等学校": {
"読み方": "すわふたばこうとうがっこう",
"所在位置": "長野県"
},
"蘇南高等学校": {
"読み方": "そなんこうとうがっこう",
"所在位置": "長野県"
},
"田川高等学校": {
"読み方": "たがわこうとうがっこう",
"所在位置": "福岡県"
},
"辰野高等学校": {
"読み方": "たつのこうとうがっこう",
"所在位置": "長野県"
},
"蓼科高等学校": {
"読み方": "たてしなこうとうがっこう",
"所在位置": "長野県"
},
"東御清翔高等学校": {
"読み方": "とうみせいしょうこうとうがっこう",
"所在位置": "長野県"
},
"豊科高等学校": {
"読み方": "とよしなこうとうがっこう",
"所在位置": "長野県"
},
"長野高等学校": {
"読み方": "ながのこうとうがっこう",
"所在位置": "長野県"
},
"長野工業高等学校": {
"読み方": "ながのこうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"長野商業高等学校": {
"読み方": "ながのしょうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"中野西高等学校": {
"読み方": "なかのにしこうとうがっこう",
"所在位置": "長野県"
},
"長野西高等学校（通信制）": {
"読み方": "ながのにしこうとうがっこうつうしんせい",
"所在位置": "長野県"
},
"長野東高等学校": {
"読み方": "ながのひがしこうとうがっこう",
"所在位置": "長野県"
},
"長野南高等学校": {
"読み方": "ながのみなみこうとうがっこう",
"所在位置": "長野県"
},
"長野吉田高等学校": {
"読み方": "ながのよしだこうとうがっこう",
"所在位置": "長野県"
},
"中野立志館高等学校": {
"読み方": "なかのりっしかんこうとうがっこう",
"所在位置": "長野県"
},
"野沢北高等学校": {
"読み方": "のざわきたこうとうがっこう",
"所在位置": "長野県"
},
"野沢南高等学校": {
"読み方": "のざわみなみこうとうがっこう",
"所在位置": "長野県"
},
"白馬高等学校": {
"読み方": "はくばこうとうがっこう",
"所在位置": "長野県"
},
"穂高商業高等学校": {
"読み方": "ほたかしょうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"松川高等学校": {
"読み方": "まつかわこうとうがっこう",
"所在位置": "長野県"
},
"松代高等学校": {
"読み方": "まつしろこうとうがっこう",
"所在位置": "長野県"
},
"松本県ヶ丘高等学校": {
"読み方": "まつもとあがたがおかこうとうがっこう",
"所在位置": "長野県"
},
"松本蟻ヶ崎高等学校": {
"読み方": "まつもとありがさきこうとうがっこう",
"所在位置": "長野県"
},
"松本工業高等学校": {
"読み方": "まつもとこうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"松本筑摩高等学校（通信制）": {
"読み方": "まつもとちくまこうとうがっこうつうしんせい",
"所在位置": "長野県"
},
"松本深志高等学校": {
"読み方": "まつもとふかしこうとうがっこう",
"所在位置": "長野県"
},
"松本美須々ヶ丘高等学校": {
"読み方": "まつもとみすずがおかこうとうがっこう",
"所在位置": "長野県"
},
"丸子修学館高等学校": {
"読み方": "まるこしゅうがくかんこうとうがっこう",
"所在位置": "長野県"
},
"南安曇農業高等学校": {
"読み方": "みなみあづみのうぎょうこうとうがっこう",
"所在位置": "長野県"
},
"屋代高等学校": {
"読み方": "やしろこうとうがっこう",
"所在位置": "長野県"
},
"屋代南高等学校": {
"読み方": "やしろみなみこうとうがっこう",
"所在位置": "長野県"
},
"長野俊英高等学校": {
"読み方": "ながのしゅんえいこうとうがっこう",
"所在位置": "長野県"
},
"長野女子高等学校": {
"読み方": "ながのじょしこうとうがっこう",
"所在位置": "長野県"
},
"長野市立長野高等学校": {
"読み方": "ながのしりつながのこうとうがっこう",
"所在位置": "長野県"
},
"長野清泉女学院高等学校": {
"読み方": "ながのせいせんじょがくいんこうとうがっこう",
"所在位置": "長野県"
},
"長野日本大学高等学校": {
"読み方": "ながのにほんだいがくこうとうがっこう",
"所在位置": "長野県"
},
"中村学園三陽高等学校": {
"読み方": "なかむらがくえんさんようこうとうがっこう",
"所在位置": "福岡県"
},
"中村学園女子高等学校": {
"読み方": "なかむらがくえんじょしこうとうがっこう",
"所在位置": "福岡県"
},
"中村女子高等学校": {
"読み方": "なかむらじょしこうとうがっこう",
"所在位置": "山口県"
},
"中山学園高等学校": {
"読み方": "なかやまがくえんこうとうがっこう",
"所在位置": "千葉県"
},
"名古屋高等学校": {
"読み方": "なごやこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋大谷高等学校": {
"読み方": "なごやおおたにこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋経済大学市邨高等学校": {
"読み方": "なごやけいざいだいがくいちむらこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋経済大学高蔵高等学校": {
"読み方": "なごやけいざいだいがくたかくらこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋工業高等学校": {
"読み方": "なごやこうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋国際高等学校": {
"読み方": "なごやこくさいこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋女子大学高等学校": {
"読み方": "なごやじょしだいがくこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立菊里高等学校": {
"読み方": "なごやしりつきくざとこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立北高等学校": {
"読み方": "なごやしりつきたこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立工業高等学校": {
"読み方": "なごやしりつこうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立工芸高等学校": {
"読み方": "なごやしりつこうげいこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立向陽高等学校": {
"読み方": "なごやしりつこうようこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立桜台高等学校": {
"読み方": "なごやしりつさくらだいこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立西陵高等学校": {
"読み方": "なごやしりつせいりょうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立中央高等学校": {
"読み方": "なごやしりつちゅうおうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立富田高等学校": {
"読み方": "なごやしりつとみだこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立名古屋商業高等学校": {
"読み方": "なごやしりつなごやしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立緑高等学校": {
"読み方": "なごやしりつみどりこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立名東高等学校": {
"読み方": "なごやしりつめいとうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立山田高等学校": {
"読み方": "なごやしりつやまだこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋市立若宮商業高等学校": {
"読み方": "なごやしりつわかみやしょうぎょうこうとうがっこう",
"所在位置": "愛知県"
},
"名古屋大学教育学部附属高等学校": {
"読み方": "なごやだいがくきょういくがくぶふぞくこうとうがっこう",
"所在位置": "愛知県"
},
"灘高等学校": {
"読み方": "なだこうとうがっこう",
"所在位置": "兵庫県"
},
"奈良育英高等学校": {
"読み方": "ならいくえいこうとうがっこう",
"所在位置": "奈良県"
},
"奈良学園高等学校": {
"読み方": "ならがくえんこうとうがっこう",
"所在位置": "奈良県"
},
"生駒高等学校": {
"読み方": "いこまこうとうがっこう",
"所在位置": "奈良県"
},
"畝傍高等学校": {
"読み方": "うねびこうとうがっこう",
"所在位置": "奈良県"
},
"王寺工業高等学校": {
"読み方": "おうじこうぎょうこうとうがっこう",
"所在位置": "奈良県"
},
"大淀高等学校": {
"読み方": "おおよどこうとうがっこう",
"所在位置": "奈良県"
},
"香芝高等学校": {
"読み方": "かしばこうとうがっこう",
"所在位置": "奈良県"
},
"橿原高等学校": {
"読み方": "かしはらこうとうがっこう",
"所在位置": "奈良県"
},
"高円芸術高等学校": {
"読み方": "たかまどげいじゅつこうとうがっこう",
"所在位置": "奈良県"
},
"郡山高等学校": {
"読み方": "こおりやまこうとうがっこう",
"所在位置": "福島県"
},
"五條高等学校": {
"読み方": "ごじょうこうとうがっこう",
"所在位置": "奈良県"
},
"御所実業高等学校": {
"読み方": "ごせじつぎょうこうとうがっこう",
"所在位置": "奈良県"
},
"磯城野高等学校": {
"読み方": "しきのこうとうがっこう",
"所在位置": "奈良県"
},
"榛生昇陽高等学校": {
"読み方": "しんせいしょうようこうとうがっこう",
"所在位置": "奈良県"
},
"青翔高等学校": {
"読み方": "せいしょうこうとうがっこう",
"所在位置": "奈良県"
},
"西和清陵高等学校": {
"読み方": "せいわせいりょうこうとうがっこう",
"所在位置": "奈良県"
},
"添上高等学校": {
"読み方": "そえかみこうとうがっこう",
"所在位置": "奈良県"
},
"高取国際高等学校": {
"読み方": "たかとりこくさいこうとうがっこう",
"所在位置": "奈良県"
},
"登美ケ丘高等学校": {
"読み方": "とみがおかこうとうがっこう",
"所在位置": "奈良県"
},
"奈良高等学校": {
"読み方": "ならこうとうがっこう",
"所在位置": "奈良県"
},
"奈良北高等学校": {
"読み方": "ならきたこうとうがっこう",
"所在位置": "奈良県"
},
"奈良県立商業高等学校": {
"読み方": "ならじょうほうしょうぎょうこうとうがっこう",
"所在位置": "奈良県"
},
"奈良商工高等学校": {
"読み方": "ならすざくこうとうがっこう",
"所在位置": "奈良県"
},
"二階堂高等学校": {
"読み方": "にかいどうこうとうがっこう",
"所在位置": "奈良県"
},
"西の京高等学校": {
"読み方": "にしのきょうこうとうがっこう",
"所在位置": "奈良県"
},
"平城高等学校": {
"読み方": "へいじょうこうとうがっこう",
"所在位置": "奈良県"
},
"法隆寺国際高等学校": {
"読み方": "ほうりゅうじこくさいこうとうがっこう",
"所在位置": "奈良県"
},
"大和広陵高等学校": {
"読み方": "やまとこうりょうこうとうがっこう",
"所在位置": "奈良県"
},
"大和中央高等学校": {
"読み方": "やまとちゅうおうこうとうがっこう",
"所在位置": "奈良県"
},
"習志野市立習志野高等学校": {
"読み方": "ならしのしりつならしのこうとうがっこう",
"所在位置": "千葉県"
},
"奈良女子高等学校": {
"読み方": "ならじょしこうとうがっこう",
"所在位置": "奈良県"
},
"奈良市立一条高等学校": {
"読み方": "ならしりついちじょうこうとうがっこう",
"所在位置": "奈良県"
},
"奈良大学附属高等学校": {
"読み方": "ならだいがくふぞくこうとうがっこう",
"所在位置": "奈良県"
},
"奈良文化高等学校": {
"読み方": "ならぶんかこうとうがっこう",
"所在位置": "奈良県"
},
"成田高等学校": {
"読み方": "なりたこうとうがっこう",
"所在位置": "千葉県"
},
"阿賀黎明高等学校": {
"読み方": "あがれいめいこうとうがっこう",
"所在位置": "新潟県"
},
"新井高等学校": {
"読み方": "あらいこうとうがっこう",
"所在位置": "新潟県"
},
"糸魚川高等学校": {
"読み方": "いといがわこうとうがっこう",
"所在位置": "新潟県"
},
"糸魚川白嶺高等学校": {
"読み方": "いといがわはくれいこうとうがっこう",
"所在位置": "新潟県"
},
"小千谷高等学校": {
"読み方": "おぢやこうとうがっこう",
"所在位置": "新潟県"
},
"小千谷西高等学校": {
"読み方": "おぢやにしこうとうがっこう",
"所在位置": "新潟県"
},
"海洋高等学校": {
"読み方": "かいようこうとうがっこう",
"所在位置": "新潟県"
},
"柏崎高等学校": {
"読み方": "かしわざきこうとうがっこう",
"所在位置": "新潟県"
},
"柏崎工業高等学校": {
"読み方": "かしわざきこうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"柏崎総合高等学校": {
"読み方": "かしわざきそうごうこうとうがっこう",
"所在位置": "新潟県"
},
"柏崎常盤高等学校": {
"読み方": "かしわざきときわこうとうがっこう",
"所在位置": "新潟県"
},
"小出高等学校": {
"読み方": "こいでこうとうがっこう",
"所在位置": "新潟県"
},
"五泉高等学校": {
"読み方": "ごせんこうとうがっこう",
"所在位置": "新潟県"
},
"佐渡高等学校": {
"読み方": "さどこうとうがっこう",
"所在位置": "新潟県"
},
"佐渡総合高等学校": {
"読み方": "さどそうごうこうとうがっこう",
"所在位置": "新潟県"
},
"三条高等学校": {
"読み方": "さんじょうこうとうがっこう",
"所在位置": "新潟県"
},
"三条商業高等学校": {
"読み方": "さんじょうしょうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"三条東高等学校": {
"読み方": "さんじょうひがしこうとうがっこう",
"所在位置": "新潟県"
},
"塩沢商工高等学校": {
"読み方": "しおざわしょうこうこうとうがっこう",
"所在位置": "新潟県"
},
"新発田高等学校": {
"読み方": "しばたこうとうがっこう",
"所在位置": "新潟県"
},
"新発田商業高等学校": {
"読み方": "しばたしょうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"新発田農業高等学校": {
"読み方": "しばたのうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"新発田南高等学校": {
"読み方": "しばたみなみこうとうがっこう",
"所在位置": "新潟県"
},
"上越総合技術高等学校": {
"読み方": "じょうえつそうごうぎじゅつこうとうがっこう",
"所在位置": "新潟県"
},
"正徳館高等学校": {
"読み方": "しょうとくかんこうとうがっこう",
"所在位置": "新潟県"
},
"高田商業高等学校": {
"読み方": "たかだしょうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"高田農業高等学校": {
"読み方": "たかだのうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"高田北城高等学校": {
"読み方": "たかだきたしろこうとうがっこう",
"所在位置": "新潟県"
},
"中条高等学校": {
"読み方": "なかじょうこうとうがっこう",
"所在位置": "新潟県"
},
"燕中等教育学校 後期課程": {
"読み方": "つばめちゅうとうきょういくがっこう こうきかてい",
"所在位置": "新潟県"
},
"十日町高等学校": {
"読み方": "とおかまちこうとうがっこう",
"所在位置": "新潟県"
},
"十日町総合高等学校": {
"読み方": "とおかまちそうごうこうとうがっこう",
"所在位置": "新潟県"
},
"栃尾高等学校": {
"読み方": "とちおこうとうがっこう",
"所在位置": "新潟県"
},
"長岡高等学校": {
"読み方": "ながおかこうとうがっこう",
"所在位置": "新潟県"
},
"長岡大手高等学校": {
"読み方": "ながおかおおてこうとうがっこう",
"所在位置": "新潟県"
},
"長岡工業高等学校": {
"読み方": "ながおかこうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"長岡向陵高等学校": {
"読み方": "ながおかこうりょうこうとうがっこう",
"所在位置": "新潟県"
},
"長岡商業高等学校": {
"読み方": "ながおかしょうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"長岡農業高等学校": {
"読み方": "ながおかのうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"長岡明徳高等学校": {
"読み方": "ながおかめいとくこうとうがっこう",
"所在位置": "新潟県"
},
"新潟高等学校": {
"読み方": "にいがたこうとうがっこう",
"所在位置": "新潟県"
},
"新潟北高等学校": {
"読み方": "にいがたきたこうとうがっこう",
"所在位置": "新潟県"
},
"新潟県央工業高等学校": {
"読み方": "にいがたけんおうこうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"新潟工業高等学校": {
"読み方": "にいがたこうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"新潟江南高等学校": {
"読み方": "にいがたこうなんこうとうがっこう",
"所在位置": "新潟県"
},
"新潟向陽高等学校": {
"読み方": "にいがたこうようこうとうがっこう",
"所在位置": "新潟県"
},
"新潟商業高等学校": {
"読み方": "にいがたしょうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"新潟中央高等学校": {
"読み方": "にいがたちゅうおうこうとうがっこう",
"所在位置": "新潟県"
},
"新潟西高等学校": {
"読み方": "にいがたにしこうとうがっこう",
"所在位置": "新潟県"
},
"新潟東高等学校": {
"読み方": "にいがたひがしこうとうがっこう",
"所在位置": "新潟県"
},
"新潟南高等学校": {
"読み方": "にいがたみなみこうとうがっこう",
"所在位置": "新潟県"
},
"新津高等学校": {
"読み方": "にいつこうとうがっこう",
"所在位置": "新潟県"
},
"新津工業高等学校": {
"読み方": "にいつこうぎょうこうとうがっこう",
"所在位置": "新潟県"
},
"新津南高等学校": {
"読み方": "にいつみなみこうとうがっこう",
"所在位置": "新潟県"
},
"分水高等学校": {
"読み方": "ぶんすいこうとうがっこう",
"所在位置": "新潟県"
},
"豊栄高等学校": {
"読み方": "とよさかこうとうがっこう",
"所在位置": "新潟県"
},
"巻高等学校": {
"読み方": "まきこうとうがっこう",
"所在位置": "新潟県"
},
"巻総合高等学校": {
"読み方": "まきそうごうこうとうがっこう",
"所在位置": "新潟県"
},
"見附高等学校": {
"読み方": "みつけこうとうがっこう",
"所在位置": "新潟県"
},
"六日町高等学校": {
"読み方": "むいかまちこうとうがっこう",
"所在位置": "新潟県"
},
"村上高等学校": {
"読み方": "むらかみこうとうがっこう",
"所在位置": "新潟県"
},
"村上桜ヶ丘高等学校": {
"読み方": "むらかみさくらがおかこうとうがっこう",
"所在位置": "新潟県"
},
"新潟産業大学附属高等学校": {
"読み方": "にいがたさんぎょうだいがくふぞくこうとうがっこう",
"所在位置": "新潟県"
},
"新潟市立高志中等教育学校 後期課程": {
"読み方": "にいがたしりつこうしちゅうとうきょういくがっこう 後期課程",
"所在位置": "新潟県"
},
"新潟市立万代高等学校": {
"読み方": "にいがたしりつばんだいこうとうがっこう",
"所在位置": "新潟県"
},
"新潟市立明鏡高等学校": {
"読み方": "にいがたしりつめいきょうこうとうがっこう",
"所在位置": "新潟県"
},
"新潟清心女子高等学校": {
"読み方": "にいがたせいしんじょしこうとうがっこう",
"所在位置": "新潟県"
},
"新潟青陵高等学校": {
"読み方": "にいがたせいりょうこうとうがっこう",
"所在位置": "新潟県"
},
"新潟第一高等学校": {
"読み方": "にいがただいいちこうとうがっこう",
"所在位置": "新潟県"
},
"新潟明訓高等学校": {
"読み方": "にいがためいくんこうとうがっこう",
"所在位置": "新潟県"
},
"新島学園高等学校": {
"読み方": "にいじまがくえんこうとうがっこう",
"所在位置": "群馬県"
},
"西日本短期大学附属高等学校": {
"読み方": "にしにっぽんたんきだいがくふぞくこうとうがっこう",
"所在位置": "福岡県"
},
"西宮市立西宮高等学校": {
"読み方": "にしのみやしりつにしのみやこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮市立西宮東高等学校": {
"読み方": "にしのみやしりつにしのみやひがしこうとうがっこう",
"所在位置": "兵庫県"
},
"西大和学園高等学校": {
"読み方": "にしやまとがくえんこうとうがっこう",
"所在位置": "奈良県"
},
"二松學舍大学附属柏高等学校": {
"読み方": "にしょうがくしゃだいがくふぞくかしわこうとうがっこう",
"所在位置": "千葉県"
},
"日南学園高等学校": {
"読み方": "にちなんがくえんこうとうがっこう",
"所在位置": "宮崎県"
},
"日章学園高等学校": {
"読み方": "にっしょうがくえんこうとうがっこう",
"所在位置": "宮崎県"
},
"日本航空高等学校": {
"読み方": "にほんこうくうこうとうがっこう",
"所在位置": "山梨県"
},
"日本航空高等学校石川": {
"読み方": "にほんこうくうこうとうがっこういしかわ",
"所在位置": "石川県"
},
"日本大学習志野高等学校": {
"読み方": "にほんだいがくならしのこうとうがっこう",
"所在位置": "千葉県"
},
"日本大学藤沢高等学校": {
"読み方": "にほんだいがくふじさわこうとうがっこう",
"所在位置": "神奈川県"
},
"日本大学三島高等学校": {
"読み方": "にほんだいがくみしまこうとうがっこう",
"所在位置": "静岡県"
},
"日本大学山形高等学校": {
"読み方": "にほんだいがくやまがたこうとうがっこう",
"所在位置": "山形県"
},
"日本文理高等学校": {
"読み方": "にほんぶんりこうとうがっこう",
"所在位置": "新潟県"
},
"日本女子大学附属高等学校": {
"読み方": "にほんじょしだいがくふぞくこうとうがっこう",
"所在位置": "神奈川県"
},
"日本大学高等学校": {
"読み方": "にほんだいがくこうとうがっこう",
"所在位置": "神奈川県"
},
"日本大学東北高等学校": {
"読み方": "にほんだいがくとうほくこうとうがっこう",
"所在位置": "福島県"
},
"日本大学明誠高等学校": {
"読み方": "にほんだいがくめいせいこうとうがっこう",
"所在位置": "山梨県"
},
"日本福祉大学付属高等学校": {
"読み方": "にほんふくしだいがくふぞくこうとうがっこう",
"所在位置": "愛知県"
},
"日本文理大学附属高等学校": {
"読み方": "につぽんぶんりだいがくふぞくこうとうがっこう",
"所在位置": "大分県"
},
"人間環境大学附属 岡崎高等学校": {
"読み方": "にんげんかんきょうだいがくふぞく おかざきこうとうがっこう",
"所在位置": "愛知県"
},
"沼津中央高等学校": {
"読み方": "ぬまづちゅうおうこうとうがっこう",
"所在位置": "静岡県"
},
"ノートルダム清心高等学校": {
"読み方": "のーとるだむせいしんこうとうがっこう",
"所在位置": "広島県"
},
"野田学園高等学校": {
"読み方": "のだがくえんこうとうがっこう",
"所在位置": "山口県"
},
"延岡学園高等学校": {
"読み方": "のべおかがくえんこうとうがっこう",
"所在位置": "宮崎県"
},
"博多高等学校": {
"読み方": "はかたこうとうがっこう",
"所在位置": "福岡県"
},
"博多女子高等学校": {
"読み方": "はかたじょしこうとうがっこう",
"所在位置": "福岡県"
},
"萩光塩学院高等学校": {
"読み方": "はぎこうえんがくいんこうとうがっこう",
"所在位置": "山口県"
},
"白鴎大学足利高等学校": {
"読み方": "はくおうだいがくあしかがこうとうがっこう",
"所在位置": "栃木県"
},
"白鵬女子高等学校": {
"読み方": "はくほうじょしこうとうがっこう",
"所在位置": "神奈川県"
},
"白陵高等学校": {
"読み方": "はくりょうこうとうがっこう",
"所在位置": "兵庫県"
},
"羽黒高等学校": {
"読み方": "はぐろこうとうがっこう",
"所在位置": "山形県"
},
"八戸工業大学第一高等学校": {
"読み方": "はちのへこうぎょうだいがくだいいちこうとうがっこう",
"所在位置": "青森県"
},
"八戸工業大学第二高等学校": {
"読み方": "はちのへこうぎょうだいがくだいにこうとうがっこう",
"所在位置": "青森県"
},
"八戸聖ウルスラ学院高等学校": {
"読み方": "はちのへせいうるすらがくいんこうとうがっこう",
"所在位置": "青森県"
},
"初芝橋本高等学校": {
"読み方": "はつしばはしもとこうとうがっこう",
"所在位置": "和歌山県"
},
"花咲徳栄高等学校": {
"読み方": "はなさきとくはるこうとうがっこう",
"所在位置": "埼玉県"
},
"花巻東高等学校": {
"読み方": "はなまきひがしこうとうがっこう",
"所在位置": "岩手県"
},
"浜松聖星高等学校": {
"読み方": "はままつせいせいこうとうがっこう",
"所在位置": "静岡県"
},
"浜松開誠館高等学校": {
"読み方": "はままつかいせいかんこうとうがっこう",
"所在位置": "静岡県"
},
"浜松学芸高等学校": {
"読み方": "はままつがくげいこうとうがっこう",
"所在位置": "静岡県"
},
"浜松啓陽高等学校": {
"読み方": "はままつけいようこうとうがっこう",
"所在位置": "静岡県"
},
"浜松市立高等学校": {
"読み方": "はままつしりつこうとうがっこう",
"所在位置": "静岡県"
},
"浜松日体高等学校": {
"読み方": "はままつにったいこうとうがっこう",
"所在位置": "静岡県"
},
"早鞆高等学校": {
"読み方": "はやともこうとうがっこう",
"所在位置": "山口県"
},
"比叡山高等学校": {
"読み方": "ひえいざんこうとうがっこう",
"所在位置": "滋賀県"
},
"東九州龍谷高等学校": {
"読み方": "ひがしきゅうしゅうりゅうこくこうとうがっこう",
"所在位置": "大分県"
},
"東筑紫学園高等学校": {
"読み方": "ひがしちくしがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"東日本国際大学附属昌平高等学校": {
"読み方": "ひがしにっぽんこくさいだいがくふぞくしょうへいこうとうがっこう",
"所在位置": "福島県"
},
"東野高等学校": {
"読み方": "ひがしのこうとうがっこう",
"所在位置": "埼玉県"
},
"東福岡高等学校": {
"読み方": "ひがしふくおかこうとうがっこう",
"所在位置": "福岡県"
},
"光ヶ丘女子高等学校": {
"読み方": "ひかりがおかじょしこうとうがっこう",
"所在位置": "愛知県"
},
"彦根総合高等学校": {
"読み方": "ひこねそうごうこうとうがっこう",
"所在位置": "滋賀県"
},
"日出学園高等学校": {
"読み方": "ひのでがくえんこうとうがっこう",
"所在位置": "千葉県"
},
"比治山女子高等学校": {
"読み方": "ひじやまじょしこうとうがっこう",
"所在位置": "広島県"
},
"聖ヨゼフ学園高等学校": {
"読み方": "せいよぜふがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"英明高等学校": {
"読み方": "えいめいこうとうがっこう",
"所在位置": "香川県"
},
"秀明高等学校": {
"読み方": "しゅうめいこうとうがっこう",
"所在位置": "埼玉県"
},
"秀明英光高等学校": {
"読み方": "しゅうめいえいこうこうとうがっこう",
"所在位置": "埼玉県"
},
"海星高等学校": {
"読み方": "かいせいこうとうがっこう",
"所在位置": "長崎県"
},
"桜丘高等学校": {
"読み方": "さくらおかこうとうがっこう",
"所在位置": "愛知県"
},
"自由ヶ丘高等学校": {
"読み方": "じゆうがおかこうとうがっこう",
"所在位置": "兵庫県"
},
"青山高等学校": {
"読み方": "あおやまこうとうがっこう",
"所在位置": "三重県"
},
"日向学院高等学校": {
"読み方": "ひゅうががくいんこうとうがっこう",
"所在位置": "宮崎県"
},
"日ノ本学園高等学校": {
"読み方": "ひのもとがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"雲雀丘学園高等学校": {
"読み方": "ひばりがおかがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"日々輝学園高等学校": {
"読み方": "ひびきがくえんこうとうがっこう",
"所在位置": "栃木県"
},
"姫路市立琴丘高等学校": {
"読み方": "ひめじしりつことがおかこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路市立飾磨高等学校": {
"読み方": "ひめじしりつしかまこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路市立姫路高等学校": {
"読み方": "ひめじしりつひめじこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路女学院高等学校": {
"読み方": "ひめじじょがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"相生高等学校": {
"読み方": "あいおいこうとうがっこう",
"所在位置": "兵庫県"
},
"相生産業高等学校": {
"読み方": "あいおいさんぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"明石南高等学校": {
"読み方": "あかしみなみこうとうがっこう",
"所在位置": "兵庫県"
},
"明石高等学校": {
"読み方": "あかしこうとうがっこう",
"所在位置": "兵庫県"
},
"明石北高等学校": {
"読み方": "あかしきたこうとうがっこう",
"所在位置": "兵庫県"
},
"明石清水高等学校": {
"読み方": "あかししみずこうとうがっこう",
"所在位置": "兵庫県"
},
"明石城西高等学校": {
"読み方": "あかしじょうさいこうとうがっこう",
"所在位置": "兵庫県"
},
"明石西高等学校": {
"読み方": "あかしにしこうとうがっこう",
"所在位置": "兵庫県"
},
"芦屋高等学校": {
"読み方": "あしやこうとうがっこう",
"所在位置": "兵庫県"
},
"網干高等学校": {
"読み方": "あぼしこうとうがっこう",
"所在位置": "兵庫県"
},
"尼崎高等学校": {
"読み方": "あまがさきこうとうがっこう",
"所在位置": "兵庫県"
},
"尼崎稲園高等学校": {
"読み方": "あまがさきいなぞのこうとうがっこう",
"所在位置": "兵庫県"
},
"尼崎小田高等学校": {
"読み方": "あまがさきおだこうとうがっこう",
"所在位置": "兵庫県"
},
"尼崎北高等学校": {
"読み方": "あまがさききたこうとうがっこう",
"所在位置": "兵庫県"
},
"尼崎工業高等学校": {
"読み方": "あまがさきこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"尼崎西高等学校": {
"読み方": "あまがさきにしこうとうがっこう",
"所在位置": "兵庫県"
},
"淡路高等学校": {
"読み方": "あわじこうとうがっこう",
"所在位置": "兵庫県"
},
"淡路三原高等学校": {
"読み方": "あわじみはらこうとうがっこう",
"所在位置": "兵庫県"
},
"伊川谷高等学校": {
"読み方": "いかわだにこうとうがっこう",
"所在位置": "兵庫県"
},
"伊川谷北高等学校": {
"読み方": "いかわだにきたこうとうがっこう",
"所在位置": "兵庫県"
},
"生野高等学校": {
"読み方": "いくのこうとうがっこう",
"所在位置": "兵庫県"
},
"出石高等学校": {
"読み方": "いずしこうとうがっこう",
"所在位置": "兵庫県"
},
"伊丹高等学校": {
"読み方": "いたみこうとうがっこう",
"所在位置": "兵庫県"
},
"伊丹北高等学校": {
"読み方": "いたみきたこうとうがっこう",
"所在位置": "兵庫県"
},
"伊丹西高等学校": {
"読み方": "いたみにしこうとうがっこう",
"所在位置": "兵庫県"
},
"猪名川高等学校": {
"読み方": "いながわこうとうがっこう",
"所在位置": "兵庫県"
},
"小野高等学校": {
"読み方": "おのこうとうがっこう",
"所在位置": "兵庫県"
},
"小野工業高等学校": {
"読み方": "おのこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"加古川北高等学校": {
"読み方": "かこがわきたこうとうがっこう",
"所在位置": "兵庫県"
},
"加古川西高等学校": {
"読み方": "かこがわにしこうとうがっこう",
"所在位置": "兵庫県"
},
"加古川東高等学校": {
"読み方": "かこがわひがしこうとうがっこう",
"所在位置": "兵庫県"
},
"加古川南高等学校": {
"読み方": "かこがわみなみこうとうがっこう",
"所在位置": "兵庫県"
},
"柏原高等学校": {
"読み方": "かいばらこうとうがっこう",
"所在位置": "兵庫県"
},
"香住高等学校": {
"読み方": "かすみこうとうがっこう",
"所在位置": "兵庫県"
},
"上郡高等学校": {
"読み方": "かみごおりこうとうがっこう",
"所在位置": "兵庫県"
},
"川西北陵高等学校": {
"読み方": "かわにしほくりょうこうとうがっこう",
"所在位置": "兵庫県"
},
"川西緑台高等学校": {
"読み方": "かわにしみどりだいこうとうがっこう",
"所在位置": "兵庫県"
},
"川西明峰高等学校": {
"読み方": "かわにしめいほうこうとうがっこう",
"所在位置": "兵庫県"
},
"神崎高等学校": {
"読み方": "かんざきこうとうがっこう",
"所在位置": "兵庫県"
},
"北須磨高等学校": {
"読み方": "きたすまこうとうがっこう",
"所在位置": "兵庫県"
},
"香寺高等学校": {
"読み方": "こうでらこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸高等学校": {
"読み方": "かんべこうとうがっこう",
"所在位置": "三重県"
},
"神戸北高等学校": {
"読み方": "こうべきたこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸甲北高等学校": {
"読み方": "こうべこうほくこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸商業高等学校": {
"読み方": "こうべしょうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸鈴蘭台高等学校": {
"読み方": "こうべすずらんだいこうとうがっこう",
"所在位置": "兵庫県"
},
"神戸高塚高等学校": {
"読み方": "こうべたかつかこうとうがっこう",
"所在位置": "兵庫県"
},
"御影高等学校": {
"読み方": "みかげこうとうがっこう",
"所在位置": "兵庫県"
},
"国際高等学校": {
"読み方": "こくさいこうとうがっこう",
"所在位置": "兵庫県"
},
"篠山産業高等学校": {
"読み方": "ささやまさんぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"篠山鳳鳴高等学校": {
"読み方": "ささやまほうめいこうとうがっこう",
"所在位置": "兵庫県"
},
"佐用高等学校": {
"読み方": "さようこうとうがっこう",
"所在位置": "兵庫県"
},
"飾磨工業高等学校": {
"読み方": "しかまこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"社高等学校": {
"読み方": "やしろこうとうがっこう",
"所在位置": "兵庫県"
},
"須磨友が丘高等学校": {
"読み方": "すまともがおかこうとうがっこう",
"所在位置": "兵庫県"
},
"須磨東高等学校": {
"読み方": "すまひがしこうとうがっこう",
"所在位置": "兵庫県"
},
"洲本高等学校": {
"読み方": "すもとこうとうがっこう",
"所在位置": "兵庫県"
},
"洲本実業高等学校": {
"読み方": "すもとじつぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"兵庫県立大学附属高等学校": {
"読み方": "ひょうごけんりつだいがくふぞくこうとうがっこう",
"所在位置": "兵庫県"
},
"太子高等学校": {
"読み方": "たいしこうとうがっこう",
"所在位置": "兵庫県"
},
"高砂高等学校": {
"読み方": "たかさごこうとうがっこう",
"所在位置": "兵庫県"
},
"高砂南高等学校": {
"読み方": "たかさごみなみこうとうがっこう",
"所在位置": "兵庫県"
},
"宝塚高等学校": {
"読み方": "たからづかこうとうがっこう",
"所在位置": "兵庫県"
},
"宝塚北高等学校": {
"読み方": "たからづかきたこうとうがっこう",
"所在位置": "兵庫県"
},
"宝塚西高等学校": {
"読み方": "たからづかにしこうとうがっこう",
"所在位置": "兵庫県"
},
"宝塚東高等学校": {
"読み方": "たからづかひがしこうとうがっこう",
"所在位置": "兵庫県"
},
"但馬農業高等学校": {
"読み方": "たじまのうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"龍野高等学校": {
"読み方": "たつのこうとうがっこう",
"所在位置": "兵庫県"
},
"津名高等学校": {
"読み方": "つなこうとうがっこう",
"所在位置": "兵庫県"
},
"東播工業高等学校": {
"読み方": "とうばんこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"豊岡総合高等学校": {
"読み方": "とよおかそうごうこうとうがっこう",
"所在位置": "兵庫県"
},
"長田高等学校": {
"読み方": "ながたこうとうがっこう",
"所在位置": "兵庫県"
},
"鳴尾高等学校": {
"読み方": "なるおこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮高等学校": {
"読み方": "にしのみやこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮今津高等学校": {
"読み方": "にしのみやいまづこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮北高等学校": {
"読み方": "にしのみやきたこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮甲山高等学校": {
"読み方": "にしのみやかぶとやまこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮香風高等学校": {
"読み方": "にしのみやこうふうこうとうがっこう",
"所在位置": "兵庫県"
},
"西宮南高等学校": {
"読み方": "にしのみやみなみこうとうがっこう",
"所在位置": "兵庫県"
},
"西脇高等学校": {
"読み方": "にしわきこうとうがっこう",
"所在位置": "兵庫県"
},
"西脇工業高等学校": {
"読み方": "にしわきこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"兵庫県立農業高等学校": {
"読み方": "ひょうごけんりつのうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"浜坂高等学校": {
"読み方": "はまさかこうとうがっこう",
"所在位置": "兵庫県"
},
"播磨農業高等学校": {
"読み方": "はりまのうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"播磨南高等学校": {
"読み方": "はりまみなみこうとうがっこう",
"所在位置": "兵庫県"
},
"東灘高等学校": {
"読み方": "ひがしなだこうとうがっこう",
"所在位置": "兵庫県"
},
"東播磨高等学校": {
"読み方": "ひがしはりまこうとうがっこう",
"所在位置": "兵庫県"
},
"氷上高等学校": {
"読み方": "ひかみこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路北高等学校": {
"読み方": "ひめじきたこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路工業高等学校": {
"読み方": "ひめじこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路飾西高等学校": {
"読み方": "ひめじしきさいこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路商業高等学校": {
"読み方": "ひめじしょうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路西高等学校": {
"読み方": "ひめじにしこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路東高等学校": {
"読み方": "ひめじひがしこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路別所高等学校": {
"読み方": "ひめじべっしょこうとうがっこう",
"所在位置": "兵庫県"
},
"姫路南高等学校": {
"読み方": "ひめじみなみこうとうがっこう",
"所在位置": "兵庫県"
},
"兵庫高等学校": {
"読み方": "ひょうごこうとうがっこう",
"所在位置": "兵庫県"
},
"兵庫工業高等学校": {
"読み方": "ひょうごこうぎょうこうとうがっこう",
"所在位置": "兵庫県"
},
"福崎高等学校": {
"読み方": "ふくさきこうとうがっこう",
"所在位置": "兵庫県"
},
"北摂三田高等学校": {
"読み方": "ほくせつさんだこうとうがっこう",
"所在位置": "兵庫県"
},
"舞子高等学校": {
"読み方": "まいここうとうがっこう",
"所在位置": "兵庫県"
},
"三木北高等学校": {
"読み方": "みききたこうとうがっこう",
"所在位置": "兵庫県"
},
"三木東高等学校": {
"読み方": "みきひがしこうとうがっこう",
"所在位置": "兵庫県"
},
"三田祥雲館高等学校": {
"読み方": "さんだしょううんかんこうとうがっこう",
"所在位置": "兵庫県"
},
"三田西陵高等学校": {
"読み方": "さんだせいりょうこうとうがっこう",
"所在位置": "兵庫県"
},
"湊川高等学校": {
"読み方": "みなとがわこうとうがっこう",
"所在位置": "兵庫県"
},
"武庫荘総合高等学校": {
"読み方": "むこのそうそうごうこうとうがっこう",
"所在位置": "兵庫県"
},
"村岡高等学校": {
"読み方": "むらおかこうとうがっこう",
"所在位置": "兵庫県"
},
"山崎高等学校": {
"読み方": "やまざきこうとうがっこう",
"所在位置": "兵庫県"
},
"夢前高等学校": {
"読み方": "ゆめさきこうとうがっこう",
"所在位置": "兵庫県"
},
"夢野台高等学校": {
"読み方": "ゆめのだいこうとうがっこう",
"所在位置": "兵庫県"
},
"八鹿高等学校": {
"読み方": "ようかこうとうがっこう",
"所在位置": "兵庫県"
},
"平塚学園高等学校": {
"読み方": "ひらつかがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"飛龍高等学校": {
"読み方": "ひりゅうこうとうがっこう",
"所在位置": "静岡県"
},
"弘前学院聖愛高等学校": {
"読み方": "ひろさきがくいんせいあいこうとうがっこう",
"所在位置": "青森県"
},
"弘前東高等学校": {
"読み方": "ひろさきひがしこうとうがっこう",
"所在位置": "青森県"
},
"広島学院高等学校": {
"読み方": "ひろしまがくいんこうとうがっこう",
"所在位置": "広島県"
},
"安芸府中高等学校": {
"読み方": "あきふちゅうこうとうがっこう",
"所在位置": "広島県"
},
"安芸南高等学校": {
"読み方": "あきみなみこうとうがっこう",
"所在位置": "広島県"
},
"安西高等学校": {
"読み方": "やすにしこうとうがっこう",
"所在位置": "広島県"
},
"五日市高等学校": {
"読み方": "いつかいちこうとうがっこう",
"所在位置": "広島県"
},
"因島高等学校": {
"読み方": "いんのしまこうとうがっこう",
"所在位置": "広島県"
},
"大竹高等学校": {
"読み方": "おおたけこうとうがっこう",
"所在位置": "広島県"
},
"尾道北高等学校": {
"読み方": "おのみちきたこうとうがっこう",
"所在位置": "広島県"
},
"尾道商業高等学校": {
"読み方": "おのみちしょうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"尾道東高等学校": {
"読み方": "おのみちひがしこうとうがっこう",
"所在位置": "広島県"
},
"音戸高等学校": {
"読み方": "おんどこうとうがっこう",
"所在位置": "広島県"
},
"海田高等学校": {
"読み方": "かいたこうとうがっこう",
"所在位置": "広島県"
},
"可部高等学校": {
"読み方": "かべこうとうがっこう",
"所在位置": "広島県"
},
"賀茂高等学校": {
"読み方": "かもこうとうがっこう",
"所在位置": "広島県"
},
"神辺高等学校": {
"読み方": "かんなべこうとうがっこう",
"所在位置": "広島県"
},
"神辺旭高等学校": {
"読み方": "かんなべあさひこうとうがっこう",
"所在位置": "広島県"
},
"祇園北高等学校": {
"読み方": "ぎおんきたこうとうがっこう",
"所在位置": "広島県"
},
"熊野高等学校": {
"読み方": "くまのこうとうがっこう",
"所在位置": "和歌山県"
},
"呉工業高等学校": {
"読み方": "くれこうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"呉商業高等学校": {
"読み方": "くれしょうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"呉昭和高等学校": {
"読み方": "くれしょうわこうとうがっこう",
"所在位置": "広島県"
},
"呉三津田高等学校": {
"読み方": "くれみつたこうとうがっこう",
"所在位置": "広島県"
},
"呉宮原高等学校": {
"読み方": "くれみやはらこうとうがっこう",
"所在位置": "広島県"
},
"黒瀬高等学校": {
"読み方": "くろせこうとうがっこう",
"所在位置": "広島県"
},
"高陽高等学校": {
"読み方": "こうようこうとうがっこう",
"所在位置": "広島県"
},
"高陽東高等学校": {
"読み方": "こうようひがしこうとうがっこう",
"所在位置": "広島県"
},
"西城紫水高等学校": {
"読み方": "さいじょうしすいこうとうがっこう",
"所在位置": "広島県"
},
"西条農業高等学校": {
"読み方": "さいじょうのうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"三次高等学校": {
"読み方": "みよしこうとうがっこう",
"所在位置": "広島県"
},
"三次青陵高等学校": {
"読み方": "みよしせいりょうこうとうがっこう",
"所在位置": "広島県"
},
"庄原格致高等学校": {
"読み方": "しょうばらかくちこうとうがっこう",
"所在位置": "広島県"
},
"庄原実業高等学校": {
"読み方": "しょうばらじつぎょうこうとうがっこう",
"所在位置": "広島県"
},
"世羅高等学校": {
"読み方": "せらこうとうがっこう",
"所在位置": "広島県"
},
"総合技術高等学校": {
"読み方": "そうごうぎじゅつこうとうがっこう",
"所在位置": "広島県"
},
"竹原高等学校": {
"読み方": "たけはらこうとうがっこう",
"所在位置": "広島県"
},
"忠海高等学校": {
"読み方": "ただのうみこうとうがっこう",
"所在位置": "広島県"
},
"戸手高等学校": {
"読み方": "とでこうとうがっこう",
"所在位置": "広島県"
},
"西高等学校": {
"読み方": "にしこうとうがっこう",
"所在位置": "広島県"
},
"日彰館高等学校": {
"読み方": "にっしょうかんこうとうがっこう",
"所在位置": "広島県"
},
"廿日市高等学校": {
"読み方": "はつかいちこうとうがっこう",
"所在位置": "広島県"
},
"廿日市西高等学校": {
"読み方": "はつかいちにしこうとうがっこう",
"所在位置": "広島県"
},
"東高等学校": {
"読み方": "ひがしこうとうがっこう",
"所在位置": "広島県"
},
"広高等学校": {
"読み方": "ひろこうとうがっこう",
"所在位置": "広島県"
},
"広島高等学校": {
"読み方": "ひろしまこうとうがっこう",
"所在位置": "広島県"
},
"広島井口高等学校": {
"読み方": "ひろしまいのくちこうとうがっこう",
"所在位置": "広島県"
},
"広島観音高等学校": {
"読み方": "ひろしまかんおんこうとうがっこう",
"所在位置": "広島県"
},
"広島工業高等学校": {
"読み方": "ひろしまこうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"広島国泰寺高等学校": {
"読み方": "ひろしまこくたいじこうとうがっこう",
"所在位置": "広島県"
},
"広島商業高等学校": {
"読み方": "ひろしましょうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"広島皆実高等学校": {
"読み方": "ひろしまみなみこうとうがっこう",
"所在位置": "広島県"
},
"福山葦陽高等学校": {
"読み方": "ふくやまいようこうとうがっこう",
"所在位置": "広島県"
},
"福山工業高等学校": {
"読み方": "ふくやまこうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"福山商業高等学校": {
"読み方": "ふくやましょうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"福山誠之館高等学校": {
"読み方": "ふくやませいしかんこうとうがっこう",
"所在位置": "広島県"
},
"福山明王台高等学校": {
"読み方": "ふくやまみょうおうだいこうとうがっこう",
"所在位置": "広島県"
},
"府中高等学校": {
"読み方": "ふちゅうこうとうがっこう",
"所在位置": "広島県"
},
"府中東高等学校": {
"読み方": "ふちゅうひがしこうとうがっこう",
"所在位置": "広島県"
},
"松永高等学校": {
"読み方": "まつながこうとうがっこう",
"所在位置": "広島県"
},
"御調高等学校": {
"読み方": "みつぎこうとうがっこう",
"所在位置": "広島県"
},
"三原高等学校": {
"読み方": "みはらこうとうがっこう",
"所在位置": "広島県"
},
"三原東高等学校": {
"読み方": "みはらひがしこうとうがっこう",
"所在位置": "広島県"
},
"宮島工業高等学校": {
"読み方": "みやじまこうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"安古市高等学校": {
"読み方": "やすふるいちこうとうがっこう",
"所在位置": "広島県"
},
"広島国際学院高等学校": {
"読み方": "ひろしまこくさいがくいんこうとうがっこう",
"所在位置": "広島県"
},
"広島三育学院高等学校": {
"読み方": "ひろしまさんいくがくいんこうとうがっこう",
"所在位置": "広島県"
},
"広島山陽学園山陽高等学校": {
"読み方": "さんようこうとうがっこう",
"所在位置": "広島県"
},
"広島城北高等学校": {
"読み方": "ひろしまじょうほくこうとうがっこう",
"所在位置": "広島県"
},
"広島女学院高等学校": {
"読み方": "ひろしまじょがくいんちゅうがくこうとうがっこう",
"所在位置": "広島県"
},
"広島市立大手町商業高等学校": {
"読み方": "ひろしましりつおおてまちしょうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"広島市立沼田高等学校": {
"読み方": "ひろしましりつぬまたこうとうがっこう",
"所在位置": "広島県"
},
"広島市立広島工業高等学校": {
"読み方": "ひろしましりつひろしまこうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"広島市立広島商業高等学校": {
"読み方": "ひろしましりつひろしましょうぎょうこうとうがっこう",
"所在位置": "広島県"
},
"広島市立舟入高等学校": {
"読み方": "ひろしましりつふないりこうとうがっこう",
"所在位置": "広島県"
},
"広島市立美鈴が丘高等学校": {
"読み方": "ひろしましりつみすずがおかこうとうがっこう",
"所在位置": "広島県"
},
"広島市立基町高等学校": {
"読み方": "ひろしましりつもとまちこうとうがっこう",
"所在位置": "広島県"
},
"広島白鳩学園広島翔洋高等学校": {
"読み方": "ひろしましょうようこうとうがっこう",
"所在位置": "広島県"
},
"広島新庄高等学校": {
"読み方": "ひろしましんじょうこうとうがっこう",
"所在位置": "広島県"
},
"広島大学附属高等学校": {
"読み方": "ひろしまだいがくふぞくこうとうがっこう",
"所在位置": "広島県"
},
"広島大学附属福山高等学校": {
"読み方": "ひろしまだいがくふぞくふくやまこうとうがっこう",
"所在位置": "広島県"
},
"広島なぎさ高等学校": {
"読み方": "ひろしまなぎさこうとうがっこう",
"所在位置": "広島県"
},
"弘学館高等学校": {
"読み方": "こうがくかんこうとうがっこう",
"所在位置": "佐賀県"
},
"フェリス女学院高等学校": {
"読み方": "ふぇりすじょがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"足羽高等学校": {
"読み方": "あすわこうとうがっこう",
"所在位置": "福井県"
},
"羽水高等学校": {
"読み方": "うすいこうとうがっこう",
"所在位置": "福井県"
},
"大野高等学校": {
"読み方": "おおのこうとうがっこう",
"所在位置": "福井県"
},
"奥越明成高等学校": {
"読み方": "おくえつめいせいこうとうがっこう",
"所在位置": "福井県"
},
"勝山高等学校": {
"読み方": "かつやまこうとうがっこう",
"所在位置": "福井県"
},
"金津高等学校": {
"読み方": "かなづこうとうがっこう",
"所在位置": "福井県"
},
"高志高等学校": {
"読み方": "こしこうとうがっこう",
"所在位置": "福井県"
},
"鯖江高等学校": {
"読み方": "さばえこうとうがっこう",
"所在位置": "福井県"
},
"武生高等学校": {
"読み方": "たけふこうとうがっこう",
"所在位置": "福井県"
},
"武生東高等学校": {
"読み方": "たけふひがしこうとうがっこう",
"所在位置": "福井県"
},
"敦賀高等学校": {
"読み方": "つるがこうとうがっこう",
"所在位置": "福井県"
},
"敦賀工業高等学校": {
"読み方": "つるがこうぎょうこうとうがっこう",
"所在位置": "福井県"
},
"福井商業高等学校": {
"読み方": "ふくいしょうぎょうこうとうがっこう",
"所在位置": "福井県"
},
"福井農林高等学校": {
"読み方": "ふくいのうりんこうとうがっこう",
"所在位置": "福井県"
},
"藤島高等学校": {
"読み方": "ふじしまこうとうがっこう",
"所在位置": "福井県"
},
"丸岡高等学校": {
"読み方": "まるおかこうとうがっこう",
"所在位置": "福井県"
},
"美方高等学校": {
"読み方": "みかたこうとうがっこう",
"所在位置": "福井県"
},
"三国高等学校": {
"読み方": "みくにこうとうがっこう",
"所在位置": "福井県"
},
"若狭高等学校": {
"読み方": "わかさこうとうがっこう",
"所在位置": "福井県"
},
"福井工業大学附属福井高等学校": {
"読み方": "ふくいこうぎょうだいがくふぞくふくいこうとうがっこう",
"所在位置": "福井県"
},
"福井南高等学校": {
"読み方": "ふくいみなみこうとうがっこう",
"所在位置": "福井県"
},
"福岡県公立古賀竟成館高等学校": {
"読み方": "こがきょうせいかんこうとうがっこう",
"所在位置": "福岡県"
},
"三井中央高等学校": {
"読み方": "みいちゅうおうこうとうがっこう",
"所在位置": "福岡県"
},
"明善高等学校": {
"読み方": "めいぜんこうとうがっこう",
"所在位置": "福岡県"
},
"朝倉高等学校": {
"読み方": "あさくらこうとうがっこう",
"所在位置": "福岡県"
},
"朝倉光陽高等学校": {
"読み方": "あさくらこうようこうとうがっこう",
"所在位置": "福岡県"
},
"朝倉東高等学校": {
"読み方": "あさくらひがしこうとうがっこう",
"所在位置": "福岡県"
},
"ありあけ新世高等学校": {
"読み方": "ありあけしんせいこうとうがっこう",
"所在位置": "福岡県"
},
"育徳館高等学校": {
"読み方": "いくとくかんこうとうがっこう",
"所在位置": "福岡県"
},
"糸島高等学校": {
"読み方": "いとしまこうとうがっこう",
"所在位置": "福岡県"
},
"糸島農業高等学校": {
"読み方": "いとしまのうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"稲築志耕館高等学校": {
"読み方": "いなつきしこうかんこうとうがっこう",
"所在位置": "福岡県"
},
"浮羽究真館高等学校": {
"読み方": "うきはきゅうしんかんこうとうがっこう",
"所在位置": "福岡県"
},
"浮羽工業高等学校": {
"読み方": "うきはこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"宇美商業高等学校": {
"読み方": "うみしょうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"大川樟風高等学校": {
"読み方": "おおかわしょうふうこうとうがっこう",
"所在位置": "福岡県"
},
"大牟田北高等学校": {
"読み方": "おおむたきたこうとうがっこう",
"所在位置": "福岡県"
},
"小倉高等学校": {
"読み方": "こくらこうとうがっこう",
"所在位置": "福岡県"
},
"小倉工業高等学校": {
"読み方": "こくらこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"小倉商業高等学校": {
"読み方": "こくらしょうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"小倉西高等学校": {
"読み方": "こくらにしこうとうがっこう",
"所在位置": "福岡県"
},
"小郡高等学校": {
"読み方": "おごおりこうとうがっこう",
"所在位置": "福岡県"
},
"折尾高等学校": {
"読み方": "おりおこうとうがっこう",
"所在位置": "福岡県"
},
"遠賀高等学校": {
"読み方": "おんがこうとうがっこう",
"所在位置": "福岡県"
},
"香椎高等学校": {
"読み方": "かしいこうとうがっこう",
"所在位置": "福岡県"
},
"香椎工業高等学校": {
"読み方": "かしいこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"春日高等学校": {
"読み方": "かすがこうとうがっこう",
"所在位置": "福岡県"
},
"香住丘高等学校": {
"読み方": "かすみがおかこうとうがっこう",
"所在位置": "福岡県"
},
"嘉穂高等学校": {
"読み方": "かほこうとうがっこう",
"所在位置": "福岡県"
},
"嘉穂総合高等学校": {
"読み方": "かほそうごうこうとうがっこう",
"所在位置": "福岡県"
},
"嘉穂東高等学校": {
"読み方": "かほひがしこうとうがっこう",
"所在位置": "福岡県"
},
"苅田工業高等学校": {
"読み方": "かんだこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"北九州高等学校": {
"読み方": "きたきゅうしゅうこうとうがっこう",
"所在位置": "福岡県"
},
"京都高等学校": {
"読み方": "みやここうとうがっこう",
"所在位置": "福岡県"
},
"鞍手高等学校": {
"読み方": "くらてこうとうがっこう",
"所在位置": "福岡県"
},
"久留米高等学校": {
"読み方": "くるめこうとうがっこう",
"所在位置": "福岡県"
},
"久留米筑水高等学校": {
"読み方": "くるめちくすいこうとうがっこう",
"所在位置": "福岡県"
},
"玄界高等学校": {
"読み方": "げんかいこうとうがっこう",
"所在位置": "福岡県"
},
"玄洋高等学校": {
"読み方": "げんようこうとうがっこう",
"所在位置": "福岡県"
},
"小倉東高等学校": {
"読み方": "こくらひがしこうとうがっこう",
"所在位置": "福岡県"
},
"小倉南高等学校": {
"読み方": "こくらみなみこうとうがっこう",
"所在位置": "福岡県"
},
"早良高等学校": {
"読み方": "さわらこうとうがっこう",
"所在位置": "福岡県"
},
"修猷館高等学校": {
"読み方": "しゅうゆうかんこうとうがっこう",
"所在位置": "福岡県"
},
"新宮高等学校": {
"読み方": "しんぐうこうとうがっこう",
"所在位置": "和歌山県"
},
"水産高等学校": {
"読み方": "すいさんこうとうがっこう",
"所在位置": "福岡県"
},
"須恵高等学校": {
"読み方": "すえこうとうがっこう",
"所在位置": "福岡県"
},
"青豊高等学校": {
"読み方": "せいほうこうとうがっこう",
"所在位置": "福岡県"
},
"太宰府高等学校": {
"読み方": "だざいふこうとうがっこう",
"所在位置": "福岡県"
},
"筑紫丘高等学校": {
"読み方": "ちくしがおかこうとうがっこう",
"所在位置": "福岡県"
},
"築上西高等学校": {
"読み方": "ちくじょうにしこうとうがっこう",
"所在位置": "福岡県"
},
"筑前高等学校": {
"読み方": "ちくぜんこうとうがっこう",
"所在位置": "福岡県"
},
"筑豊高等学校": {
"読み方": "ちくほうこうとうがっこう",
"所在位置": "福岡県"
},
"筑紫高等学校": {
"読み方": "ちくしこうとうがっこう",
"所在位置": "福岡県"
},
"筑紫中央高等学校": {
"読み方": "ちくしちゅうおうこうとうがっこう",
"所在位置": "福岡県"
},
"伝習館高等学校": {
"読み方": "でんしゅうかんこうとうがっこう",
"所在位置": "福岡県"
},
"東筑高等学校": {
"読み方": "とうちくこうとうがっこう",
"所在位置": "福岡県"
},
"東鷹高等学校": {
"読み方": "とうようこうとうがっこう",
"所在位置": "福岡県"
},
"戸畑高等学校": {
"読み方": "とばたこうとうがっこう",
"所在位置": "福岡県"
},
"戸畑工業高等学校": {
"読み方": "とばたこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"中間高等学校": {
"読み方": "なかまこうとうがっこう",
"所在位置": "福岡県"
},
"西田川高等学校": {
"読み方": "にしたがわこうとうがっこう",
"所在位置": "福岡県"
},
"直方高等学校": {
"読み方": "のおがたこうとうがっこう",
"所在位置": "福岡県"
},
"博多青松高等学校（通信制）": {
"読み方": "はかたせいしょうこうとうがっこうつうしんせい",
"所在位置": "福岡県"
},
"ひびき高等学校": {
"読み方": "ひびきこうとうがっこう",
"所在位置": "福岡県"
},
"福岡魁誠高等学校": {
"読み方": "ふくおかかいせいこうとうがっこう",
"所在位置": "福岡県"
},
"福岡県立福岡工業高等学校": {
"読み方": "ふくおかけんりつふくおかこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"福岡講倫館高等学校": {
"読み方": "ふくおかこうりんかんこうとうがっこう",
"所在位置": "福岡県"
},
"福岡中央高等学校": {
"読み方": "ふくおかちゅうおうこうとうがっこう",
"所在位置": "福岡県"
},
"福岡農業高等学校": {
"読み方": "ふくおかのうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"福島高等学校": {
"読み方": "ふくしまこうとうがっこう",
"所在位置": "福島県"
},
"北筑高等学校": {
"読み方": "ほくちくこうとうがっこう",
"所在位置": "福岡県"
},
"三池高等学校": {
"読み方": "みいけこうとうがっこう",
"所在位置": "福岡県"
},
"三池工業高等学校": {
"読み方": "みいけこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"三潴高等学校": {
"読み方": "みずまこうとうがっこう",
"所在位置": "福岡県"
},
"武蔵台高等学校": {
"読み方": "むさしだいこうとうがっこう",
"所在位置": "福岡県"
},
"宗像高等学校": {
"読み方": "むなかたこうとうがっこう",
"所在位置": "福岡県"
},
"門司学園高等学校": {
"読み方": "もじがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"門司大翔館高等学校": {
"読み方": "もじだいしょうかんこうとうがっこう",
"所在位置": "福岡県"
},
"山門高等学校": {
"読み方": "やまとこうとうがっこう",
"所在位置": "福岡県"
},
"八女高等学校": {
"読み方": "やめこうとうがっこう",
"所在位置": "福岡県"
},
"八女工業高等学校": {
"読み方": "やめこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"八女農業高等学校": {
"読み方": "やめのうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"八幡中央高等学校": {
"読み方": "やはたちゅうおうこうとうがっこう",
"所在位置": "福岡県"
},
"八幡南高等学校": {
"読み方": "やはたみなみこうとうがっこう",
"所在位置": "福岡県"
},
"行橋高等学校": {
"読み方": "ゆくはしこうとうがっこう",
"所在位置": "福岡県"
},
"若松商業高等学校": {
"読み方": "わかまつしょうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"福岡工業大学附属城東高等学校": {
"読み方": "ふくおかこうぎょうだいがくふぞくじょうとうこうとうがっこう",
"所在位置": "福岡県"
},
"福岡女学院高等学校": {
"読み方": "ふくおかじょがくいんこうとうがっこう",
"所在位置": "福岡県"
},
"福岡市立博多工業高等学校": {
"読み方": "ふくおかしりつはかたこうぎょうこうとうがっこう",
"所在位置": "福岡県"
},
"福岡市立福岡女子高等学校": {
"読み方": "ふくおかしりつふくおかじょしこうとうがっこう",
"所在位置": "福岡県"
},
"福岡市立福岡西陵高等学校": {
"読み方": "ふくおかしりつふくおかせいりょうこうとうがっこう",
"所在位置": "福岡県"
},
"福岡市立福翔高等学校": {
"読み方": "ふくおかしりつふくしょうこうとうがっこう",
"所在位置": "福岡県"
},
"福岡第一高等学校": {
"読み方": "ふくおかだいいちこうとうがっこう",
"所在位置": "福岡県"
},
"福岡大学附属大濠高等学校": {
"読み方": "ふくおかだいがくふぞくおおほりこうとうがっこう",
"所在位置": "福岡県"
},
"福岡大学附属若葉高等学校": {
"読み方": "ふくおかだいがくふぞくわかばこうとうがっこう",
"所在位置": "福岡県"
},
"福岡常葉高等学校": {
"読み方": "ふくおかじょうようこうとうがっこう",
"所在位置": "福岡県"
},
"福岡海星女子学院高等学校": {
"読み方": "ふくおかかいせいじょしがくいんこうとうがっこう",
"所在位置": "福岡県"
},
"福岡雙葉高等学校": {
"読み方": "ふくおかふたばこうとうがっこう",
"所在位置": "福岡県"
},
"福岡舞鶴高等学校": {
"読み方": "ふくおかまいづるこうとうがっこう",
"所在位置": "福岡県"
},
"福島県磐城第一高等学校": {
"読み方": "ふくしまけんいわきだいいちこうとうがっこう",
"所在位置": "福島県"
},
"葵高等学校": {
"読み方": "あおいこうとうがっこう",
"所在位置": "福島県"
},
"田村高等学校": {
"読み方": "たむらこうとうがっこう",
"所在位置": "福島県"
},
"原町高等学校": {
"読み方": "はらまちこうとうがっこう",
"所在位置": "福島県"
},
"会津高等学校": {
"読み方": "あいづこうとうがっこう",
"所在位置": "福島県"
},
"会津学鳳高等学校": {
"読み方": "あいづがくほうこうとうがっこう",
"所在位置": "福島県"
},
"会津工業高等学校": {
"読み方": "あいづこうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"安積高等学校": {
"読み方": "あさかこうとうがっこう",
"所在位置": "福島県"
},
"あさか開成高等学校": {
"読み方": "あさかかいせいこうとうがっこう",
"所在位置": "福島県"
},
"安達高等学校": {
"読み方": "あだちこうとうがっこう",
"所在位置": "福島県"
},
"安積黎明高等学校": {
"読み方": "あさかれいめいこうとうがっこう",
"所在位置": "福島県"
},
"磐城高等学校": {
"読み方": "いわきこうとうがっこう",
"所在位置": "福島県"
},
"いわき光洋高等学校": {
"読み方": "いわきこうようこうとうがっこう",
"所在位置": "福島県"
},
"磐城桜が丘高等学校": {
"読み方": "いわきさくらがおかこうとうがっこう",
"所在位置": "福島県"
},
"いわき総合高等学校": {
"読み方": "いわきそうごうこうとうがっこう",
"所在位置": "福島県"
},
"磐城農業高等学校": {
"読み方": "いわきのうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"小名浜海星高等学校水産校舎": {
"読み方": "いわきかいせいこうとうがっこう",
"所在位置": "福島県"
},
"いわき翠の杜高等学校": {
"読み方": "いわきみどりのもりこうとうがっこう",
"所在位置": "福島県"
},
"岩瀬農業高等学校": {
"読み方": "いわせのうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"小名浜海星高等学校本校": {
"読み方": "おなはまこうとうがっこう",
"所在位置": "福島県"
},
"喜多方高等学校": {
"読み方": "きたかたこうとうがっこう",
"所在位置": "福島県"
},
"光南高等学校": {
"読み方": "こうなんこうとうがっこう",
"所在位置": "福島県"
},
"郡山北工業高等学校": {
"読み方": "こおりやまきたこうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"郡山商業高等学校": {
"読み方": "こおりやましょうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"郡山東高等学校": {
"読み方": "こおりやまひがしこうとうがっこう",
"所在位置": "福島県"
},
"郡山萌世高等学校（通信制）": {
"読み方": "こおりやまほうせいこうとうがっこうつうしんせい",
"所在位置": "福島県"
},
"湖南高等学校": {
"読み方": "こなんこうとうがっこう",
"所在位置": "福島県"
},
"白河高等学校": {
"読み方": "しらかわこうとうがっこう",
"所在位置": "福島県"
},
"白河旭高等学校": {
"読み方": "しらかわあさひこうとうがっこう",
"所在位置": "福島県"
},
"白河実業高等学校": {
"読み方": "しらかわじつぎょうこうとうがっこう",
"所在位置": "福島県"
},
"須賀川桐陽高等学校": {
"読み方": "すかがわとうようこうとうがっこう",
"所在位置": "福島県"
},
"清陵情報高等学校": {
"読み方": "せいりょうじょうほうこうとうがっこう",
"所在位置": "福島県"
},
"相馬高等学校": {
"読み方": "そうまこうとうがっこう",
"所在位置": "福島県"
},
"相馬東高等学校": {
"読み方": "そうまひがしこうとうがっこう",
"所在位置": "福島県"
},
"平工業高等学校": {
"読み方": "たいらこうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"平商業高等学校": {
"読み方": "たいらしょうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"只見高等学校": {
"読み方": "ただみこうとうがっこう",
"所在位置": "福島県"
},
"橘高等学校": {
"読み方": "たちばなこうとうがっこう",
"所在位置": "福島県"
},
"勿来工業高等学校": {
"読み方": "なこそこうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"二本松工業高等学校": {
"読み方": "にほんまつこうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"修明高等学校": {
"読み方": "しゅうめいこうとうがっこう",
"所在位置": "福島県"
},
"福島北高等学校": {
"読み方": "ふくしまきたこうとうがっこう",
"所在位置": "福島県"
},
"福島工業高等学校": {
"読み方": "ふくしまこうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"福島商業高等学校": {
"読み方": "ふくしましょうぎょうこうとうがっこう",
"所在位置": "福島県"
},
"福島西高等学校": {
"読み方": "ふくしまにしこうとうがっこう",
"所在位置": "福島県"
},
"福島東高等学校": {
"読み方": "ふくしまひがしこうとうがっこう",
"所在位置": "福島県"
},
"福島南高等学校": {
"読み方": "ふくしまみなみこうとうがっこう",
"所在位置": "福島県"
},
"福島明成高等学校": {
"読み方": "ふくしまめいせいこうとうがっこう",
"所在位置": "福島県"
},
"船引高等学校": {
"読み方": "ふねひきこうとうがっこう",
"所在位置": "福島県"
},
"保原高等学校": {
"読み方": "ほばらこうとうがっこう",
"所在位置": "福島県"
},
"南会津高等学校": {
"読み方": "みなみあいづこうとうがっこう",
"所在位置": "福島県"
},
"本宮高等学校": {
"読み方": "もとみやこうとうがっこう",
"所在位置": "福島県"
},
"湯本高等学校": {
"読み方": "ゆもとこうとうがっこう",
"所在位置": "福島県"
},
"福島成蹊高等学校": {
"読み方": "ふくしませいけいこうとうがっこう",
"所在位置": "福島県"
},
"福島東稜高等学校": {
"読み方": "ふくしまとうりょうこうとうがっこう",
"所在位置": "福島県"
},
"福徳学院高等学校": {
"読み方": "ふくとくがくいんこうとうがっこう",
"所在位置": "大分県"
},
"福山暁の星女子高等学校": {
"読み方": "ふくやまあけのほしじょしこうとうがっこう",
"所在位置": "広島県"
},
"福山市立福山高等学校": {
"読み方": "ふくやましりつふくやまこうとうがっこう",
"所在位置": "広島県"
},
"藤井学園寒川高等学校": {
"読み方": "ふじいがくえんさんがわこうとうがっこう",
"所在位置": "香川県"
},
"藤枝順心高等学校": {
"読み方": "ふじえだじゅんしんこうとうがっこう",
"所在位置": "静岡県"
},
"藤枝明誠高等学校": {
"読み方": "ふじえだめいせいこうとうがっこう",
"所在位置": "静岡県"
},
"富士学苑高等学校": {
"読み方": "ふじがくえんこうとうがっこう",
"所在位置": "山梨県"
},
"不二越工業高等学校": {
"読み方": "ふじこしこうぎょうこうとうがっこう",
"所在位置": "富山県"
},
"藤沢翔陵高等学校": {
"読み方": "ふじさわしょうりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"不二女子高等学校": {
"読み方": "ふじじょしこうとうがっこう",
"所在位置": "千葉県"
},
"富士市立高等学校": {
"読み方": "ふじしりつこうとうがっこう",
"所在位置": "静岡県"
},
"不二聖心女子学院高等学校": {
"読み方": "ふじせいしんじょしがくいんこうとうがっこう",
"所在位置": "静岡県"
},
"藤ノ花女子高等学校": {
"読み方": "ふじのはなじょしこうとうがっこう",
"所在位置": "愛知県"
},
"武相高等学校": {
"読み方": "ぶそうこうとうがっこう",
"所在位置": "神奈川県"
},
"船橋市立船橋高等学校": {
"読み方": "ふなばししりつふなばしこうとうがっこう",
"所在位置": "千葉県"
},
"武南高等学校": {
"読み方": "ぶなんこうとうがっこう",
"所在位置": "埼玉県"
},
"文徳高等学校": {
"読み方": "ぶんとくこうとうがっこう",
"所在位置": "熊本県"
},
"古川学園高等学校": {
"読み方": "ふるかわがくえんこうとうがっこう",
"所在位置": "宮城県"
},
"文化学園長野高等学校": {
"読み方": "ぶんかがくえんながのこうとうがっこう",
"所在位置": "長野県"
},
"文星芸術大学附属高等学校": {
"読み方": "ぶんせいげいじゅつだいがくふぞくこうとうがっこう",
"所在位置": "栃木県"
},
"別府溝部学園高等学校": {
"読み方": "べっぷみぞべがくえんこうとうがっこう",
"所在位置": "大分県"
},
"鳳凰高等学校": {
"読み方": "ほうおうこうとうがっこう",
"所在位置": "鹿児島県"
},
"豊国学園高等学校": {
"読み方": "ほうこくがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"鵬翔高等学校": {
"読み方": "ほうしょうこうとうがっこう",
"所在位置": "宮崎県"
},
"法政大学国際高等学校": {
"読み方": "ほうせいだいがくこくさいこうとうがっこう",
"所在位置": "神奈川県"
},
"法政大学第二高等学校": {
"読み方": "ほうせいだいがくだいにこうとうがっこう",
"所在位置": "神奈川県"
},
"報徳学園高等学校": {
"読み方": "ほうとくがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"北越高等学校": {
"読み方": "ほくえつこうとうがっこう",
"所在位置": "新潟県"
},
"北杜市立甲陵高等学校": {
"読み方": "ほくとしりつこうりょうこうとうがっこう",
"所在位置": "山梨県"
},
"北陸学院高等学校": {
"読み方": "ほくりくがくいんこうとうがっこう",
"所在位置": "石川県"
},
"北陸学園北陸高等学校": {
"読み方": "ほくりくこうとうがっこう",
"所在位置": "福井県"
},
"北陵高等学校": {
"読み方": "ほくりょうこうとうがっこう",
"所在位置": "佐賀県"
},
"星野高等学校": {
"読み方": "ほしのこうとうがっこう",
"所在位置": "埼玉県"
},
"細田学園高等学校": {
"読み方": "ほそだがくえんこうとうがっこう",
"所在位置": "埼玉県"
},
"誉高等学校": {
"読み方": "ほまれこうとうがっこう",
"所在位置": "愛知県"
},
"本庄第一高等学校": {
"読み方": "ほんじょうだいいちこうとうがっこう",
"所在位置": "埼玉県"
},
"本庄東高等学校": {
"読み方": "ほんじょうひがしこうとうがっこう",
"所在位置": "埼玉県"
},
"前橋育英高等学校": {
"読み方": "まえばしいくえいこうとうがっこう",
"所在位置": "群馬県"
},
"前橋市立前橋高等学校": {
"読み方": "まえばししりつまえばしこうとうがっこう",
"所在位置": "群馬県"
},
"誠恵高等学校": {
"読み方": "せいけいこうとうがっこう",
"所在位置": "静岡県"
},
"真和高等学校": {
"読み方": "しんわこうとうがっこう",
"所在位置": "熊本県"
},
"益田永島学園 明誠高等学校": {
"読み方": "ますだながしまがくえんめいせいこうとうがっこう",
"所在位置": "島根県"
},
"松江市立皆美が丘女子高等学校": {
"読み方": "まつえしりつ みなみがおかじょしこうとうがっこう",
"所在位置": "島根県"
},
"松商学園高等学校": {
"読み方": "まつしょうがくえんこうとうがっこう",
"所在位置": "長野県"
},
"松戸市立松戸高等学校": {
"読み方": "まつどしりつまつどこうとうがっこう",
"所在位置": "千葉県"
},
"松本第一高等学校": {
"読み方": "まつもとだいいちこうとうがっこう",
"所在位置": "長野県"
},
"松山東雲高等学校": {
"読み方": "まつやましののめこうとうがっこう",
"所在位置": "愛媛県"
},
"松山聖陵高等学校": {
"読み方": "まつやませいりょうこうとうがっこう",
"所在位置": "愛媛県"
},
"松山学院高等学校": {
"読み方": "まつやまじょうなんこうとうがっこう",
"所在位置": "愛媛県"
},
"三浦学苑高等学校": {
"読み方": "みうらがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"三重高等学校": {
"読み方": "みえこうとうがっこう",
"所在位置": "三重県"
},
"明野高等学校": {
"読み方": "あけのこうとうがっこう",
"所在位置": "三重県"
},
"あけぼの学園高等学校": {
"読み方": "あけぼのがくえんこうとうがっこう",
"所在位置": "三重県"
},
"飯南高等学校": {
"読み方": "いいなんこうとうがっこう",
"所在位置": "三重県"
},
"飯野高等学校": {
"読み方": "いいのこうとうがっこう",
"所在位置": "三重県"
},
"伊賀白鳳高等学校": {
"読み方": "いがはくほうこうとうがっこう",
"所在位置": "三重県"
},
"石薬師高等学校": {
"読み方": "いしやくしこうとうがっこう",
"所在位置": "三重県"
},
"伊勢高等学校": {
"読み方": "いせこうとうがっこう",
"所在位置": "三重県"
},
"伊勢工業高等学校": {
"読み方": "いせこうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"伊勢まなび高等学校": {
"読み方": "いせまなびこうとうがっこう",
"所在位置": "三重県"
},
"いなべ総合学園高等学校": {
"読み方": "いなべそうごうがくえんこうとうがっこう",
"所在位置": "三重県"
},
"稲生高等学校": {
"読み方": "いのうこうとうがっこう",
"所在位置": "三重県"
},
"上野高等学校": {
"読み方": "うえのこうとうがっこう",
"所在位置": "三重県"
},
"宇治山田高等学校": {
"読み方": "うじやまだこうとうがっこう",
"所在位置": "三重県"
},
"宇治山田商業高等学校": {
"読み方": "うじやまだしょうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"相可高等学校": {
"読み方": "おうかこうとうがっこう",
"所在位置": "三重県"
},
"尾鷲高等学校": {
"読み方": "おわせこうとうがっこう",
"所在位置": "三重県"
},
"亀山高等学校": {
"読み方": "かめやまこうとうがっこう",
"所在位置": "三重県"
},
"紀南高等学校": {
"読み方": "きなんこうとうがっこう",
"所在位置": "三重県"
},
"桑名高等学校": {
"読み方": "くわなこうとうがっこう",
"所在位置": "三重県"
},
"桑名北高等学校": {
"読み方": "くわなきたこうとうがっこう",
"所在位置": "三重県"
},
"桑名工業高等学校": {
"読み方": "くわなこうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"桑名西高等学校": {
"読み方": "くわなにしこうとうがっこう",
"所在位置": "三重県"
},
"木本高等学校": {
"読み方": "きのもとこうとうがっこう",
"所在位置": "三重県"
},
"菰野高等学校": {
"読み方": "こものこうとうがっこう",
"所在位置": "三重県"
},
"志摩高等学校": {
"読み方": "しまこうとうがっこう",
"所在位置": "三重県"
},
"白子高等学校": {
"読み方": "しろここうとうがっこう",
"所在位置": "三重県"
},
"昴学園高等学校": {
"読み方": "すばるがくえんこうとうがっこう",
"所在位置": "三重県"
},
"津高等学校": {
"読み方": "つこうとうがっこう",
"所在位置": "三重県"
},
"津工業高等学校": {
"読み方": "つこうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"津商業高等学校": {
"読み方": "つしょうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"津西高等学校": {
"読み方": "つにしこうとうがっこう",
"所在位置": "三重県"
},
"津東高等学校": {
"読み方": "つひがしこうとうがっこう",
"所在位置": "三重県"
},
"鳥羽高等学校": {
"読み方": "とばこうとうがっこう",
"所在位置": "三重県"
},
"朝明高等学校": {
"読み方": "あさけこうとうがっこう",
"所在位置": "三重県"
},
"名張高等学校": {
"読み方": "なばりこうとうがっこう",
"所在位置": "三重県"
},
"名張青峰高等学校": {
"読み方": "なばりせいほうこうとうがっこう",
"所在位置": "三重県"
},
"久居高等学校": {
"読み方": "ひさいこうとうがっこう",
"所在位置": "三重県"
},
"久居農林高等学校": {
"読み方": "ひさいのうりんこうとうがっこう",
"所在位置": "三重県"
},
"北星高等学校": {
"読み方": "ほくせいこうとうがっこう",
"所在位置": "三重県"
},
"松阪高等学校": {
"読み方": "まつさかこうとうがっこう",
"所在位置": "三重県"
},
"松阪工業高等学校": {
"読み方": "まつさかこうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"松阪商業高等学校": {
"読み方": "まつさかしょうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"みえ夢学園高等学校": {
"読み方": "みえゆめがくえんこうとうがっこう",
"所在位置": "三重県"
},
"四日市高等学校": {
"読み方": "よっかいちこうとうがっこう",
"所在位置": "三重県"
},
"四日市工業高等学校": {
"読み方": "よっかいちこうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"四日市商業高等学校": {
"読み方": "よっかいちしょうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"四日市中央工業高等学校": {
"読み方": "よっかいちちゅうおうこうぎょうこうとうがっこう",
"所在位置": "三重県"
},
"四日市西高等学校": {
"読み方": "よっかいちにしこうとうがっこう",
"所在位置": "三重県"
},
"四日市農芸高等学校": {
"読み方": "よっかいちのうげいこうとうがっこう",
"所在位置": "三重県"
},
"四日市南高等学校": {
"読み方": "よっかいちみなみこうとうがっこう",
"所在位置": "三重県"
},
"四日市四郷高等学校": {
"読み方": "よっかいちよごうこうとうがっこう",
"所在位置": "三重県"
},
"三島学園 知徳高等学校": {
"読み方": "ちとくこうとうがっこう",
"所在位置": "静岡県"
},
"水城高等学校": {
"読み方": "すいじょうこうとうがっこう",
"所在位置": "茨城県"
},
"水谷学園出雲北陵高等学校": {
"読み方": "いずもほくりょうこうとうがっこう",
"所在位置": "島根県"
},
"聖園女学院高等学校": {
"読み方": "みそのじょがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"三田学園高等学校": {
"読み方": "さんだがくえんこうとうがっこう",
"所在位置": "兵庫県"
},
"三田松聖高等学校": {
"読み方": "さんだしょうせいこうとうがっこう",
"所在位置": "兵庫県"
},
"水戸葵陵高等学校": {
"読み方": "みときりょうこうとうがっこう",
"所在位置": "茨城県"
},
"水戸女子高等学校": {
"読み方": "みとじょしこうとうがっこう",
"所在位置": "茨城県"
},
"水戸啓明高等学校": {
"読み方": "みとけいめいこうとうがっこう",
"所在位置": "茨城県"
},
"緑ヶ丘女子高等学校": {
"読み方": "みどりがおかじょしこうとうがっこう",
"所在位置": "神奈川県"
},
"南山国際高等学校": {
"読み方": "なんざんこくさいこうとうがっこう",
"所在位置": "愛知県"
},
"南山高等学校女子部": {
"読み方": "なんざんこうとうがっこうじょしぶ",
"所在位置": "愛知県"
},
"南山高等学校男子部": {
"読み方": "なんざんこうとうがっこうだんしぶ",
"所在位置": "愛知県"
},
"美濃加茂高等学校": {
"読み方": "みのかもこうとうがっこう",
"所在位置": "岐阜県"
},
"美萩野女子高等学校": {
"読み方": "みはぎのじょしこうとうがっこう",
"所在位置": "福岡県"
},
"宮城学院高等学校": {
"読み方": "みやぎがくいんこうとうがっこう",
"所在位置": "宮城県"
},
"石巻高等学校": {
"読み方": "いしのまきこうとうがっこう",
"所在位置": "宮城県"
},
"石巻北高等学校": {
"読み方": "けんいしのまききたこうとうがっこう",
"所在位置": "宮城県"
},
"石巻工業高等学校": {
"読み方": "けんいしのまきこうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"石巻好文館高等学校": {
"読み方": "いしのまきこうぶんかんこうとうがっこう",
"所在位置": "宮城県"
},
"石巻商業高等学校": {
"読み方": "いしのまきしょうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"石巻西高等学校": {
"読み方": "いしのまきにしこうとうがっこう",
"所在位置": "宮城県"
},
"泉松陵高等学校": {
"読み方": "いずみしょうりょうこうとうがっこう",
"所在位置": "宮城県"
},
"泉館山高等学校": {
"読み方": "いずみたてやまこうとうがっこう",
"所在位置": "宮城県"
},
"登米総合産業高等学校": {
"読み方": "とめそうごうさんぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"大河原商業高等学校": {
"読み方": "おおがわらしょうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"黒川高等学校": {
"読み方": "くろかわこうとうがっこう",
"所在位置": "宮城県"
},
"気仙沼高等学校": {
"読み方": "けせんぬまこうとうがっこう",
"所在位置": "宮城県"
},
"気仙沼向洋高等学校": {
"読み方": "けんけせんぬまこうようこうとうがっこう",
"所在位置": "宮城県"
},
"宮城県工業高等学校": {
"読み方": "みやぎけんこうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"小牛田農林高等学校": {
"読み方": "けんこごたのうりんこうとうがっこう",
"所在位置": "宮城県"
},
"佐沼高等学校": {
"読み方": "さぬまこうとうがっこう",
"所在位置": "宮城県"
},
"塩釜高等学校": {
"読み方": "しおがまこうとうがっこう",
"所在位置": "宮城県"
},
"柴田高等学校": {
"読み方": "しばたこうとうがっこう",
"所在位置": "宮城県"
},
"柴田農林高等学校": {
"読み方": "しばたのうりんこうとうがっこう",
"所在位置": "宮城県"
},
"白石高等学校": {
"読み方": "しろいしこうとうがっこう",
"所在位置": "宮城県"
},
"白石工業高等学校": {
"読み方": "けんしろいしこうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"角田高等学校": {
"読み方": "かくだこうとうがっこう",
"所在位置": "宮城県"
},
"仙台三桜高等学校": {
"読み方": "せんだいさんおうこうとうがっこう",
"所在位置": "宮城県"
},
"仙台第一高等学校": {
"読み方": "せんだいだいいちこうとうがっこう",
"所在位置": "宮城県"
},
"仙台第三高等学校": {
"読み方": "せんだいだいさんこうとうがっこう",
"所在位置": "宮城県"
},
"仙台第二高等学校": {
"読み方": "せんだいだいにこうとうがっこう",
"所在位置": "宮城県"
},
"仙台西高等学校": {
"読み方": "せんだいにしこうとうがっこう",
"所在位置": "宮城県"
},
"仙台東高等学校": {
"読み方": "せんだいひがしこうとうがっこう",
"所在位置": "宮城県"
},
"仙台二華高等学校": {
"読み方": "けんせんだいにかこうとうがっこう",
"所在位置": "宮城県"
},
"仙台南高等学校": {
"読み方": "せんだいみなみこうとうがっこう",
"所在位置": "宮城県"
},
"仙台向山高等学校": {
"読み方": "けんせんだいむかいやまこうとうがっこう",
"所在位置": "宮城県"
},
"多賀城高等学校": {
"読み方": "たがじょうこうとうがっこう",
"所在位置": "宮城県"
},
"築館高等学校": {
"読み方": "つきだてこうとうがっこう",
"所在位置": "宮城県"
},
"貞山高等学校": {
"読み方": "ていざんこうとうがっこう",
"所在位置": "宮城県"
},
"富谷高等学校": {
"読み方": "けんとみやこうとうがっこう",
"所在位置": "宮城県"
},
"登米高等学校": {
"読み方": "とめこうとうがっこう",
"所在位置": "宮城県"
},
"中新田高等学校": {
"読み方": "けんなかにいだこうとうがっこう",
"所在位置": "宮城県"
},
"名取高等学校": {
"読み方": "なとりこうとうがっこう",
"所在位置": "宮城県"
},
"名取北高等学校": {
"読み方": "けんなとりきたこうとうがっこう",
"所在位置": "宮城県"
},
"宮城県農業高等学校": {
"読み方": "みやぎけんのうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"迫桜高等学校": {
"読み方": "はくおうこうとうがっこう",
"所在位置": "宮城県"
},
"東松島高等学校": {
"読み方": "ひがしまつしまこうとうがっこう",
"所在位置": "宮城県"
},
"古川高等学校": {
"読み方": "ふるかわこうとうがっこう",
"所在位置": "宮城県"
},
"古川工業高等学校": {
"読み方": "ふるかわこうぎょうこうとうがっこう",
"所在位置": "宮城県"
},
"古川黎明高等学校": {
"読み方": "ふるかわれいめいこうとうがっこう",
"所在位置": "宮城県"
},
"松島高等学校": {
"読み方": "まつしまこうとうがっこう",
"所在位置": "宮城県"
},
"宮城第一高等学校": {
"読み方": "みやぎだいいちこうとうがっこう",
"所在位置": "宮城県"
},
"宮城野高等学校": {
"読み方": "みやぎのこうとうがっこう",
"所在位置": "宮城県"
},
"宮城広瀬高等学校": {
"読み方": "みやぎひろせこうとうがっこう",
"所在位置": "宮城県"
},
"村田高等学校": {
"読み方": "むらたこうとうがっこう",
"所在位置": "宮城県"
},
"本吉響高等学校": {
"読み方": "けんもとよしひびきこうとうがっこう",
"所在位置": "宮城県"
},
"利府高等学校": {
"読み方": "りふこうとうがっこう",
"所在位置": "宮城県"
},
"涌谷高等学校": {
"読み方": "わくやこうとうがっこう",
"所在位置": "宮城県"
},
"亘理高等学校": {
"読み方": "けんわたりこうとうがっこう",
"所在位置": "宮城県"
},
"都城高等学校": {
"読み方": "みやこのじょうこうとうがっこう",
"所在位置": "宮崎県"
},
"都城聖ドミニコ学園高等学校": {
"読み方": "みやこのじょうせいどみにこがくえんこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎学園高等学校": {
"読み方": "みやざきがくえんこうとうがっこう",
"所在位置": "宮崎県"
},
"門川高等学校": {
"読み方": "かどがわこうとうがっこう",
"所在位置": "宮崎県"
},
"小林高等学校": {
"読み方": "こばやしこうとうがっこう",
"所在位置": "宮崎県"
},
"小林秀峰高等学校": {
"読み方": "こばやししゅうほうこうとうがっこう",
"所在位置": "宮崎県"
},
"佐土原高等学校": {
"読み方": "さどわらこうとうがっこう",
"所在位置": "宮崎県"
},
"高城高等学校": {
"読み方": "たかじょうこうとうがっこう",
"所在位置": "宮崎県"
},
"高鍋高等学校": {
"読み方": "たかなべこうとうがっこう",
"所在位置": "宮崎県"
},
"高鍋農業高等学校": {
"読み方": "たかなべのうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"妻高等学校": {
"読み方": "つまこうとうがっこう",
"所在位置": "宮崎県"
},
"富島高等学校": {
"読み方": "とみしまこうとうがっこう",
"所在位置": "宮崎県"
},
"日南高等学校": {
"読み方": "にちなんこうとうがっこう",
"所在位置": "宮崎県"
},
"日南振徳高等学校": {
"読み方": "にちなんしんとくこうとうがっこう",
"所在位置": "宮崎県"
},
"延岡高等学校": {
"読み方": "のべおかこうとうがっこう",
"所在位置": "宮崎県"
},
"延岡工業高等学校": {
"読み方": "のべおかこうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"延岡商業高等学校": {
"読み方": "のべおかしょうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"延岡星雲高等学校": {
"読み方": "のべおかせいうんこうとうがっこう",
"所在位置": "宮崎県"
},
"日向高等学校": {
"読み方": "ひゅうがこうとうがっこう",
"所在位置": "宮崎県"
},
"日向工業高等学校": {
"読み方": "ひゅうがこうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"都城泉ヶ丘高等学校": {
"読み方": "みやこのじょういずみがおかこうとうがっこう",
"所在位置": "宮崎県"
},
"都城工業高等学校": {
"読み方": "みやこのじょうこうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"都城商業高等学校": {
"読み方": "みやこのじょうしょうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"都城西高等学校": {
"読み方": "みやこのじょうにしこうとうがっこう",
"所在位置": "宮崎県"
},
"都城農業高等学校": {
"読み方": "みやこのじょうのうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎大宮高等学校": {
"読み方": "みやざきおおみやこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎海洋高等学校": {
"読み方": "みやざきかいようこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎北高等学校": {
"読み方": "みやざききたこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎工業高等学校": {
"読み方": "みやざきこうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎商業高等学校": {
"読み方": "みやざきしょうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎西高等学校": {
"読み方": "みやざきにしこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎農業高等学校": {
"読み方": "みやざきのうぎょうこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎東高等学校": {
"読み方": "みやざきひがしこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎南高等学校": {
"読み方": "みやざきみなみこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎第一高等学校": {
"読み方": "みやざきだいいちこうとうがっこう",
"所在位置": "宮崎県"
},
"宮崎日本大学高等学校": {
"読み方": "みやざきにほんだいがくこうとうがっこう",
"所在位置": "宮崎県"
},
"武庫川女子大学附属高等学校": {
"読み方": "むこがわじょしだいがくふぞくこうとうがっこう",
"所在位置": "兵庫県"
},
"武蔵越生高等学校": {
"読み方": "むさしおごせこうとうがっこう",
"所在位置": "埼玉県"
},
"武蔵野音楽大学附属高等学校": {
"読み方": "むさしのおんがくだいがくふぞくこうとうがっこう",
"所在位置": "埼玉県"
},
"武蔵野星城高等学校": {
"読み方": "むさしのせいじょうこうとうがっこう",
"所在位置": "埼玉県"
},
"明桜高等学校": {
"読み方": "めいおうこうとうがっこう",
"所在位置": "秋田県"
},
"茗溪学園高等学校": {
"読み方": "めいけいがくえんこうとうがっこう",
"所在位置": "茨城県"
},
"明光学園高等学校": {
"読み方": "めいこうがくえんこうとうがっこう",
"所在位置": "福岡県"
},
"明治学園高等学校": {
"読み方": "めいじがくえんちゅうがくこうとうがっこう",
"所在位置": "福岡県"
},
"名城大学附属高等学校": {
"読み方": "めいじょうだいがくふぞくこうとうがっこう",
"所在位置": "愛知県"
},
"明誠学院高等学校": {
"読み方": "めいせいがくいんこうとうがっこう",
"所在位置": "岡山県"
},
"明豊高等学校": {
"読み方": "めいほうこうとうがっこう",
"所在位置": "大分県"
},
"明和県央高等学校": {
"読み方": "めいわけんおうこうとうがっこう",
"所在位置": "群馬県"
},
"四日市メリノール学院": {
"読み方": "よっかいちめりのーるがくいん",
"所在位置": "三重県"
},
"茂原北陵高等学校": {
"読み方": "もばらほくりょうこうとうがっこう",
"所在位置": "千葉県"
},
"盛岡誠桜高等学校": {
"読み方": "もりおかせいおうこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡白百合学園高等学校": {
"読み方": "もりおかしらゆりがくえんこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡市立高等学校": {
"読み方": "もりおかしりつこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡スコーレ高等学校": {
"読み方": "もりおかすこーれこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡大学附属高等学校": {
"読み方": "もりおかだいがくふぞくこうとうがっこう",
"所在位置": "岩手県"
},
"盛岡中央高等学校": {
"読み方": "もりおかちゅうおうこうとうがっこう",
"所在位置": "岩手県"
},
"森村学園高等部": {
"読み方": "もりむらがくえんこうとうぶ",
"所在位置": "神奈川県"
},
"矢板中央高等学校": {
"読み方": "やいたちゅうおうこうとうがっこう",
"所在位置": "栃木県"
},
"焼津高等学校": {
"読み方": "やいづこうとうがっこう",
"所在位置": "静岡県"
},
"屋久島おおぞら高等学校": {
"読み方": "やくしまおおぞらこうとうがっこう",
"所在位置": "鹿児島県"
},
"安田女子高等学校": {
"読み方": "やすだじょしこうとうがっこう",
"所在位置": "広島県"
},
"鳥取城北高等学校": {
"読み方": "とっとりじょうほくこうとうがっこう",
"所在位置": "鳥取県"
},
"八千代松陰高等学校": {
"読み方": "やちよしょういんこうとうがっこう",
"所在位置": "千葉県"
},
"八代白百合学園高等学校": {
"読み方": "やつしろしらゆりがくえんこうとうがっこう",
"所在位置": "熊本県"
},
"愛知黎明高等学校": {
"読み方": "あいちれいめいこうとうがっこう",
"所在位置": "愛知県"
},
"柳井学園高等学校": {
"読み方": "やないがくえんこうとうがっこう",
"所在位置": "山口県"
},
"柳川高等学校": {
"読み方": "やながわこうとうがっこう",
"所在位置": "福岡県"
},
"蒼開高等学校": {
"読み方": "そうかいこうとうがっこう",
"所在位置": "兵庫県"
},
"山形学院高等学校": {
"読み方": "やまがたがくいんこうとうがっこう",
"所在位置": "山形県"
},
"左沢高等学校": {
"読み方": "あてらざわこうとうがっこう",
"所在位置": "山形県"
},
"置賜農業高等学校": {
"読み方": "おきたまのうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"霞城学園高等学校": {
"読み方": "かじょうがくえんこうとうがっこう",
"所在位置": "山形県"
},
"上山明新館高等学校": {
"読み方": "かみのやまめいしんかんこうとうがっこう",
"所在位置": "山形県"
},
"北村山高等学校": {
"読み方": "きたむらやまこうとうがっこう",
"所在位置": "山形県"
},
"寒河江高等学校": {
"読み方": "さがえこうとうがっこう",
"所在位置": "山形県"
},
"寒河江工業高等学校": {
"読み方": "さがえこうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"酒田西高等学校": {
"読み方": "さかたにしこうとうがっこう",
"所在位置": "山形県"
},
"酒田東高等学校": {
"読み方": "さかたひがしこうとうがっこう",
"所在位置": "山形県"
},
"庄内総合高等学校": {
"読み方": "しょうないそうごうこうとうがっこう",
"所在位置": "山形県"
},
"庄内農業高等学校": {
"読み方": "しょうないのうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"新庄神室産業高等学校": {
"読み方": "しんじょうかむろさんぎょうこうとうがっこう",
"所在位置": "山形県"
},
"新庄北高等学校": {
"読み方": "しんじょうきたこうとうがっこう",
"所在位置": "山形県"
},
"新庄南高等学校": {
"読み方": "しんじょうみなみこうとうがっこう",
"所在位置": "山形県"
},
"鶴岡北高等学校": {
"読み方": "つるおかきたこうとうがっこう",
"所在位置": "山形県"
},
"鶴岡工業高等学校": {
"読み方": "つるおかこうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"鶴岡中央高等学校": {
"読み方": "つるおかちゅうおうこうとうがっこう",
"所在位置": "山形県"
},
"鶴岡南高等学校": {
"読み方": "つるおかみなみこうとうがっこう",
"所在位置": "山形県"
},
"天童高等学校": {
"読み方": "てんどうこうとうがっこう",
"所在位置": "山形県"
},
"長井高等学校": {
"読み方": "ながいこうとうがっこう",
"所在位置": "山形県"
},
"谷地高等学校": {
"読み方": "やちこうとうがっこう",
"所在位置": "山形県"
},
"山形北高等学校": {
"読み方": "やまがたきたこうとうがっこう",
"所在位置": "山形県"
},
"山形工業高等学校": {
"読み方": "やまがたこうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"山形中央高等学校": {
"読み方": "やまがたちゅうおうこうとうがっこう",
"所在位置": "山形県"
},
"山形西高等学校": {
"読み方": "やまがたにしこうとうがっこう",
"所在位置": "山形県"
},
"山形東高等学校": {
"読み方": "やまがたひがしこうとうがっこう",
"所在位置": "山形県"
},
"山形南高等学校": {
"読み方": "やまがたみなみこうとうがっこう",
"所在位置": "山形県"
},
"山辺高等学校": {
"読み方": "やまのべこうとうがっこう",
"所在位置": "山形県"
},
"遊佐高等学校": {
"読み方": "ゆざこうとうがっこう",
"所在位置": "山形県"
},
"米沢工業高等学校": {
"読み方": "よねざわこうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"米沢興譲館高等学校": {
"読み方": "よねざわこうじょうかんこうとうがっこう",
"所在位置": "山形県"
},
"米沢商業高等学校": {
"読み方": "よねざわしょうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"米沢東高等学校": {
"読み方": "よねざわひがしこうとうがっこう",
"所在位置": "山形県"
},
"東北文教大学山形城北高等学校": {
"読み方": "やまがたじょうほくこうとうがっこう",
"所在位置": "山形県"
},
"山形市立商業高等学校": {
"読み方": "やまがたしりつしょうぎょうこうとうがっこう",
"所在位置": "山形県"
},
"創学館高等学校": {
"読み方": "そうがくかんこうとうがっこう",
"所在位置": "山形県"
},
"山口県鴻城高等学校": {
"読み方": "やまぐちけんこうじょうこうとうがっこう",
"所在位置": "山口県"
},
"山口県桜ケ丘高等学校": {
"読み方": "やまぐちけんさくらがおかこうとうがっこう",
"所在位置": "山口県"
},
"美祢青嶺高等学校": {
"読み方": "みねせいりょうこうとうがっこう",
"所在位置": "山口県"
},
"厚狭高等学校": {
"読み方": "あさこうとうがっこう",
"所在位置": "山口県"
},
"岩国高等学校": {
"読み方": "いわくにこうとうがっこう",
"所在位置": "山口県"
},
"岩国商業高等学校": {
"読み方": "いわくにしょうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"岩国総合高等学校": {
"読み方": "いわくにそうごうこうとうがっこう",
"所在位置": "山口県"
},
"宇部高等学校": {
"読み方": "うべこうとうがっこう",
"所在位置": "山口県"
},
"宇部工業高等学校": {
"読み方": "うべこうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"宇部商業高等学校": {
"読み方": "うべしょうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"宇部中央高等学校": {
"読み方": "うべちゅうおうこうとうがっこう",
"所在位置": "山口県"
},
"宇部西高等学校": {
"読み方": "うべにしこうとうがっこう",
"所在位置": "山口県"
},
"小野田高等学校": {
"読み方": "おのだこうとうがっこう",
"所在位置": "山口県"
},
"小野田工業高等学校": {
"読み方": "おのだこうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"華陵高等学校": {
"読み方": "かりょうこうとうがっこう",
"所在位置": "山口県"
},
"下松高等学校": {
"読み方": "くだまつこうとうがっこう",
"所在位置": "山口県"
},
"下松工業高等学校": {
"読み方": "くだまつこうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"熊毛北高等学校": {
"読み方": "くまげきたこうとうがっこう",
"所在位置": "山口県"
},
"熊毛南高等学校": {
"読み方": "くまげみなみこうとうがっこう",
"所在位置": "山口県"
},
"下関工科高等学校": {
"読み方": "しものせきこうかこうとうがっこう",
"所在位置": "山口県"
},
"下関西高等学校": {
"読み方": "しものせきにしこうとうがっこう",
"所在位置": "山口県"
},
"下関南高等学校": {
"読み方": "しものせきみなみこうとうがっこう",
"所在位置": "山口県"
},
"新南陽高等学校": {
"読み方": "しんなんようこうとうがっこう",
"所在位置": "山口県"
},
"高森高等学校": {
"読み方": "たかもりこうとうがっこう",
"所在位置": "山口県"
},
"田布施農工高等学校": {
"読み方": "たぶせのうこうこうとうがっこう",
"所在位置": "山口県"
},
"長府高等学校": {
"読み方": "ちょうふこうとうがっこう",
"所在位置": "山口県"
},
"徳山高等学校": {
"読み方": "とくやまこうとうがっこう",
"所在位置": "山口県"
},
"徳山商工高等学校": {
"読み方": "とくやましょうこうこうとうがっこう",
"所在位置": "山口県"
},
"豊浦高等学校": {
"読み方": "とよらこうとうがっこう",
"所在位置": "山口県"
},
"南陽工業高等学校": {
"読み方": "なんようこうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"西京高等学校": {
"読み方": "さいきょうこうとうがっこう",
"所在位置": "山口県"
},
"萩高等学校": {
"読み方": "はぎこうとうがっこう",
"所在位置": "山口県"
},
"光高等学校": {
"読み方": "ひかりこうとうがっこう",
"所在位置": "山口県"
},
"光丘高等学校": {
"読み方": "ひかりがおかこうとうがっこう",
"所在位置": "山口県"
},
"防府高等学校": {
"読み方": "ほうふこうとうがっこう",
"所在位置": "山口県"
},
"防府商工高等学校": {
"読み方": "ほうふしょうこうこうとうがっこう",
"所在位置": "山口県"
},
"防府西高等学校": {
"読み方": "ほうふにしこうとうがっこう",
"所在位置": "山口県"
},
"柳井高等学校": {
"読み方": "やないこうとうがっこう",
"所在位置": "山口県"
},
"山口高等学校": {
"読み方": "やまぐちこうとうがっこう",
"所在位置": "山口県"
},
"山口中央高等学校": {
"読み方": "やまぐちちゅうおうこうとうがっこう",
"所在位置": "山口県"
},
"山口農業高等学校": {
"読み方": "やまぐちのうぎょうこうとうがっこう",
"所在位置": "山口県"
},
"山手学院高等学校": {
"読み方": "やまてがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"大和青藍高等学校": {
"読み方": "やまとせいらんこうとうがっこう",
"所在位置": "福岡県"
},
"大和高田市立高田商業高等学校": {
"読み方": "やまとたかだしりつたかだしょうぎょうこうとうがっこう",
"所在位置": "奈良県"
},
"山梨学院高等学校": {
"読み方": "やまなしがくいんこうとうがっこう",
"所在位置": "山梨県"
},
"塩山高等学校": {
"読み方": "えんざんこうとうがっこう",
"所在位置": "山梨県"
},
"甲府工業高等学校": {
"読み方": "こうふこうぎょうこうとうがっこう",
"所在位置": "山梨県"
},
"甲府城西高等学校": {
"読み方": "こうふじょうさいこうとうがっこう",
"所在位置": "山梨県"
},
"甲府昭和高等学校": {
"読み方": "こうふしょうわこうとうがっこう",
"所在位置": "山梨県"
},
"甲府第一高等学校": {
"読み方": "こうふだいいちこうとうがっこう",
"所在位置": "山梨県"
},
"甲府西高等学校": {
"読み方": "こうふにしこうとうがっこう",
"所在位置": "山梨県"
},
"甲府東高等学校": {
"読み方": "こうふひがしこうとうがっこう",
"所在位置": "山梨県"
},
"甲府南高等学校": {
"読み方": "こうふみなみこうとうがっこう",
"所在位置": "山梨県"
},
"巨摩高等学校": {
"読み方": "こまこうとうがっこう",
"所在位置": "山梨県"
},
"白根高等学校": {
"読み方": "しらねこうとうがっこう",
"所在位置": "山梨県"
},
"都留高等学校": {
"読み方": "つるこうとうがっこう",
"所在位置": "山梨県"
},
"日川高等学校": {
"読み方": "ひかわこうとうがっこう",
"所在位置": "山梨県"
},
"韮崎高等学校": {
"読み方": "にらさきこうとうがっこう",
"所在位置": "山梨県"
},
"韮崎工業高等学校": {
"読み方": "にらさきこうぎょうこうとうがっこう",
"所在位置": "山梨県"
},
"農林高等学校": {
"読み方": "のうりんこうとうがっこう",
"所在位置": "山梨県"
},
"笛吹高等学校": {
"読み方": "ふえふきこうとうがっこう",
"所在位置": "山梨県"
},
"富士河口湖高等学校": {
"読み方": "ふじかわぐちここうとうがっこう",
"所在位置": "山梨県"
},
"富士北稜高等学校": {
"読み方": "ふじほくりょうこうとうがっこう",
"所在位置": "山梨県"
},
"北杜高等学校": {
"読み方": "ほくとこうとうがっこう",
"所在位置": "山梨県"
},
"身延高等学校": {
"読み方": "みのぶこうとうがっこう",
"所在位置": "山梨県"
},
"山梨高等学校": {
"読み方": "やまなしこうとうがっこう",
"所在位置": "山梨県"
},
"山梨英和高等学校": {
"読み方": "やまなしえいわこうとうがっこう",
"所在位置": "山梨県"
},
"惺山高等学校": {
"読み方": "やまもとがくえんこうとうがっこう",
"所在位置": "山形県"
},
"八女学院高等学校": {
"読み方": "やめがくいんこうとうがっこう",
"所在位置": "福岡県"
},
"遊学館高等学校": {
"読み方": "ゆうがっかんこうとうがっこう",
"所在位置": "石川県"
},
"勇志国際高等学校": {
"読み方": "ゆうしこくさいこうとうがっこう",
"所在位置": "熊本県"
},
"祐誠高等学校": {
"読み方": "ゆうせいこうとうがっこう",
"所在位置": "福岡県"
},
"百合学院高等学校": {
"読み方": "ゆりがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"湯梨浜学園高等学校": {
"読み方": "ゆりはまがくえんこうとうがっこう",
"所在位置": "鳥取県"
},
"楊志館高等学校": {
"読み方": "ようしかんこうとうがっこう",
"所在位置": "大分県"
},
"横芝敬愛高等学校": {
"読み方": "よこしばけいあいこうとうがっこう",
"所在位置": "千葉県"
},
"横須賀学院高等学校": {
"読み方": "よこすかがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"横須賀市立横須賀総合高等学校": {
"読み方": "よこすかしりつよこすかそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜高等学校": {
"読み方": "よこはまこうとうがっこう",
"所在位置": "神奈川県"
},
"青山学院横浜英和高等学校": {
"読み方": "あおやまがくいんよこはまえいわこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜学園高等学校": {
"読み方": "よこはまがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜共立学園高等学校": {
"読み方": "よこはまきょうりつがくえんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜翠陵高等学校": {
"読み方": "よこはますいりょうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜商科大学高等学校": {
"読み方": "よこはましょうかだいがくこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜女学院高等学校": {
"読み方": "よこはまじょがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立金沢高等学校": {
"読み方": "よこはましりつかなざわこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立桜丘高等学校": {
"読み方": "よこはましりつさくらがおかこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立戸塚高等学校": {
"読み方": "よこはましりつとつかこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立東高等学校": {
"読み方": "よこはましりつひがしこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立みなと総合高等学校": {
"読み方": "よこはましりつみなとそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立南高等学校": {
"読み方": "よこはましりつみなみこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立横浜サイエンスフロンティア高等学校": {
"読み方": "よこはましりつよこはまさいえんすふろんてぃあこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立横浜商業高等学校": {
"読み方": "よこはましりつよこはましょうぎょうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜市立横浜総合高等学校": {
"読み方": "よこはましりつよこはまそうごうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜清風高等学校": {
"読み方": "よこはませいふうこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜創英高等学校": {
"読み方": "よこはまそうえいこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜創学館高等学校": {
"読み方": "よこはまそうがくかんこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜隼人高等学校": {
"読み方": "よこはまはやとこうとうがっこう",
"所在位置": "神奈川県"
},
"横浜雙葉高等学校": {
"読み方": "よこはまふたばこうとうがっこう",
"所在位置": "神奈川県"
},
"米子北高等学校": {
"読み方": "よなごきたこうとうがっこう",
"所在位置": "鳥取県"
},
"米子永島学園米子松蔭高等学校": {
"読み方": "よなごしょういんこうとうがっこう",
"所在位置": "鳥取県"
},
"米沢中央高等学校": {
"読み方": "よねざわちゅうおうこうとうがっこう",
"所在位置": "山形県"
},
"ラ・サール高等学校": {
"読み方": "らさーるこうとうがっこう",
"所在位置": "鹿児島県"
},
"立花高等学校": {
"読み方": "たちばなこうとうがっこう",
"所在位置": "福岡県"
},
"立教新座高等学校": {
"読み方": "りっきょうにいざこうとうがっこう",
"所在位置": "埼玉県"
},
"立命館守山高等学校": {
"読み方": "りつめいかんもりやまこうとうがっこう",
"所在位置": "滋賀県"
},
"龍谷富山高等学校": {
"読み方": "りゅうこくとやまこうとうがっこう",
"所在位置": "富山県"
},
"流通経済大学付属柏高等学校": {
"読み方": "りゅうつうけいざいだいがくふぞくかしわこうとうがっこう",
"所在位置": "千葉県"
},
"ルーテル学院高等学校": {
"読み方": "るーてるがくいんこうとうがっこう",
"所在位置": "熊本県"
},
"ルネサンス高等学校": {
"読み方": "るねさんすこうとうがっこう",
"所在位置": "茨城県"
},
"麗澤高等学校": {
"読み方": "れいたくこうとうがっこう",
"所在位置": "千葉県"
},
"麗澤瑞浪高等学校": {
"読み方": "れいたくみずなみこうとうがっこう",
"所在位置": "岐阜県"
},
"れいめい高等学校": {
"読み方": "れいめいこうとうがっこう",
"所在位置": "鹿児島県"
},
"六甲学院高等学校": {
"読み方": "ろっこうがくいんこうとうがっこう",
"所在位置": "兵庫県"
},
"会津北嶺高等学校": {
"読み方": "あいづほくれいこうとうがっこう",
"所在位置": "福島県"
},
"有田中央高等学校": {
"読み方": "ありだちゅうおうこうとうがっこう",
"所在位置": "和歌山県"
},
"海南高等学校 海南校舎": {
"読み方": "かいなんこうとうがっこう かいなんこうしゃ",
"所在位置": "和歌山県"
},
"神島高等学校": {
"読み方": "かしまこうとうがっこう",
"所在位置": "和歌山県"
},
"紀央館高等学校": {
"読み方": "きおうかんこうとうがっこう",
"所在位置": "和歌山県"
},
"貴志川高等学校": {
"読み方": "きしがわこうとうがっこう",
"所在位置": "和歌山県"
},
"粉河高等学校": {
"読み方": "こかわこうとうがっこう",
"所在位置": "和歌山県"
},
"星林高等学校": {
"読み方": "せいりんこうとうがっこう",
"所在位置": "和歌山県"
},
"耐久高等学校": {
"読み方": "たいきゅうこうとうがっこう",
"所在位置": "和歌山県"
},
"田辺高等学校": {
"読み方": "たなべこうとうがっこう",
"所在位置": "和歌山県"
},
"田辺工業高等学校": {
"読み方": "たなべこうぎょうこうとうがっこう",
"所在位置": "和歌山県"
},
"桐蔭高等学校": {
"読み方": "とういんこうとうがっこう",
"所在位置": "和歌山県"
},
"那賀高等学校": {
"読み方": "なかこうとうがっこう",
"所在位置": "和歌山県"
},
"南部高等学校": {
"読み方": "みなべこうとうがっこう",
"所在位置": "和歌山県"
},
"箕島高等学校": {
"読み方": "みのしまこうとうがっこう",
"所在位置": "和歌山県"
},
"和歌山高等学校": {
"読み方": "わかやまこうとうがっこう",
"所在位置": "和歌山県"
},
"和歌山北高等学校 北校舎": {
"読み方": "わかやまにしこうとうがっこう きたこうしゃ",
"所在位置": "和歌山県"
},
"和歌山工業高等学校": {
"読み方": "わかやまこうぎょうこうとうがっこう",
"所在位置": "和歌山県"
},
"和歌山商業高等学校": {
"読み方": "わかやましょうぎょうこうとうがっこう",
"所在位置": "和歌山県"
},
"和歌山東高等学校": {
"読み方": "わかやまひがしこうとうがっこう",
"所在位置": "和歌山県"
},
"和歌山市立和歌山高等学校": {
"読み方": "わかやましりつわかやまこうとうがっこう",
"所在位置": "和歌山県"
},
"和歌山信愛高等学校": {
"読み方": "わかやましんあいこうとうがっこう",
"所在位置": "和歌山県"
},
"わせがく高等学校": {
"読み方": "わせがくこうとうがっこう",
"所在位置": "千葉県"
},
"早稲田実業学校": {
"読み方": "わせだじつぎょうがっこう",
"所在位置": "東京都"
},
"早稲田佐賀高等学校": {
"読み方": "わせださがこうとうがっこう",
"所在位置": "佐賀県"
},
"早稲田大学本庄高等学院": {
"読み方": "わせだだいがくほんじょうこうとうがくいん",
"所在位置": "埼玉県"
},
"和洋国府台女子高等学校": {
"読み方": "わようこうのだいじょしこうとうがっこう",
"所在位置": "千葉県"
},
"岡山朝日高等学校": {
"読み方": "おかやまあさひこうとうがっこう",
"所在位置": "岡山県"
},
"清水南高等学校": {
"読み方": "しみずみなみこうとうがっこう",
"所在位置": "静岡県"
},
"浜松西高等学校": {
"読み方": "はままつにしこうとうがっこう",
"所在位置": "静岡県"
},
"聖光学院高等学校": {
"読み方": "せいこうがくいんこうとうがっこう",
"所在位置": "神奈川県"
},
"大成高等学校": {
"読み方": "たいせいこうとうがっこう",
"所在位置": "愛知県"
}
};